<html><head><title>Tout sur le 3d ...</title></head>

<!-- Included in most of my pages -->
<body background="pictures/backgrounds/slate.gif"
text=#00ffde
link=#ffffff
alink=#ff0000
vlink=#c9c9c9>



<center>
<a href="avant_propos.html"><img src="pictures/icons/uk.gif" border=0></a><br>
<a href="pictures/wrl/vrml.wrl"><img src="pictures/vrml.gif" border=0></a>
</center>
<br><br>

<img src="pictures/animated/vrml.gif" align="middle">
<font size=10>Avant Propos: <i>Pour qui, pour quoi.</i></font>

<br><br>

<font size=4>

Le fait de travailller dans le domaine de la r&eacute;alit&eacute; virtuelle
conduit naturellement &agrave; s'int&eacute;resser aux techniques de 3d
existantes, et entre autres aux applications li&eacute;es au WWW. Le but de
cette page est de d&eacute;crire l'ensemble des &eacute;l&eacute;ments
n&eacute;cessaires &agrave; l'introduction du 3d dans le web, mais ceci d'une
mani&egrave;re s&eacute;quentielle plus que th&eacute;orique. Cela signifie que
je m'efforce de repr&eacute;senter les op&eacute;rations dans l'ordre
chronologique o&ugrave; elles devraient &ecirc;tre effectu&eacute;es, de
mani&egrave;re &agrave; ce que le lecteur puisse les appliquer
imm&eacute;diatement au moment o&ugrave; il les lit. Cependant, il faut savoir
que les renseignements que j'ai pu gl&acirc;ner sur le r&eacute;seau et
condenser ici ont &eacute;t&eacute; soumis &agrave; certains crit&egrave;res de
s&eacute;lection. Les voici:<br>

<ul>
  <li> Tout d'abord, j'ai la malchance de travailler sur des stations SUN (sous
      UNIX) qui n'ont pas (sauf une) de hardware sp&eacute;cial
      d&eacute;di&eacute; au graphique. Les diff&eacute;rents logiciels pour
      lesquels vous trouverez des liens et des commentaires dans cette page
      sont donc des logiciels que j'ai pu tester sur SUN et qui ne
      n&eacute;cessitent pas obligatoirement d'acc&eacute;l&eacute;rateurs
      graphiques. Beaucoup de ces logiciels fonctionnent sur de nombreuses
      platformes diff&eacute;rentes (pas seulement SUN) et donc m&eacute;ritent
      le d&eacute;tour. J'ai simplement choisi de ne pas citer ceux qui
      fonctionnent exclusivement sur des platformes que je n'utilise pas.</li>
  <li> Deuxi&egrave;mement, j'aime la gratuit&eacute; du logiciel sur le
      r&eacute;seau et les gens qui partagent leurs id&eacute;es. D'autre part,
      je ne vais pas faire gratuitement de la pub pour des boites qui vendent
      leurs produits. Donc il y a ici surtout des logiciels gratuits ou
      partiellement gratuits. Quelques fois peut-&ecirc;tre, on trouvera un
      lien sur une demo gratuite d'un logiciel commercial ... mais pas trop
      quand m&ecirc;me !</li>
</ul>
</font>

<h3>Voila, c'est tout pour la mise au point.</h3>

<br><br>

<table border=0>
  <tr>
    <td>
	<table border=3 cellpadding=0>
	  <tr>
	    <td><a href="../index-fr.html#choix">
		<img src="pictures/arrows/docscont.gif" alt="TOP" border=0>
	    </td></a>
	    <td><a href="index-fr.html">
		<img src="pictures/arrows/docsupar.gif" alt="HAUT" border=0>
	    </td></a>
	    <td><a href="introduction.html">
		<img src="pictures/arrows/docsrigh.gif" alt="DROITE" border=0>
	    </td></a>
	  </tr>
    </table>
</td>
<td><img src="pictures/icons/0katt022.gif">
<img src="pictures/icons/2katt022.gif">
<img src="pictures/icons/6katt022.gif">
<img src="pictures/icons/4katt022.gif">
</td>
</tr>
</table>

<!-- Inclus dans la plupart de mes pages -->
<hr size=5>
<i>Page Maintenue par <a href="/~verna/index-fr.html">Didier Verna</a> &nbsp;
<a href=mailto:verna@inf.enst.fr>(verna@inf.enst.fr)</a><br>
Dernière mise à jour:



<!-- hhmts start -->
Fri Mar  7 11:13:44 MET 1997
<!-- hhmts end -->
</i>


</body></html>
