<TITLE>
Les copains...
</TITLE>

<BODY BACKGROUND=image/moifond.jpg text=#CFBFF5>

<BR>
<BR>
<H2>

Je vais vous pr&eacute;senter la plupart de mes copains. J'ai pu quelquefois obtenir des photos d'eux, cliquez alors sur leur nom et ils apparaitront comme par enchantement...
<BR>
<BR>

On commence par David, l'homme des bois et montagnes. Il vit dans le Nord-Est, pr&egrave;s de Charleville, mais il vient des Alpes. Comme moi il s'int&eacute;resse a l'entomologie et aux animaux en g&eacute;n&eacute;ral. Il poursuit actuellement ses &eacute;tudes pour devenir garde forestier. Son fr&egrave;re Didier est une vraie teigne mais il joue bien &agrave; la p&eacute;tanque...
<BR>
<BR>
Voil&agrave; venir maintenant <A HREF="image/wong.jpg">Vander</A>, alias VDB, alias Wunder, alias Mike... Ce type c'est un "gars du Nord". Il a d&eacute;barqu&eacute; un jour dans le Gard (alors que personne s'y attendait) et depuis il s'y plait. Il joue aux &eacute;checs comme Moa (mais moins bien que Mooaaah, bien sur...); d'ailleurs on a fait beaucoup de comp&eacute;titions ensemble. C'est un grand amateur de filles, qui ne r&eacute;sistent pas longtemps &agrave; son sourire charmeur. Il est actuellement &agrave la fac de Montpellier.
<BR>
<BR>
Bon, rigolez pas, celui-l&agrave; il s'app&egrave;le <A HREF="image/bebel.jpg"> Yagouine</A>... Bien sur ce n'est pas son vrai nom mais c'est sympa alors maintenant c'est son nom! On le voit avec <A HREF="image/bebel.jpg">Bruno </a>.C'est au Lyc&eacute;e Joffre, &agrave; Montpellier, que je les ai connus, au cours du bizuthage... Impossible de raconter ici toutes les aventures de l'internat, mais pour r&eacute;sumer c'&eacute;tait vraiment le d&eacute;lire! Boules de neige, courses de caddies, anniversaires bien arros&eacute;s... Les autres membres de l'&eacute;quipage: Fred, Jean, Frappe Pure (dit Rodolphe...), Cazalouuu et d'autres...Une photo quand m&ecirc;me de l'ensemble de la sup4 promo 201, le premier jour, quand on a d&eacute;boul&eacute; dans leur <A HREF="image/classe.jpg">classe</a>... Ils &eacute;taient un peu intimid&eacute;s mais on les a vite mis en confiance car &agrave; Montpellier le bizuthage est tr&egrave;s convivial. 
<BR>
<BR>
Voil&agrave; maintenant un type qui devrait pas vous casser les pieds. C'est <A HREF="image/oli.jpg">Olivier</A>, le cal&eacute;donnien; une vraie cr&egrave;me. Il est venu faire des &eacute;tudes de m&eacute;decine &agrave; la fac de Montpellier, mais il est reparti sur son ile recemment.
<BR>
<BR>
Ca c'est <A HREF="image/vander.jpg">Mikeul Wong</a>. Il agonise un peu car on s'incruste pas mal chez lui en ce moment et on lui tchoure tout ses chocalats. En tout cas celui-l&agrave;, mesdemoiselles, il fait tr&egrave;s bien la cuisine, occasion &agrave; saisir. (Moi je fais tr&egrave;s bien la vaisselle...)
<BR>
<BR>
En cliquant <A HREF="image/youth.jpg">ici</A> vous pourrez d&eacute;couvrir Youf alias Sebastien Ufer, alias le Jean Pierre Coffe du saucisson... Il est maintenant &agrave; Valenciennes dans une ENSI. On &eacute;tait en pr&eacute;pa ensemble, enfin facon de parler car il s&eacute;chait pas mal de cours!
<BR>
<BR>

Celui-l&agrave; tout le monde le connait, c'est mon grand pote...<A HREF="image/bib.jpg">la preuve!</a>
<BR>
<BR>
D'autre part, j'ai des relations politiques au plus haut niveau, comme le montre cette photo avec <A HREF="image/maire.jpg">Georges Fr&ecirc;che</a>,le maire de Montpellier. Bon je crois que l&agrave; c'est un peu trop gros...
<BR>
<BR>
Voici maintenant quelques copains qui ont leur propre page web, je les laisse se pr&eacute;senter:
<BR>
<a href="http://www-stud.enst.fr/~bdeoui">Amer Bd&eacute;oui</a> qui est a T&eacute;l&eacute;com avec moi. On a travaill&eacute; ensemble au premier trimestre et ca c'est bien pass&eacute;. 
<BR>
<a href="http://www-stud.enst.fr/~lecomte">S&eacute;bastien Lecomte</a> et  <a href="http://www-stud.enst.fr/~bhavet">Bruno Havet</a>  qui s'ocuppent avec Florian Henaux et moi-meme d'une organisation secr&egrave;te. Chutttt, je peux pas en dire plus!
<BR>
<BR>
<a href="index.html"> Retour </a>&agrave; la page principale.