<TITLE>
Ma Vie...
</TITLE>

<BODY BACKGROUND=image/moifond.jpg text=#FAAFF5>
Ma vie, selon Sebastien...

<BR>
<BR>
<H2>

C'est sous le signe du Capricorne,  le 5 janvier 1974, que Dieu m'envoya sur Terre. "Pourquoi?" me direz-vous. J'en sais rien et pour tout vous dire, je m'en fous un peu...
<BR>
J'ai donc commenc&eacute; ma vie pr&egrave;s de Rouen, mes parents commenc&egrave;rent d&eacutej&agrave; &agrave; se plaindre de moi car il parait que je pleurais souvent (c'est faux bien entendu). Peu de temps apr&egrave;s, je me retrouvais dans le Gard, &agrave; La Capelle! Village bien connu pour son magnifique &eacute;tang.
<BR>
<BR>
<BR>
<img src="image/maison.jpg">
<BR>
<center> Home sweet home... </center>
<BR>
<BR>
C'est justement &agrave; La Capelle, au mois de septembre 1981, que commence mon ascension. Alors que Mitterrand est pr&eacute;sident, qu'ET d&eacute;barque sur Terre, que le TGV fait fureur, MOI, je rentre en CE1! Lanc&eacute; sur ces bases solides j'obtiens le BEPC en 1989!!! Wouahh...
En 5eme je fais la connaissance de David Mourier, passion&eacute; comme moi par l'entomologie, de Vander, un nordiste qui joue aux &eacute;checs plus vite que son ombre, et de Brice (maintenant c'est sergent Brice...). 
Les ann&eacute;es passent, c'est en 4&egrave;me que je prend conscience de ma destin&eacute;e. D&egrave;s lors, rien ne peut plus m'arreter, mon choix est fait: J'irai a TELECOM PARIS ! Suivant le plan que j'avais minutieusement concoct&eacute;, je d&eacute;croche le BAC 4 ans plus tard. J'&eacute;tais alors &eacute;l&egrave;ve au Lyc&eacute;e Charles Gide &agrave Uz&egrave;s, que vous pouvez d'ailleurs toujours visiter de nuit, c'est simple il suffit de faire le mur...
<BR>
J'entre alors en Maths Sup. au Lyc&eacute;e Joffre &agrave; Montpellier. Commence alors un nouvel &eacute;pisode de ma vie intitul&eacute; S&eacute;bastien au pays des matrices, Formes diff&eacute;rentielles, Cyclotrons, R&eacute;action pr&eacute;pond&eacute;rantes, Points d'inflexion, Psions, Lasers, M&eacute;canismes &eacute;l&eacute;mentaires, et Ampli-Op. Integrales multiples et espaces pr&eacute;hilbertiens tenteront vainement de m'&eacuteloigner du chemin trac&eacute.... Charm&eacute; par la douceur de l'H&eacute;rault je d&eacute;cide de rester un peu. Hummm, bon d'accord, il faut bien le reconnaitre, j'ai redoubl&eacute; ma sp&eacute... Le chemin est long parfois... Mais fallait-il se d&eacute;courager pour autant?
<BR> 
Non bien sur! Je n'ai d'ailleurs pas h&eacute;sit&eacute; &agrave; rester un an de plus au Lyc&eacute;e. En fait, je garde un bon souvenir de cette ann&eacute;e. J'y ai fait la connaissance des Bizuths Bruno et Yagouine, de quelques exil&eacute;s des DOM-TOM et je me suis li&eacute; d'amiti&eacute; avec Faro, une superbe brune du Charlie's.... Enfin, &agrave; l'aide de mon s&eacuterieux internationalement r&eacute;put&eacute;,  je r&eacute;ussis le Concours Commun Mines/Ponts.
<BR>
La suite...C'est pour une autre fois...mais je peux d'avance vous dire qu'aventure, action, amour, sexe et &eacute;motion, seront au rendez-vous...
<BR>
<BR> 
<a href="index.html"> Retour </a>&agrave; la page principale.