<HTML><HEAD>
<TITLE>Att leva i Sverige
</TITLE>
</HEAD>
<BODY>
<H1>Att leva i Sverige</H1>
0202-sve [<A HREF="0202-sve.rtf">RTF</A>] – [<A HREF="../deu/0202-deu.html">auf deutsch</A>] [<A HREF="../eng/0202-eng.html">in English</A>] [<A HREF="../esp/0202-esp.html">en espa&ntilde;ol</A>] [p&aring; svenska] (02.12.95) 
<P><HR></P>
<P>Naturligtvis utspelas ditt liv inte bara p&aring; universitetet. Och med s&auml;kerhet &aring;terspeglas levnadsvanorna hos alla dina landsm&auml;n i en del av dina personliga vanor. Och s&aring;tillvida &auml;r de enligt v&aring;r &aring;sikt ocks&aring; intressanta f&ouml;r de svenska kursdeltagarna: genom att de f&aring;r veta n&aring;got om dig och dina v&auml;nner s&aring; f&aring;r de samtidigt och direkt veta n&aring;got om ditt land, som de ju knappt k&auml;nner till.</P>
<H2>Uppgift</H2>
<P>Och nu handlar det om f&ouml;ljande: att l&auml;ra k&auml;nna varandra b&auml;ttre f&ouml;r att vidga sin horisont, f&ouml;r att kunna f&ouml;rst&aring; och tolerera varandra b&auml;ttre och — varf&ouml;r inte ocks&aring; s&auml;ga det s&aring; h&auml;r — f&ouml;r att l&auml;ra sig att uppskatta varandra mera.</P>
<P>Bara med detta som m&aring;l kommer vi h&auml;r att st&auml;lla fr&aring;gor som du ska ge din partner svar p&aring;. Och n&auml;r du svarar p&aring; dem ska du inte bara t&auml;nka p&aring; dig sj&auml;lv utan ocks&aring; p&aring; "normen", dvs. det som de flesta av dina v&auml;nner normalt brukar g&ouml;ra.</P>

<H3><strong>Hemma</strong>	(modell)</H3>
<UL>
<LI>N&auml;r stiger du eller ni upp p&aring; morgnarna? (p&aring; vardagarna, s&ouml;ndagarna)</LI>
<LI>Hur &auml;ter ni frukost? (N&auml;r? Var? Med vem? Vad &auml;ter ni vanligtvis? Vem g&ouml;r i ordning frukosten? Vem diskar? ...)</LI>
<LI>Lunch och middag (N&auml;r? Var? Med vem? Vad &auml;ter ni vanligtvis? Vem lagar maten? Vem diskar? ...)</LI>
<LI>Att handla (Vem g&aring;r och handlar av er? K&auml;nner du till priserna? ...)</LI>
<LI>Att st&auml;da, tv&auml;tta, stryka (Vem g&ouml;r det? Hur ofta? ...)</LI>
<LI>Kl&auml;der (Vad styr dina kl&auml;dink&ouml;p: mode, bekv&auml;mlighet...)?  Vem betalar? Vad l&auml;gger man ut i m&aring;naden f&ouml;r kl&auml;der n&auml;r man &auml;r i den &aring;lder? Vad menas med "gamla" kl&auml;der?</LI>
<LI>Familjens gemensamma aktiviteter (m&aring;ltider, TV, fester ...)</LI>
</UL>
<P></P>
<P></P>
<H3>Andra omr&aring;den</H3>
<UL>
<LI><strong>Att g&aring; ut</strong> (p&aring; kv&auml;llarna, under veckosluten; n&auml;r? till n&auml;r? med vem? vart? ...)</LI>
<LI><strong>Idrott</strong> (m&ouml;jligheter, hur ofta, f&ouml;reningar)</LI>
<LI><strong>Ungdomsgrupper och politiska f&ouml;reningar</strong> (arbete i kyrkof&ouml;rsamlingen, politiska partier ...)</LI>
<LI><strong>Hobbies</strong> (l&auml;sa, sjunga, musicera, handarbeta/sl&ouml;jda, dansa ...)</LI>
<LI><strong>Jobba</strong> (f&ouml;r att tj&auml;na pengar, f&ouml;r skojs skull hos v&auml;nner, st&ouml;dlektioner ...)</LI>
</UL>

<P></P>
<HR>
<em>Swedish version 1994 by Bengt Jonsson et al., Mitth&ouml;gskolan (S) – Original version in German and Spanish 1984 by Tandem Bochum-Oviedo &copy; 1984-1995 Seminar f&uuml;r Sprachlehrforschung, Ruhr-Universit&auml;t Bochum</em>
<P></P>
<P></P>
<P></P>
<P></P>
<P>
</P>
</BODY></HTML>
