<html>
<head>
<title>TP X, threads et sockets</title>
<base href="http://www.enst.fr/~domas/ihmdir/TP_IHM.html">
</head>

<body bgcolor=white>

<img src="/gif/grandvertjaune.gif">

<center>
<h1>TP X-Window, threads et sockets</h1>
<p>
<b>
Module SOI<br>
</b>
<p>
<b><i>Bertrand Dupouy, Eric Lecolinet</i></b>
</center>

<img src="/gif/grandvertjaune.gif">
<p>
<center><b>PRESENTATION</center></b>
<p>
Ces Travaux Pratiques traitent d'une part de la r&eacute;activit&eacute; 
des interfaces graphiques et d'autre part de la communication de ces 
interfaces avec le "monde ext&eacute;rieur". Ces deux probl&egrave;mes qui sont
&eacute;troitement li&eacute;s sont abord&eacute;s de mani&egrave;re progressive dans les exemples 
et exercices suivants.

<p>
<ul>
<li><a href="#note">Note pr&eacute;liminaire</a>

<li><a href="#CA">Partie A: Interfaces et reactivite</a>
<ul>
<li>Exercice a1
<li>Exercice a2
<li>Exercice a3
<li>Exercice a4
<li>Exercice a5
</ul>

<li><a href="#CB">Partie B: Interfaces et communication</a>
<ul>
<li><a href="#RTFToC6">Exercice b1 : Boucle d'&eacutev&eacutenement et sockets </a>
<li><a href="#RTFToC7">Exercice b2 : Communications simultan&eacutees : ajout de threads </a>
</ul>

</ul>
</h3>
<p>
<img src="/gif/grandvertjaune.gif">
<p>

<a name="note"></a>
<h3>Note pr&eacute;liminaire</h3>


On enverra le(s) fichier(s) source(s) traitant l'exercice et le <tt>Makefile</tt>
permettant leur bonne utilisation &agrave;:<br>
<center>
elc@sig<br>
ou<br>
dupouy@inf<br>
</center>

<br>
Le texte du message d'envoi doit contenir la cha&icirc;ne <tt>TPSOI3</tt>

<img src="/gif/grandvertjaune.gif">

<h2><a name="CA">A. Interfaces et Reactivite</a></h2>

<h3><a name="CA1">A1. Rafraichissement</a></h3>

Le programme "gc1" (compos&eacute; des fichiers gc.c et disp1.c; voir le
<a href="Makefile" target=_blank> <tt>Makefile</tt></a>
montre un exemple d'interface qui lance un "gros calcul".
Le probl&egrave;me pos&eacute; ici concerne le rafraichisement (i.e.
la mise a jour de la pr&eacute;sentation graphique) 
et la r&eacute;activit&eacute; (le fait que les &eacute;v&eacute;nements soient imm&eacute;diatement pris
en compte) de l'interface. Compiler, ex&eacute;cuter et regarder le code de gc1.
Le bouton "GO" lance le calcul et le bouton "Exit" permet de sortir.
Tester le rafraichissement lorsque le calcul est lanc&eacute; (typiquement en 
faisant passer une autre fen&ecirc;tre par dessus l'interface). Tester la
r&eacute;activit&eacute; en appuyant sur "Exit". Que se passe-t'il ? Pourquoi ?


<p>
Cliquez  pour consulter
<a href="gc.c" target=_blank> <tt>gc.c</tt></a>,
<a href="disp1.c" target=_blank><tt>disp1.c</tt></a>
et
<a href="disp.h" target=_blank><tt>disp.h</tt></a>
<p>

Remarque:
<br> le code de cette interface comporte une bizarrerie. Laquelle
et pourquoi ? (indication: que se passe-t'il quand essaie de fermer
l'application non pas avec "Exit" mais avec le bouton "Close" du menu
du Window Manager).

<p>
<h3><a name="CA2">A2. Rafraichissement (bis)</a></h3>
<p>
Le programme "gc2" (compos&eacute; des fichiers gc.c et disp2.c) comporte
une l&eacute;g&egrave;re am&eacute;lioration par rapport &agrave; la version pr&eacute;c&eacute;dente. Pour
s'en convaincre, tester de nouveau le rafraichissement de l'interface
et regarder plus particuli&egrave;rement le code de la fonction "AfficheMessage".
<br>
Conclusions ?
<p>
Cliquez  pour consulter
<a href="gc.c" target=_blank> <tt>gc.c</tt></a> ou
<a href="disp2.c" target=_blank> <tt>disp2.c</tt></a>
<p>

<p>
<h3><a name="CA3">A3. Retours visuels</a></h3>
<p>
Le programme "gc3" (compos&eacute; des fichiers gc.c et disp3.c) montre
comment programmer un "retour visuel" appropri&eacute; destin&eacute; &agrave; indiquer &agrave;
l'utilisateur que l'interface est bloqu&eacute;e car en train d'effectuer un
calcul de longue dur&eacute;e. De nombreuses solutions peuvent &ecirc;tre envisag&eacute;es
(par exemple un voyant qui passe du vert au rouge, un curseur qui progresse
en fonction de l'&eacute;tat des calculs, des boutons qui changent d'aspect
ou de sensitivit&eacute; ...). Dans l'exemple propos&eacute;, la fonction BusyCursor
permet de changer l'apparence du pointeur et d'afficher une montre 
&agrave; la place de la fl&egrave;che usuelle.

<p>
Cliquez  pour consulter
<a href="gc.c" target=_blank> <tt>gc.c</tt></a> ou
<a href="disp3.c" target=_blank> tt>disp3.c</tt></a>
<p>


<p>
<h3><a name="CA4">A4. Reactivite</a></h3>
<p>
Nous allons maintenant essayer de r&eacute;soudre le probl&egrave;me de la r&eacute;activit&eacute;
de l'interface. Pour se faire, on rajoute un bouton "Stop" qui est cens&eacute;
permettre d'interrompre le calcul une fois lanc&eacute;. Ce type de probl&egrave;me
peut &eacute;ventuellement &ecirc;tre r&eacute;gl&eacute; en utilisant des threads (et c'est ce que 
nous verrons dans la deuxi&egrave;me partie), mais nous allons essayer ici de
le r&eacute;soudre avec une solution "purement X". L'id&eacute;e est de faire en sorte
que la fonction de calcul teste &agrave; intervalle r&eacute;gulier (par exemple chaque
fois qu'elle affiche un message) si l'on a appuy&eacute; sur le bouton stop.
<p>
Il vous faut donc &agrave; partir du code de l'exercice pr&eacute;c&eacute;dent :
<ul>
<li>
rajouter un bouton "Stop" &agrave; l'interface qui ait une action appropri&eacute;e
<li>
cr&eacute;er une fonction "StopTest" qui soit appel&eacute;e &agrave; intervalle r&eacute;gulier dans
"gros_calcul" et qui teste si l'on a pr&eacute;c&eacute;demment cliqu&eacute; sur "Stop"
</ul>
Compl&eacutetez
<a href="gc4.c" target=_blank> <tt>gc4.c</tt></a> et
<a href="disp4.file" target=_blank> <tt>disp4.file</tt></a>
<p>
<b>Indications :</b> 
<br>
Il sera n&eacute;cessaire de simuler un retour &agrave; la boucle de gestion 
des &eacute;v&eacute;nements (la "MainLoop") pour traiter les &eacute;v&eacute;nements &eacute;ventuellement
en attente, et en particulier le clic souris sur le bouton "Stop".
Pour ce faire, regarder le man de la fonction XtAppMainLoop et s'inspirer
du code de cette fonction (donn&eacute; ci-apr&egrave;s) :
<pre><tt>
    void XtAppMainLoop(XtAppContext app_context)
    {
      XEvent event;
      for ( ; ; ) {
        XtAppNextEvent(app_context, &event);
        XtDispatchEvent(&event);
      }
    }

</tt></pre>
<p>
<h3><a name="CA5">A5. Synthese</a></h3>
<p>
Cet exemple constitue une synth&egrave;se des pr&eacute;c&eacute;dents et montre &agrave; la fois
comment g&eacute;rer de mani&egrave;re ad&eacute;quate les rafraichissements, la r&eacute;activit&eacute;
et la mise en &eacute;vidence de retours visuels appropri&eacute;s. 

<p>
Regardez
<a href="gc4.c" target=_blank> <tt>gc4.c</tt></a> et
<a href="disp5.c" target=_blank> <tt>disp5.c</tt></a>
<p>


<p>
<p>

<img src="/gif/grandvertjaune.gif">

<h2><a name="CB">B. Interfaces et Communication</a></h2>

<h3>
<a name="RTFToC6">B1. Boucle d'&eacutev&eacutenenent et sockets</a>
</h3>

On vous demande d'&eacutecrire un serveur qui utilise la boucle d'&eacutev&eacutenement X pour traiter les demandes venant des clients.

<br>
Pour ce faire il faudra utiliser :
<tt><center>
                    XtAppAddInput
</tt></center>
(voir le man !) pour que la boucle d'&eacutev&eacutenement 
prenne en compte les donn&eacutees externes arrivant depuis
le socket.
<p>L'&eacutecriture de ce serveur se fera
en compl&eacutetant (et 
&eacute;ventuellement en am&eacute;liorant !) le code 
dont on donne le squelette dans le fichier <tt>servx.file</tt>.
<br>
<p>
<a href="servx.file" target=_blank>
Cliquez ici pour consulter <tt>servx.file</tt></a>
<p>
La partie interface graphique se trouve dans le fichier  <tt>dispx.c</tt>.
<p>
<a href="dispx.c" target=_blank>
Cliquez ici pour consulter <tt>dispx.c</tt></a>
<p>

Le code des clients est dans <tt>client.c</tt>.
<br>
<p>
<a href="client.c" target=_blank>
Cliquez ici pour consulter <tt>client.c</tt></a>

<p><b>
Le fichier <a href="Makefile" target=_blank> <tt>Makefile</tt></a>
est dans: <tt>~domas/ihmdir</tt>.
</b><p>


 
<img src="/gif/grandvertjaune.gif">

<h3>
<a name="RTFToC7">B2. Ajout de threads </a>
</h3>

<p>
On vous demande maintenant d'enrichir le code pr&eacute;c&eacute;dent
pour faire du serveur un serveur parall&egravele.
Il faut cr&eacuteer un thread pour g&eacuterer chaque communication.
On utilisera le fichier <tt>servth.file</tt> comme base de travail en 
prenant l'interface graphique precedente (<tt>dispx.c</tt>).

<p>
<a href="servth.file" target=_blank>
Cliquez ici pour consulter <tt>servth.file</tt></a>


<p>
Attention :
<br>
Ajouter la biblioth&egraveque <tt>thread</tt> lors de l'&eacutedition de liens !

<h3>
<a name="RTFToC8">B3. Probl&egraveme pos&eacute par l'utilisation des threads </a>
</h3>
<p>
Le programme precedent peut ne pas fonctionner correctement dans certains cas.
Ceci est du au fait que la fonction d'affichage graphique AfficheMessage est
appelee depuis un autre thread que celui qui gere la MainLoop. Il peut donc
y avoir des problemes de synchronisation lors de la communication avec le
serveur graphique. Une solution generale a ce probleme consiste a faire en 
sorte que les fonctions qui font appel au toolkit graphique soient toujours
appelees depuis le thread qui gere la MainLoop.
<p>
Le fichier dispthr_to.c montre un exemple de cette technique (a noter que le
fichier servth.c reste inchange). Dans cet exemple, au lieu d'afficher
directement les messages donnes en argument, la fonction AfficheMessage() 
enregistre les actions a effectuer sous forme de WorkProcs. 
Les WorkProcs sont des fonctions de callback
un peu particulieres qui sont appelees quand la MainLoop n'a "rien a faire".
<p>
L'idee proposee ici consiste donc simplement
a deleguer les actions graphiques a effectuer a la MainLoop:
<ul>
<li>
a ce que les threads enregistrent les actions graphiques a effectuer
via des WorkProc 
<li>
la MainLoop executera ces actions successivement et celles-ci seront
donc lances par le "bon" thread.
</ul>
<p>
En pratique, cette technique comporte encore une difficulte supplementaire.
Celle-ci vient du fait que la MainLoop n'est pas automatiquement avertie 
du fait qu'un autre thread a "depose" une nouvelle fonction de WorkProc.
Pour ce faire, on propose deux techniques:
<ul>
<li> dans dispth_to.c, une fonction de Time Out est reactivee a intervalle
regulier afin de remettre a jour l'affichage. L'inconvenient de cette technique
est qu'elle entraine un delai entre la demande d'affichage (par AfficheMessage)
et la remise a jour effective (effectue a intervalle constant
par la fonction de TimeOut).
<p>
<li> la seconde technique consiste a envoyer a la MainLoop
un message de remise a jour. Celle-ci traitera
donc immediatement les demandes d'affichages deposees par le thread
(via les WorkProcs) au lieu d'attendre un intervalle de temps defini de
maniere arbitraire, comme dans le cas precedent. Plusieurs methodes
peuvent etre employees pour implementer ceci. On pourrait par exemple
rajouter un nouveau canal de communication entre le thread appelant 
et la MainLoop en utilisant un pipe et la fonction XtAppAdInput.
Le fichier dispth_se.c montre une autre facon de faire utilisant
les possibilites de communication inter-clients entre applications X Window.
Dans cet exemple, la fonction AfficheMessage (activee par le thread secondaire)
envoie un XEvent de reaffichage a la MainLoop. Celle-ci executera alors
par la meme occasion la liste de WorkProcs mis en attente.
</ul>

<p>
<img src="/gif/grandvertjaune.gif">

</body></html>


