<html>
<head>
<title>Robert Leicht &uuml;ber Helmut Kohl: Ein Kanzler, der kein Ende findet </title>
</head>
<body>
<ul>
<BODY BACKGROUND="gifs/zeitbg.gif">
<center><img src="gifs/DieZeit.gif"></center>
<h2>Robert Leicht &uuml;ber Helmut Kohl: Ein Kanzler, der kein Ende findet </h2>

<hr noshade>

<h3>
von Robert Leicht </h3>

<p>

<br clear=all>
<P>
<br>


<h3>Ginge es nicht um das Ziel Europa: Helmut Kohl m&uuml;&szlig;te  seinen Abschied nehmen </h3>
<p>

Selten zuvor lagen Glanz und Elend, Stabilit&auml;t und Chaos so eng beieinander. Eigentlich, so sieht es der historische Kalender f&uuml;r die n&auml;chste Woche vor, h&auml;tte Helmut Kohl in Jubil&auml;umslaune seiner pers&ouml;nlichen Bestleistung entgegensehen k&ouml;nnen: l&auml;nger im Kanzleramt als Konrad Adenauer - und folglich der dienst&auml;lteste demokratische Regierungschef deutscher Geschichte. Doch weder im Land noch in der eigenen Partei will Jubelstimmung aufkommen. "Der ewige Kanzler" - so weihr&auml;ucherte nur der <A HREF="http://www.spiegel.de/archiv/">Spiegel</A> .<p>

Das Drunter und Dr&uuml;ber in der Bonner Koalition, in dem ein Milliardenloch nach dem anderen klafft, ein Steuervorschlag den n&auml;chsten jagt, beweist nur das eine: Die Regierung Kohl ist mit ihrem finanzpolitischen Latein am Ende. Mehr Schulden - das geht nicht, und das keineswegs nur wegen Maastricht. H&ouml;here Steuern - das geht nicht, und das nicht nur wegen der Liberalen. Tiefere Einschnitte in Subventionen und soziale Leistungen - das geht nicht, wenn man sich nicht massiv mit den Interessengruppen anlegen will. Was Wunder, da&szlig; sich da mancher der Worte Helmut Schmidts erinnert, als er im Fr&uuml;hjahr 1982 kurz vor dem Sturz seinen Gefolgsleuten das "Gardez!" ansagte: Mehr Schulden - das geht mit mir nicht. Sch&auml;rfere K&uuml;rzungen - das geht mit euch nicht.<p>

Damals gab es freilich eine machtpolitische Alternative. Die FDP brauchte nur mit H&auml;ngen und W&uuml;rgen die Seiten zu wechseln. Heute m&uuml;&szlig;ten sich die Liberalen schon selbstm&ouml;rderisch in den Abgrund einer Koalition mit den Sozialdemokraten, den Gr&uuml;nen <b>und</b> der PDS st&uuml;rzen, wollten sie den Kanzler ins Wanken bringen, der eben von seiner Partei in Hannover mit Riesenzahlen als Vorsitzender best&auml;tigt wurde. Oder die Union m&uuml;&szlig;te dessenungeachtet all ihre archaischen &Auml;ngste &uuml;berwinden und Vatermord am Enkel Adenauers begehen, damit der Weg f&uuml;r eine gro&szlig;e Koalition frei wird. Bis zu den n&auml;chsten Wahlen scheint die Republik auf Gedeih und Verderb an ihrem Kanzler zu h&auml;ngen - und er an ihr. Nichts geht mehr aber auch nichts anderes.<p>

Wie lange kann ein Land eine solche verr&uuml;ckte Situation aushalten? Wann verliert einer der Beteiligten die Nerven, wann brechen alle rationalen Kalk&uuml;le in sich zusammen? W&auml;re es nicht besser, der Kanzler, der sich unersetzlich gemacht hat, ersetzte sich am Ende doch noch selber?<p>

W&auml;re da nicht das gro&szlig;e Projekt Europa, der Abschied w&auml;re dringend geboten. Wer immer in welcher Konstellation auch immer danach k&auml;me: Sch&auml;uble, R&uuml;he oder Stoiber, Schr&ouml;der oder Lafontaine, kleine oder gro&szlig;e Koalition. Schlimmer kann es in der Innenpolitik kaum noch kommen. Allein die vorerst noch alles &uuml;berw&ouml;lbende Frage "Was wird aus dem allenfalls oberfl&auml;chlich vereinten Deutschland in einem noch nicht hinl&auml;nglich vereinten und erweiterten Europa?" macht einen Kanzlerwechsel vor 1998 zu einem unkalkulierbaren Risiko. Wenn &uuml;berhaupt, so k&ouml;nnte wohl nur Helmut Kohl den Willen und die Autorit&auml;t aufbieten, die Europ&auml;ische W&auml;hrungsunion durchzusetzen - ein politisches Projekt von existentieller und strategischer Bedeutung.<p>

Sonst aber: je fr&uuml;her, desto besser. Denn Helmut Kohl wird immer &ouml;fter von sich selber eingeholt. Seine St&auml;rken sind l&auml;ngst zu seiner Schw&auml;che geworden. Die Mittel, mit denen es ihm gelang, sich die Macht zu erhalten, sind untauglich, die Macht noch sinnvoll gestaltend zu gebrauchen. Die Zust&auml;nde, die zu &auml;ndern er f&uuml;r notwendig h&auml;lt - er hat sie nach vierzehn langen Jahren selber zu verantworten.<p>

Das gilt vor allem f&uuml;r das Projekt, das ihm im Jahr 1989 am Tiefpunkt seiner damaligen Entwicklung - die Kanzlerschaft rettete, das er aber in einer Art und Weise anpackte, die seine Amtszeit seither mit kaum noch abzutragenden Hypotheken belastete: die Wiedervereinigung Deutschlands.<p>

Gewi&szlig;, Helmut Kohl ist und bleibt der Kanzler der Einheit - der Kanzler der Einigung ist er nicht geworden. Er hat, was sein Verdienst bleibt (ihm aber vor allem von &auml;u&szlig;eren Faktoren angeboten wurde), den - wie es im gewagten Bismarckschen Bilde hei&szlig;t Mantel Gottes am Zipfel gepackt, als andere das Kleidungsst&uuml;ck schon an der historischen Garderobe h&auml;ngenlassen wollten. Doch danach hat er wider allen besseren Rat, auch aus den eigenen Reihen, all die Fehler begangen, unter denen die innere Politik bis heute leidet.<p>

Die finanzpolitische Misere, die heute zu den aberwitzigsten Operationen am Abgrund des Absurden f&uuml;hrt, geht zur&uuml;ck auf seine Entscheidung, die Einigung auf Pump zu betreiben und ohne ordnungspolitisch klare Perspektive. "Zu viele haben zu lange auf Kosten anderer gelebt: der Staat auf Kosten der B&uuml;rger, B&uuml;rger auf Kosten von Mitb&uuml;rgern und wir alle auf Kosten nachwachsender Generationen." Dies ist kein b&ouml;ses Urteil der Opposition, sondern Originalton Helmut Kohl aus seiner ersten Regierungserkl&auml;rung 1982.<p>

Helmut Kohl wurde und blieb Kanzler, weil er, fern jeder Ideologie, aber auch bar eines entschiedenen Konzepts, dem Land beides ersparte - die Polarisierung <b>und</b> die Entscheidung, f&uuml;r die Kosten der Politik p&uuml;nktlich aufzukommen. Er blieb so lange Kanzler, weil er s&auml;mtliche Rivalen aus dem Feld schlug - aber auch alle Partner, die ihm in der Sache eine Herausforderung h&auml;tten bieten k&ouml;nnen. Er holte sich in heilloser Situation den CSU-Chef als Retter seiner Macht ins Kabinett - und zugleich jenen Finanzminister, dem wie keinem anderen in der Nachkriegszeit die Dinge &uuml;ber den Kopf wuchsen. Ein Kanzler des Status quo und des Juste-milieu in Zeiten, in denen beides zerbricht.<p>

Kohl m&uuml;&szlig;te schon ein M&uuml;nchhausen sein, wollte er sich am eigenen Schopf aus dem Sumpf ziehen. G&auml;be es jemanden in seinem eigenen Lager, der es wagen d&uuml;rfte und verm&ouml;chte, das grassierende Unbehagen zu b&uuml;ndeln; g&auml;be es in der Opposition jemanden, der die unzufriedenen W&auml;hler um sich zu versammeln verst&uuml;nde - Kohls Regiment br&auml;che bald zusammen. Angesichts des gegenw&auml;rtigen demoskopischen Gleichstandes zwischen Schwarz-Gelb und Rot-Gr&uuml;n ist es paradoxerweise nur die postkommunistische PDS, welche die parlamentarische Mechanik klemmen macht. Und ausgerechnet die verfehlte Politik der inneren Einigung stabilisiert diesen Faktor.<p>

"Sicut erat in principio" - wie es war im Anfang: Gegen Ende seiner Amtszeit l&auml;&szlig;t Helmut Kohl vieles zur&uuml;ck, wie er es vorgefunden hat: die Staatsfinanzen &uuml;berfordert, die Wirtschaft in der Stagnation, die Gesellschaft ratlos. Und schlie&szlig;lich seine Partei: Kohl war es gewesen, der aus der CDU, dem ewigen Kanzlerwahlverein, eine moderne Volkspartei machte, mit wachsenden Mitgliederzahlen, mit profilierten Generalsekret&auml;ren wie Kurt Biedenkopf und Heiner Gei&szlig;ler. Jetzt ist die Partei l&auml;ngst wieder zur&uuml;ckgeschnitten und zugeschnitten allein auf den Kanzler. Sein legend&auml;rer Taschenkalender, mit dem er seine Gesch&auml;fte ordnet, ist wieder die einzige Agenda.<p>

Zeit, das B&uuml;chlein zuzuklappen. W&auml;re da nicht Europa, w&auml;re da nicht die gro&szlig;e au&szlig;enpolitische Unsicherheit nach Kohl. Keinem anderen Deutschen traut man vor allem im Ausland zu, das europ&auml;ische Einigungswerk &uuml;ber die schicksalhafte H&uuml;rde zu bringen. Die Frage allerdings ist, ob dieses Jahrhundertvorhaben nicht jeden &uuml;berfordern w&uuml;rde. Und ob nicht gerade die Fehler, die im inneren Einigungsproze&szlig; begangen worden sind, am Ende die Bundesrepublik unt&uuml;chtig machen, das &auml;u&szlig;ere Werk zu vollenden.<p>

(C) DIE ZEIT Nr. 44 vom 25. Oktober 1996<p>


<hr noshade>
<hr>
<font size=-2>
<center>(c) beim Autor/DIE ZEIT. All rights reserved</center>
</font>
</ul>
</body>
</html>
