net<HEAD>
<TITLE>Th&egrave;mes de recherche de MILC</TITLE>
</HEAD>

<BODY>
<body BGCOLOR="#d9d9d9" LINK="#0000ff" VLINK="#000099">
<IMG ALT="" ALIGN=MIDDLE SRC="/~milc/bandes/b0.gif" width=100% alt="--------">
<H1>
Mod&egrave;les Informatiques du Langage et de la Cognition - MILC
</H1>
<i>Groupe Intelligence Artificielle<br>
D&eacute;partement Informatique<br><br></i>

<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/fl2.e.gif" border=0>
<A HREF="/~milc/rech/rech.us.html">English</A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/pers2.gif" border=0>
<A HREF="/~milc/bio.html">L'&eacute;quipe</A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/publi2.gif" border=0>
<A HREF="/~milc/publi/publi.html">Publications</A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/home2.gif" border=0>
<A HREF="/~milc/index.html">Home</A>
<br>
<br>
<IMG ALT="" ALIGN=MIDDLE SRC="/~milc/bandes/b2.gif" border=0><br>

<h2><IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/rech.gif" border=0>
Les travaux de recherche</h2>
Les th&egrave;mes de recherches du groupe <A HREF="/~milc/index.html">MILC</A>
sont :</H3>
<p>
<dl>
<dd><IMG ALIGN=BOTTOM ALT="*" SRC="/~milc/icones/c1.gif" border=0>
<A HREF="#ln">Langage naturel</A>
<dd><IMG ALIGN=BOTTOM ALT="*" SRC="/~milc/icones/c2.gif" border=0>
<A HREF="#mn">Mod&egrave;les connexionnistes</A>
<dd><IMG ALIGN=BOTTOM ALT="*" SRC="/~milc/icones/c8.gif" border=0>
<A HREF="#sc">Science cognitive et Enseignement Assist&eacute; par Ordinateur</A>
<dd><IMG ALIGN=BOTTOM ALT="*" SRC="/~milc/icones/c3.gif" border=0>
<A HREF="#rv">R&eacute;alit&eacute; virtuelle, t&eacute;l&eacute;op&eacute;ration, mod&egrave;le cognitif
</dl>
Le groupe <A HREF="/~milc/index.html">MILC</A> (Mod&egrave;les Informatiques du Langage et de la
Cognition), au sein du D&eacute;partement Informatique de l'<A HREF="http://www.enst.fr/welcome.html">ENST</A>,
concentre ses efforts de recherche sur certains aspects
du langage et de la cognition. Les mod&egrave;les que nous d&eacute;veloppons
font appel aussi bien au connexionnisme qu'aux techniques
symboliques.<br><br>
<br>
<IMG ALT="" width=100% SRC="/~milc/bandes/b1.gif" border=0><br>
<h2><IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/rech2.gif" border=0>
<A NAME="ln">Langage naturel et repr&eacute;sentation des connaissances</A></h2>
<A HREF="/~jld/bio/jld.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/jld.ico.gif" border=0></A>
<A HREF="/~milc/ar.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/ar.ico.gif" border=0></A>
<A HREF="/~milc/fy.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/fy.ico.gif" border=0></A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/publi2.gif" border=0>
<A HREF="/~milc/publi/publi.html#ln">Publications</A>
<br>
<br>

Une grande partie de nos efforts de recherche est consacr&eacute;e &agrave;
l'analyse et &agrave; la reproduction de la performance linguistique.
Nous sommes bien entendu conscients de l'immensit&eacute; de la t&acirc;che,
aussi concentrons-nous nos efforts sur des angles d'attaque
bien pr&eacute;cis.<br><br>

Au niveau de la phonologie, nous cherchons a d&eacute;couvrir un
ensemble limit&eacute; de r&egrave;gles qui permettent d'acc&eacute;der 
&agrave; la prononciation d'un mot (par ex. un nom propre) &agrave; partir 
de sa forme &eacute;crite.<br><br>

Au niveau syntaxique et s&eacute;mantique, nous
cherchons &agrave; rep&eacute;rer des invariances dans un corpus vaste, en
travaillant sur l'ensemble des mots de la langue. Par exemple,
gouvernement et pr&eacute;sident (en tant que noms communs) pourront
se r&eacute;v&eacute;ler proches dans un corpus issus des &eacute;ditoriaux 
d'un grand quotidien, parce qu'ils apparaissent dans les m&ecirc;mes
constructions syntaxiques. On en d&eacute;duit des relations de
substituabilit&eacute; en contexte, qui sont tr&egrave;s utiles lorsqu'on
veut faire par exemple de la correction orthographique ou
amplifier une requ&ecirc;te de recherche bibliographique.<br><br>

Au niveau de l'utilisation du langage en situation (le niveau dit
pragmatique), nous cherchons, par l'observation et la
simulation des conversations spontan&eacute;es, a d&eacute;gager les
contraintes portant sur le r&ocirc;le logique des arguments. Cette
recherche nous ouvre la voie vers des syst&egrave;mes d'aide capables
d'argumenter, vers des module d'explication efficaces pour les
syst&egrave;mes &agrave; base de connaissances, vers la
g&eacute;n&eacute;eration de textes structur&eacute;es, etc.
<br><br>
<br>
<IMG ALT="" width=100% SRC="/~milc/bandes/b1.gif" border=0><br>
<h2>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/rech2.gif" border=0>
<A NAME="mn">
Mod&egrave;les connexionnistes</A></h2>
<A HREF="/~milc/ag.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/ag.ico.gif" border=0></A>
<A HREF="/~milc/db.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/db.ico.gif" border=0></A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/publi2.gif" border=0>
<A HREF="/~milc/publi/publi.html#mn">Publications</A>
<br>
<br>
Nous nous int&eacute;ressons particuli&egrave;rement &agrave; la pr&eacute;vision de s&eacute;rie
temporelles.  Quelques tentatives de mod&eacute;lisation connexionniste de ce
probl&egrave;me ont &eacute;t&eacute; r&eacute;alis&eacute;es, mais dans ces diff&eacute;rents cas, une
architecture connexionniste classique a &eacute;t&eacute; utilis&eacute;e, et modifi&eacute;e pour
l'adapter au probl&egrave;me de pr&eacute;vision consid&eacute;r&eacute;.<p>

L'objectif de cette recherche est d'expliciter les
sp&eacute;cificit&eacute;s du probl&egrave;me de pr&eacute;vision, puis de 
concevoir une architecture connexionniste d&eacute;di&eacute;e &agrave; ce 
type de t&acirc;che. Par exemple, une sp&eacute;cificit&eacute; importante est 
le caract&egrave;re temporel des informations manipul&eacute;es. Cet aspect 
n'est actuellement pas pris en compte dans les architectures connexionnistes
classiques; il est en g&eacute;n&eacute;ral recr&eacute;&eacute;
artificiellement par une projection spatiale de la dimension temporelle  (par 
r&eacute;plication d'unit&eacute;s de l'architecture pour prendre en compte 
les instants successifs) (Chappelier et Grumbach 94). Pour int&eacute;grer le 
temps de fa&ccedil;on non artificielle, nous serons amen&eacute;s &agrave; &eacute;tudier 
une architecture pour laquelle le temps sera pr&eacute;sent dans les 
fondations de celle-ci (ex: fonction de transfert des neurones, propagation 
sur les connexions, etc).<p>
<br>
<IMG ALT="" width=100% SRC="/~milc/bandes/b2.gif" border=0><br>
<h2>
<A NAME="sc">Science cognitive, Enseignement Assist&eacute; par Ordinateur</A></h2>
<A HREF="/~jld/bio/jld.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/jld.ico.gif" border=0></A>
<A HREF="/~milc/jba.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/jba.ico.gif" border=0></A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/publi2.gif" border=0>
<A HREF="/~milc/publi/publi.html#sc">Publications</A>
<br>
<br>
De nombreuses performances, dont l'automatisation repr&eacute;sentant
pourtant un int&eacute;ret &eacute;conomique crucial, restent inaccessibles
aux ordinateurs, non parce que nous manquons de machines
puissantes ou de m&eacute;moire, mais parce qu'elles supposent une
compr&eacute;hension du fonctionnement humain que nous n'avons pas.
Nous avons d&eacute;j&agrave; &eacute;voqu&eacute; le langage, on peut citer
aussi l'enseignement.<br><br>

Les recherches en matiere d'E.A.O.
(enseignement assist&eacute; par ordinateur) buttent sur notre
ignorance de la mani&egrave;re dont les connaissances conceptuelles
sont acquises et manipul&eacute;es par les &eacute;l&egrave;ves. Une part de nos
travaux de recherche vise &agrave; r&eacute;aliser des mod&egrave;les,
connexionnistes et symboliques, d'un fonctionnement cognitif
qui permet l'&eacute;mergence de nouveaux concepts et de nouvelles
relations conceptuelles. Le concept appara&icirc;t, dans ces mod&egrave;les,
comme un invariant perceptif associ&eacute; &agrave; un symbole, ou comme un
 capteur cognitif. Ces mod&egrave;les trouvent leur application en
psychologie ou en E.A.O.<br>
<br>
<IMG ALT="" width=100% SRC="/~milc/bandes/b1.gif" border=0><br>
<h2><IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/rech2.gif" border=0>
<A NAME="ln">R&eacute;alit&eacute; virtuelle, t&eacute;l&eacute;op&eacute;ration, mod&egrave;le cognitif</A></h2>
<A HREF="/~jld/bio/ag.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/ag.ico.gif" border=0></A>
<A HREF="/~milc/dv.html">
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/personnes/dv.ico.gif" border=0></A>
<IMG ALT="" ALIGN=BOTTOM SRC="/~milc/icones/publi2.gif" border=0>
<A HREF="/~milc/publi/publi.html#rv">Publications</A>
<br>
<br>
Ce projet de recherche se situe dans le cadre des d&eacute;veloppements actuels
 relatifs aux mondes virtuels et &agrave; la robotique. Il concerne plus
 pr&eacute;cisement la communication entre un utilisateur et un monde virtuel
de type t&eacute;l&eacute;-operation. Nous proposons d'&eacute;tudier une
 possibilit&eacute; de  communication se situant au niveau
des intentions de l'utilisateur, dans le but de faciliter les
 op&eacute;rations de celui-ci. Lors d'une op&eacute;ration
d&eacute;licate &agrave; effectuer (comme la pr&eacute;hension d'un objet),
 le syst&egrave;me pourrait d&eacute;tecter l'intention de
l'utilisateur, et apr&egrave;s avoir re&ccedil;u confirmation,
 entamer une procedure automatique destin&eacute;e &agrave; effectuer la
manoeuvre d&eacute;licate &agrave; la place de l'operateur. Ce projet nous
 conduira, pour chaque fonctionnalit&eacute; du
syst&egrave;me, &agrave; d&eacute;terminer les techniques d'intelligence
 artificielle (symboliques ou connexionnistes) les
plus apropri&eacute;es, et &agrave; mettre en oeuvre des
 collaborations entre celles-ci. 
<br>
<br>
<IMG SRC="/~milc/bandes/b1.gif" width=100% alt="--------">

Derni&egrave;re remise &agrave; jour le 7 mars 1997
<ADDRESS>Page cr&eacute;&eacute;e et maintenue par <A HREF="http://www-inf.enst.fr/~bonnet/index.fr.html">Denis Bonnet</A> (<A HREF=mailto:bonnet@inf.enst.fr>bonnet@inf.enst.fr</A>)</ADDRESS>
<font size=-1>Quelques <a href="/~bonnet/stats/">statistiques</a> sur ce serveur sont disponibles sur mes pages</font>
