<html><head>
<title>Les Ing&eacute;nieurs des T&eacute;l&eacute;coms</title>
<BODY BGCOLOR = "#ffffff" >
<H1 ALIGN=CENTER><IMG SRC="Images/corps.gif" ALT="Le Corps des T&eacute;l&eacute;coms" ALIGN=LEFT>Le Corps des T&eacute;l&eacute;coms</H1>
<IMG SRC="Images/vertj.gif"><P>
<h1>
Les Ing&eacute;nieurs des T&eacute;l&eacute;coms, Architectes Vigilants de
l'Avenir</h1>
Qui croire, &agrave; force ? Les optimistes ou les pessimistes ? Ceux qui nous
promettent un nouvel &acirc;ge d'or de l'humanit&eacute; ? Ou ceux qui nous
annoncent le pire des mondes ? Aujourd'hui, la civilisation de la communication
d&eacute;crite par les visionnaires de science-fiction est devant nous, autour
de nous, peut-&ecirc;tre d&eacute;j&agrave; en nous. Demain, elle bouleversera
notre quotidien, qu'on soit inventeur ou simple utilisateur, op&eacute;rateur,
entrepreneur ou "r&eacute;gulateur"; un passeport pour une libert&eacute; quasi
totale de facilit&eacute;s et de dialogue, dont on sait d&eacute;j&agrave;
qu'il offrira en temps r&eacute;el toutes les donn&eacute;es de
l'humanit&eacute; &agrave; qui poss&eacute;dera un clavier et une ligne
t&eacute;l&eacute;phonique. Apr&egrave;s les si&egrave;cles de l'imprimerie,
commence l'&egrave;re de la connaissance globale, &agrave; l'aube du
troisi&egrave;me mill&eacute;naire.<p>
<p>
Logiciels et terminaux, satellites et images virtuelles, syst&egrave;mes
complexes de t&eacute;l&eacute;communications et r&eacute;seaux
d'&eacute;changes d'information seront les principaux &eacute;l&eacute;ments de
cette grande aventure industrielle et technologique.
D&eacute;j&agrave;, les esp&eacute;rances promises par cette
soci&eacute;t&eacute; de l'information suscitent l'int&eacute;r&ecirc;t,
parfois m&ecirc;me l'app&eacute;tit des gouvernements, des entreprises, des
collectivit&eacute;, des individus. Le secteur de l'information fournit
d&egrave;s &agrave; pr&eacute;sent une part pr&eacute;pond&eacute;rante de la
croissance nationale aux Etats-Unis et en Europe. C'est l&agrave;, au coeur
invisible du monde des biens et des &eacute;changes immat&eacute;riels que se
d&eacute;ploie le champ d'action des Ing&eacute;nieurs des
T&eacute;l&eacute;coms, architectes vigilants de l'avenir.<P>
<IMG SRC="Images/vertj.gif">
<h1>
L'Importance des Sp&eacute;cialistes</h1>
A l'&eacute;vidence, dans ce monde nouveau o&ugrave; nous serons dou&eacute;s
du don d'ubiquit&eacute;, et apparemment d&eacute;barrass&eacute;s des
inconv&eacute;nients de la gravit&eacute; terrestre, tous n'auront pas la
m&ecirc;me place. Certains sauront en appr&eacute;hender le potentiel, en
comprendre le mode d'emploi. Les autoroutes de l'information auront leurs
champions, les syst&egrave;mes complexes de communication leurs
strat&egrave;ges, les grands services "on line" leurs concepteurs, plus prompts
&agrave; anticiper, plus aptes &agrave; exploiter, &agrave; ma&icirc;triser les
mailles serr&eacute;es de cet univers insaisissable.<p>
<p>
A chaque point n&eacute;vralgique du d&eacute;veloppement de cette
soci&eacute;t&eacute; de l'information, l'assistance de ces sp&eacute;cialistes
sera donc d&eacute;terminante. C'est la chance du Corps des
T&eacute;l&eacute;coms. Bien peu de communaut&eacute;s professionnelles se
verront proposer pour le si&egrave;cle &agrave; venir de tels enjeux
techniques, &eacute;conomiques et soci&eacute;taux. Les d&eacute;fis futurs
seront ceux des Ing&eacute;nieurs des T&eacute;l&eacute;coms parce que leur
savoir-faire les y pr&eacute;dispose, parce qu'au cours des derni&egrave;res
d&eacute;cennies ils ont acquis une exp&eacute;rience in&eacute;galable dans
les t&eacute;l&eacute;communications, qu'ils ont mis au point des
syst&egrave;mes performants, particip&eacute; &agrave; l'aventure des
satellites ou invent&eacute; le Minitel.<P>
<IMG SRC="Images/vertj.gif">
<h1>
Au Service de l'Int&eacute;r&ecirc;t G&eacute;n&eacute;ral</h1>
Au plus haut niveau d'expertise, les Ing&eacute;nieurs des
T&eacute;l&eacute;communications  ne seront pas seuls. La concurrence sera rude
entre informaticiens, financiers, communicants, visionnaires et petits
g&eacute;nies du d&eacute;veloppement...; elle sera d'abord internationale,
multinationale plut&ocirc;t, souvent sans r&egrave;gle du jeu ni arbitre. Tous
les coups sont permis, pr&eacute;vient-on, &agrave; la mesure des
esp&eacute;rances. Les Ing&eacute;nieurs des T&eacute;l&eacute;coms ne seront
pas les seuls, mais ils se distingueront. Pas seulement pour leur
comp&eacute;tence &agrave; interpr&eacute;ter l'immat&eacute;riel et &agrave;
favoriser ces profits annonc&eacute;s. Pour leur signature. Pour un style,
entre technique et &eacute;thique. Un sens de la science et de la vertu
commune, une m&eacute;moire qui associent ces r&eacute;seaux, d'hier et de
demain, &agrave; leur finalit&eacute; : l'homme.<p>
<p>
Depuis des d&eacute;cennies, les Ing&eacute;nieurs du Corps se sont
plac&eacute;s, une g&eacute;n&eacute;ration apr&egrave;s l'autre, au service de
l'Etat et de la communaut&eacute; nationale. A marche forc&eacute;e, ils ont
aid&eacute; la France &agrave; se doter d'un op&eacute;rateur et d'une
industrie des t&eacute;l&eacute;communications parmi les meilleurs au monde. A
chaque instant, ils ont eu cette exigence naturelle, non proclam&eacute;e de
l'int&eacute;r&ecirc;t g&eacute;n&eacute;ral.<p>
<p>
Ces caract&eacute;ristiques constituent la responsabilit&eacute;, plus encore
la culture du Corps des T&eacute;l&eacute;coms. Comme d'autres
sp&eacute;cialistes, ils se trouveront associ&eacute;s &agrave; des 
&eacute;quipes aux
comp&eacute;tences multiples, confront&eacute;s &agrave; des alliances parfois
contradictoires. A ceux qui viseront l'int&eacute;r&ecirc;t particulier, ils
pourront rappeler, voire opposer la logique, le bien de tous, le fiable, le
raisonnable. Comme un architecte, plac&eacute; au centre d'une oeuvre, qui
appr&eacute;cie l'audace d'une arche et se pr&eacute;occupe, en m&ecirc;me
temps, de la s&ucirc;ret&eacute;, de la dur&eacute;e de vie de sa construction,
et du bien-&ecirc;tre de ses futurs occupants.<p>
<p>
Cyber-espace, r&eacute;seaux, services d'&eacute;changes d'informations et de
transaction se doteront sans doute de juristes, d'humanistes, afin que ces
syst&egrave;mes ne d&eacute;rivent pas. Mais quel juriste, quel humaniste
poss&eacute;dera la comp&eacute;tence
technique et la compr&eacute;hension d'ensemble pour garantir la ma&icirc;trise
de ce secteur complexe ? Pour &eacute;valuer les pi&egrave;ges
d'apr&egrave;s-demain, quand on t&acirc;tonnera encore sur ceux de demain ? Et
en cons&eacute;quence, assez d'exp&eacute;rience pour se pr&eacute;munir contre
la fascination qu'exerceront les champs apparemment illimit&eacute;s de ce
secteur ?<P>
<IMG SRC="Images/vertj.gif">
<h1>
Des T&acirc;ches Multiples</h1>
C'est la chance des Ing&eacute;nieurs des T&eacute;l&eacute;coms d'appartenir
&agrave; un corps jeune, et  pourtant mature, qui a contribu&eacute; de
fa&ccedil;on d&eacute;terminante aux grands bouleversements du secteur des
technologies de l'information: introduction des techniques num&eacute;riques en
commutation et transmission, ouverture commerciale du premier r&eacute;seau de
donn&eacute;es &agrave; commutation de paquets Transpac, d&eacute;veloppement
du Minitel, des t&eacute;l&eacute;communications spatiales, des cartes &agrave;
puces, des techniques support des services large bande, etc.<p>
<p>
C'est leur responsabilit&eacute; d'&ecirc;tre entreprenants, mais aussi
r&eacute;fl&eacute;chis. D&egrave;s aujourd'hui, ils font la preuve de leur
comp&eacute;tence mixte, de leur originalit&eacute; bic&eacute;phale pour des
paris d&eacute;j&agrave; inscrits &agrave; court terme. Ils sont les acteurs
interminist&eacute;riels de la modernisation des grands services publics,
surtout les plus sensibles, comme par exemple la Justice ou l'Int&eacute;rieur.
Au sein d'autres minist&egrave;res comme ceux de l'Industrie, des
T&eacute;l&eacute;communications, des Finances ou de la Sant&eacute;, ils
assistent, conseillent l'Etat et la collectivit&eacute; nationale dans
l'&eacute;laboration des nouvelles r&eacute;glementations et politiques, et
favorisent l'harmonisation du patrimoine fran&ccedil;ais avec ceux de l'Europe
communautaire.<p>
<p>
Experts en technologies de l'information, sachant aussi g&eacute;rer,
comprendre et mener des hommes, ils comptent parmi les innovateurs, les
entrepreneurs et les strat&egrave;ges de ce domaine en pleine expansion. Ils
dirigent des soci&eacute;t&eacute;s, d&eacute;veloppent des logiciels,
con&ccedil;oivent des nouveaux r&eacute;seaux et services, construisent des
alliances internationales, contribuent au d&eacute;veloppement de France
T&eacute;l&eacute;com, op&eacute;rateur parmi les plus puissants du monde.<p>
<p>
Bien des entreprises d'autres secteurs d'activit&eacute; font appel aux
services des Ing&eacute;nieurs des T&eacute;l&eacute;communications. Leurs
comp&eacute;tences se d&eacute;ploient partout o&ugrave; il est question
d'interactivit&eacute; dans l'information, partout o&ugrave; la gestion
industrielle et commerciale d&eacute;pendra d'abord de syst&egrave;mes nerveux
complexes, de leur intelligence et de leur s&ucirc;ret&eacute;.<p>
<p align=center>
<b>... dans la soci&eacute;t&eacute; de demain, les Ing&eacute;nieurs des
T&eacute;l&eacute;coms ne seront pas les 
seuls experts des march&eacute;s de la communication. Mais ils seront
diff&eacute;rents, plus
complets, plus impliqu&eacute;s, plus visionnaires. Leur histoire, leur
attachement &agrave; 
l'int&eacute;r&ecirc;t g&eacute;n&eacute;ral, comme leur exp&eacute;rience
de m&eacute;tiers en constante &eacute;volution
valent d&eacute;j&agrave; r&eacute;putation.</B>
</p>
<IMG SRC="Images/vertj.gif"><P>

<A HREF="mailto:aitcorps@email.enst.fr"><IMG ALIGN=MIDDLE ALT="[Email]" SRC="Images/lettre.gif">
<A HREF="info.html"><IMG ALIGN=MIDDLE ALT="[Infos]" SRC="Images/info02.gif"></A>
<A HREF="index.html"><IMG ALIGN=MIDDLE ALT="[Page Principale]" SRC="Images/corps.gif"></A>
</HTML>
