<HTML><HEAD>
<!-- This document was created from RTF source by rtftohtml version 3.0.1 -->
<TITLE>Introduction au cours de dominante I.A. - LI.A. et les t&eacute;l&eacute;communications : au-del&agrave; du  tuyau </TITLE></HEAD>
<BODY BACKGROUND="fond.gif" TEXT=#1809BB>
<A HREF="introi06.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/leftg.gif" ALT="<< " border=0></A>
 <A HREF="introi08.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/rightg.gif" ALT="" border=0></A>
 <A HREF="introi01.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/upg.gif" ALT="Up " border=0></A>
 <A HREF="introi.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/topg.gif" ALT="Title " border=0></A>
<hr size=4>
<H2>
LI.A. et les t&eacute;l&eacute;communications : au-del&agrave; du  tuyau </H2>
<b></b><p>
<b></b>Depuis un si&egrave;cle, la recherche en
t&eacute;l&eacute;communications consiste en gros &agrave; expliquer comment
r&eacute;aliser un " tuyau " efficace. Si A veut communiquer avec B, comment
&eacute;tablir un lien qui leur permettra de le faire pour un co&ucirc;t
raisonnable ? Cette recherche a ensuite &eacute;volu&eacute;, en
int&eacute;grant des techniques capables de <i>traiter </i>l'information.
Actuellement, il s'agit d'un traitement de bas niveau, qui ne tient pas compte
de la s&eacute;mantique de l'information manipul&eacute;e.<p>
Par exemple, avec les inforoutes, on va pouvoir acc&eacute;der &agrave; une
&eacute;norme quantit&eacute; d'information. Mais rien n'est pr&eacute;vu pour
que ces informations soient accessibles dans les faits : comment rep&eacute;rer
l'information pertinente si elle est noy&eacute;e dans un oc&eacute;an
d'informations qui ne nous concernent pas ?<p>
*	De plus en plus de messages n'ont pas de destinataires d&eacute;sign&eacute;s
&agrave; l'avance. C'est le cas par exemple des informations mises sur le Web.
Doit-on les laisser dormir ?<p>
*	De plus en plus de communiquants cherchent une information, mais ne savent
pas o&ugrave; ni comment la trouver. Ne peut-on les aider ?<p>
*	Et puis, au-del&agrave; de la mode actuelle de l'information
pr&eacute;con&ccedil;ue et pr&eacute;enregistr&eacute;e (cd-rom, Web) il faut
se pr&eacute;parer &agrave; l'information dynamique, c'est-&agrave;-dire
assembl&eacute;e ou calcul&eacute;e pendant l'interaction. Si j'ai besoin de
conna&icirc;tre rapidement mes droits en cas de litige &agrave; propos d'un mur
mitoyen, je veux un syst&egrave;me qui, en dialoguant avec moi , serait capable
de me renseigner de mani&egrave;re pertinente.<p>
Les probl&egrave;mes d'aiguillage et de production d'informations pertinentes
prendront une importance pr&eacute;pond&eacute;rante dans les prochaines
ann&eacute;es. Or, m&ecirc;me avec des traitements et des transmissions dix ou
cent fois plus efficaces, satisfaire ces besoins restera probl&eacute;matique.
La solution sera avant tout qualitative : pour faire correctement son futur
m&eacute;tier, l'ing&eacute;nieur des t&eacute;l&eacute;communications devra
inclure dans ses sch&eacute;mas techniques un nouvel appareil, un appareil
qu'il n'a pas con&ccedil;u et dont il n'a jamais eu besoin de tenir compte
jusque l&agrave;. Il s'agit de l'<i>appareil cognitif humain</i>. S'il ne
comprend rien &agrave; ce dispositif, il continuera &agrave; faire circuler
efficacement des informations inutiles. La prise en compte de l'humain dans le
processus de communication d&eacute;bouche sur la ma&icirc;trise des techniques
d'<i>ing&eacute;nierie de la connaissance</i>. Qu'est-ce que cela comporte ?<p>
*	Il s'agit en premier lieu de comprendre <i>pourquoi </i>les humains
communiquent. Bizarrement, des millions de conversations sont transmises chaque
jour, et personne ne se demande pourquoi les gens payent pour communiquer, ni
quel genre d'information est ainsi &eacute;chang&eacute;. Si on comprend le
ph&eacute;nom&egrave;ne, on pourra peut-&ecirc;tre mieux l'assister, voire
l'amplifier.<p>
*	Il s'agit ensuite de comprendre les <i>contraintes</i> humaines li&eacute;es
&agrave; la communication, et ceci &agrave; tous les niveaux : les contraintes
physiques (fonctionnement du canal vocal), linguistiques (comprendre le
fonctionnement de la langue), cognitives (ergonomie, m&eacute;moire,
associations, apprentissage), et les contraintes de pertinence.<p>
*	Il s'agit enfin de <i>reproduire</i>, par tous les moyens imaginables,
certaines performances humaines afin de satisfaire avec des moyens artificiels
les besoins informationnels des utilisateurs.<p>
La satisfaction des futurs besoins informationnels entra&icirc;ne donc une
demande de nouvelles comp&eacute;tences. Les progr&egrave;s accomplis ces
derni&egrave;res ann&eacute;es dans les techniques d'Intelligence Artificielle
et d'Ing&eacute;nierie de la Connaissance contribuent pour une part essentiel
&agrave; donner une r&eacute;ponse &agrave; ce nouveau besoin.<p>
<P><hr size=4>
<A HREF="introi06.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/leftg.gif" ALT="<< " border=0></A>
 <A HREF="introi08.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/rightg.gif" ALT="" border=0></A>
 <A HREF="introi01.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/upg.gif" ALT="Up " border=0></A>
 <A HREF="introi.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/topg.gif" ALT="Title " border=0></A>
</body></html>