<HTML><HEAD>
<!-- This document was created from RTF source by rtftohtml version 3.0.1 -->
<TITLE>Introduction au cours de dominante I.A. - La recherche en Intelligence Artificielle &agrave; lENST</TITLE></HEAD>
<BODY BACKGROUND="fond.gif" TEXT=#1809BB>
<A HREF="introi05.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/leftg.gif" ALT="<< " border=0></A>
 <A HREF="introi07.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/rightg.gif" ALT="" border=0></A>
 <A HREF="introi01.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/upg.gif" ALT="Up " border=0></A>
 <A HREF="introi.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/topg.gif" ALT="Title " border=0></A>
<hr size=4>
<H2>
La recherche en Intelligence Artificielle &agrave; lENST</H2>
<UL>
<LI><A HREF="#Heading17">Vers l'utilisation du temps dans les r&eacute;seaux connexionnistes</A>
<LI><A HREF="#Heading18">Le traitement du langage naturel</A>
<LI><A HREF="#Heading19">La recherche cognitive</A>
</UL>
<hr size=4>
<b></b><p>
<b></b>Le groupe MILC (Mod&egrave;les Informatiques pour le Langage et la
Cognition), au sein du D&eacute;partement Informatique de TELECOM-Paris,
concentre ses efforts de recherche sur certains aspects du langage et de la
cognition. Les mod&egrave;les que nous d&eacute;veloppons font appel aussi bien
au connexionnisme qu'aux techniques symboliques.
<h3>
<A NAME="Heading17">Vers l'utilisation du temps dans les r&eacute;seaux connexionnistes</A></h3>

<b><i></i></b><p>
<b><i></i></b>Les r&eacute;seaux de neurones classiques reposent sur une
transmission de l'activit&eacute; des neurones &agrave; travers un
r&eacute;seau &agrave; l'architecture parfaitement d&eacute;finie. La dynamique
de cette transmission est g&eacute;n&eacute;ralement laiss&eacute;e de
c&ocirc;t&eacute;. Pourtant, nous avons des raisons de penser que l'&eacute;tat
d'&eacute;quilibre final, en termes d'activit&eacute;s de neurones
particuliers, est peut-&ecirc;tre moins int&eacute;ressant que le
fonctionnement <i>dynamique </i>d'un r&eacute;seau dont l'architecture
(<i>i.e.</i> le c&acirc;blage) serait en partie laiss&eacute;e au hasard. Le
comportement d'un tel r&eacute;seau se d&eacute;finit alors par
l'&eacute;volution au cours du temps de l'activit&eacute; coordonn&eacute;e
d'assembl&eacute;es de neurones, et non de l'activit&eacute; de neurones
isol&eacute;s. Nous &eacute;tudions le comportement temporel de telles
architectures, ainsi que les perspectives qu'elles ouvrent sur le plan du
traitement de l'information (traitement perceptif, traitement du mouvement,
traitement des concepts).
<h3>
<A NAME="Heading18">Le traitement du langage naturel</A></h3>

<b><i></i></b><p>
<b><i></i></b>Une grande partie de nos efforts de recherche est
consacr&eacute;e &agrave; l'analyse et &agrave; la reproduction de la
performance linguistique. Nous sommes bien entendu conscients de
l'immensit&eacute; de la t&acirc;che, aussi concentrons-nous nos efforts sur
des angles d'attaque bien pr&eacute;cis. <p>
Au niveau de la phonologie, nous cherchons &agrave; faire d&eacute;couvrir par
la machine, &agrave; partir d'exemples, un ensemble limit&eacute; de
r&egrave;gles qui permettent d'acc&eacute;der &agrave; la prononciation d'un
mot (par ex. un nom propre) &agrave; partir de sa forme &eacute;crite. Au
niveau syntaxique et s&eacute;mantique, nous cherchons &agrave; rep&eacute;rer
des invariances dans un corpus vaste, en travaillant sur l'ensemble des mots de
la langue. Par exemple, <i>gouvernement</i> et <i>pr&eacute;sident</i> (en tant
que noms communs) pourront se r&eacute;v&eacute;ler proches dans un corpus issu
des &eacute;ditoriaux d'un grand quotidien, parce qu'ils apparaissent dans les
m&ecirc;mes constructions syntaxiques. On en d&eacute;duit des relations de
substituabilit&eacute; en contexte, qui sont tr&egrave;s utiles lorsqu'on veut
faire par exemple de la correction orthographique ou amplifier une
requ&ecirc;te de recherche bibliographique. Au niveau de l'utilisation du
langage en situation (le niveau dit pragmatique), nous cherchons, par
l'observation et la simulation des conversations spontan&eacute;es, &agrave;
d&eacute;gager les contraintes portant sur le r&ocirc;le logique des arguments.
Cette recherche nous ouvre la voie vers des syst&egrave;mes d'aide capables
d'argumenter, vers des modules d'explication efficaces pour les Syst&egrave;mes
&agrave; base de connaissances, vers la g&eacute;n&eacute;ration de textes
structur&eacute;s, etc.
<h3>
<A NAME="Heading19">La recherche cognitive</A></h3>

<b><i></i></b><p>
<b><i></i></b>De nombreuses performances, dont l'automatisation
repr&eacute;sente pourtant un int&eacute;r&ecirc;t &eacute;conomique crucial,
restent inaccessibles aux ordinateurs, non parce que nous manquons de machines
puissantes ou de m&eacute;moire, mais parce qu'ils supposent une
compr&eacute;hension du fonctionnement humain que nous n'avons pas encore. Nous
avons d&eacute;j&agrave; &eacute;voqu&eacute; le langage, on peut citer aussi
l'enseignement. Les recherches en mati&egrave;re d'E.A.O. (enseignement
assist&eacute; par ordinateur) butent sur notre ignorance de la mani&egrave;re
dont les connaissances conceptuelles sont acquises et manipul&eacute;es par les
&eacute;l&egrave;ves. Une part de nos travaux de recherche vise &agrave;
r&eacute;aliser des mod&egrave;les, connexionnistes et symboliques, d'un
fonctionnement cognitif qui permet l'&eacute;mergence de nouveaux concepts et
de nouvelles relations conceptuelles. Le concept appara&icirc;t, dans ces
mod&egrave;les, comme un invariant perceptif auquel est associ&eacute; un
symbole, ou comme un " capteur cognitif ". Ces mod&egrave;les trouvent leur
application en psychologie ou en E.A.O.<p>
<P><hr size=4>
<A HREF="introi05.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/leftg.gif" ALT="<< " border=0></A>
 <A HREF="introi07.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/rightg.gif" ALT="" border=0></A>
 <A HREF="introi01.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/upg.gif" ALT="Up " border=0></A>
 <A HREF="introi.htm"><IMG SRC="/~jld/rtf2html/r2hwin/docs/images/topg.gif" ALT="Title " border=0></A>
</body></html>