<html><head><title>Departement ECO / ECO Department</title></head><body BGCOLOR="#ffffff" LINK="#000fff" VLINK="#5050ff"><h2 align=center><a href="eco.html"><img src="icone/eco.gif" align=left border=0></a>D&eacute;partement Economie et Management</h2></center><IMG src="/gif/lignes/barre.bleu.bleu.gif" alt="--------"><p><br><a name="tech"></a><h3><img src="/gif/blue.gif">Technologie et &eacute;conomie : de fortes interactions</h3><ul><li>Le d&eacute;partement Economie et Management de l'ENST est un p&ocirc;le de formation et de recherche au coeur des interactions qui s'exercent entre variables technologiques, &eacute;conomiques et humaines dans les domaines de l'information et de la communication.<p><li>Il offre une formation en sciences &eacute;conomiques, juridiques et de gestion &agrave; de futurs ing&eacute;nieurs et &agrave; des &eacute;tudiants en DEA et doctorat qui auront &agrave; prendre des initiatives et des responsabilit&eacute;s  dans  des domaines d'activit&eacute; hautement &eacute;volutifs concernant l'ensemble des acteurs et des march&eacute;s :  constructeurs d'&eacute;quipement (informatique et t&eacute;l&eacute;communications), nouveaux services de communication, offre  et mise en oeuvre comp&eacute;titive des r&eacute;seaux et des syst&egrave;mes d'information.</ul><p>Les axes de l'activit&eacute; du d&eacute;partement sont :<ul><li> Organisation des march&eacute;s et industries de l'information et des t&eacute;l&eacute;communications,<li>Organisation des entreprises et technologies de l'information et de la communication.<li>Analyse et donn&eacute;es statistiques.<li>Gestion dynamique des PME-PMI :<br>Financement et gestion du risque, comportement concurrentiel et strat&eacute;gies d'innovation)<li> Approfondissement de la r&eacute;flexion sur les outils du management.</ul><a name="ana"></a><h3><img src="/gif/blue.gif"> Un lieu d'analyse et de proposition</h3>Les membres du d&eacute;partement ont &eacute;t&eacute; associ&eacute;s &agrave; des groupes d'<b>experts</b> et instances de consultation: <ul><li>Commissions du Plan, <li>Commission consultative des radiocommunications, <li>Commission des Communaut&eacute;s Europ&eacute;ennes (programmes RACE et ACTS),<li>Direction G&eacute;n&eacute;rale des Postes et T&eacute;l&eacute;communications.</ul><p>Ils ont particip&eacute; &agrave; l'organisation de plusieurs <b>colloques</b>, entre autres:<ul><li> Les relations verticales dans les industries de r&eacute;seaux ( en collaboration avecl'universit&eacute; Paris IX-Dauphine), <li>11&egrave;me Symposium International COMPSTAT (Vienne), <li>Journ&eacute;es OSDA (Ordinal and Symbolic Data Analysis, INRIA Paris),<br><li> Colloque francophone Innovation et Organisation des PME. </ul><p>La collaboration &agrave; l'&eacute;dition de la <b>Revue d'&eacute;conomie industrielle</b> s'est poursuivie, tandis qu'est lanc&eacute;e une nouvelle revue Syst&egrave;me d'Information et Management. La publication ECOSIP sur la "Gestion des projets", &agrave; laquelle ils ont contribu&eacute;, a connu un important succ&egrave;s.<p>La gestion et l'&eacute;conomie de l'information constituent un champ de recherche d'une grande richesse. Le d&eacute;partement contribue &agrave; une meilleure analyse et pr&eacute;vision de ces ph&eacute;nom&egrave;nes. Il associe le point de vue &eacute;conomique &agrave; l'organisation et aux strat&eacute;gies des entreprises qui sont confront&eacute;es &agrave; de fortes incertitudes technologiques et marchandes. A ce titre, c'est un lieu d'analyse et de proposition ins&eacute;r&eacute; dans les r&eacute;seaux fran&ccedil;ais et internationaux.<p></v3></center><IMG src="/gif/lignes/barre.bleu.bleu.gif" alt="--------"><br><P align=center><a href="/index.html"><img src="/menu/homepage.gif" border=0></a><a href="/ecole.html"><IMG SRC="/menu/mecole.gif"border=0></a><a href="/formation.html"><IMG SRC="/menu/mformation.gif"border=0></a><a href="/recherche.html"><IMG SRC="/menu/mrech.gif"border=0></a><a href="/actu.html"><IMG SRC="/menu/mactu.gif"border=0></a><a href="/indexx.html"><IMG SRC="/menu/mindex.gif"border=0></a><a href="/serveur.html"><img src="/menu/mweb.gif" border=0></a><a href="http://www-stud.enst.fr/french/"><IMG SRC="/menu/meleves.gif"border=0></a><br><font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br><font size=2>Mise &agrave; jour le 15 Mars 1996 par <a href="CV/deschamps.html"><IMG align="middle" SRC="icone/madhaker.gif" border=middle> Emmanuel  DESCHAMPS</a><br><font size=2>Je remercie le d&eacute;partement <a href="http://www-inf.enst.fr">Informatique</a> et le bureau des <a href="http://www.enst.fr/~bdt/"> th&eacute;sards </a> pour leur assistance</font></P></body> </html>