<HTML>


<BODY BGCOLOR="FFFFFF">



<P>  Les techniques de codage utilis&eacute;es pour prot&eacute;ger le message contre les nombreuses interf&eacute;rences du canal 
ne sont pas les mêmes selon si c'est de la parole qui est transmise, ou des donn&eacute;es 
num&eacute;riques. Commençons par &eacute;tudier les techniques de codage des messages vocaux.
<H3> Codage de canal d'un message vocal </H3>
<P>Rappelons que <A HREF="cadrevocoding.html" TARGET="_parent">l'&eacute;chantillonneur vocal</A> a transform&eacute; la parole en blocs de 260 Bits, 
correspondant &agrave; 20 ms de parole chacun. Les bits de ces blocs ont &eacute;t&eacute; r&eacute;partis en <A HREF="cadrevocoding2.html" TARGET="_parent">trois classes</A>
, en fonction de leur "sensibilit&eacute;" aux erreurs: 
<UL>
<LI> <STRONG> Les 50 bits de classe Ia</STRONG>  sont les plus sensibles aux erreurs et seront donc ultra-prot&eacute;g&eacute;s.
<LI> <STRONG> Les 132 bits de classe Ib</STRONG> sont mod&eacute;r&eacute;ment sensibles aux erreurs.
<LI> <STRONG> Les 78 bits de classes II </STRONG> sont les moins sensibles. 
</UL>
<A NAME="sequence"></A>
On commence par coder les bits de classe Ia avec un <A HREF="cadrecycle.html" TARGET="_parent">code cyclique</A>, qui rajoute 3 bits de parit&eacute;. Ces 53 bits, ajout&eacute;s 
aux 132 bits de classe Ib et &agrave; 4 bits de queue (soit 189 bits au total), sont cod&eacute;s &agrave; l'aide d'un <A HREF="cadreconvolutif.html" TARGET="_parent">code convolutif</A> 
de rapport 1/2, et de longueur de contrainte 4. On r&eacute;cup&egrave;re donc 189 x 2= 378 bits, auxquels on ajoute les 132 bits de classe II, qui 
eux ne seront pas prot&eacute;g&eacute;s. Notre &eacute;chantillon parole de 20 ms est donc cod&eacute; sur 456 bits, ce qui donne <EM>un taux 
d'&eacute;chantillonnage
final de 22.8 kbps</EM>. 
<P>
Mais ce n'est pas tout ! Pour s'assurer un peu plus encore du bon convoyage de notre message, nos &eacute;chantillons de 456 bits
vont être transmis <A HREF="cadreentrelac.html" TARGET="_parent">entrelac&eacute;s</A> sur 8 bursts temporels cons&eacute;cutifs.
<P>Maintenant que le message est enfin prêt &agrave; être transmis, encore faut-il le transformer en signal physique. La 
technique de modulation choisie pour cette op&eacute;ration est appel&eacute;e <A HREF="cadregmsk.html" TARGET="_parent">GMSK</A>. Cette technique de modulation fut 
choisie parce qu'elle est un bon compromis en termes d'occupation spectrale et de complexit&eacute; de mise en oeuvre. 

<P>Le d&eacute;codage &agrave; r&eacute;ception de ce message est fait beaucoup plus complexe que l'encodage lui-m&ecirc;me. En particulier, le codage convolutif exige l'impl&eacute;mentation de <A HREF="cadreviterbi.html" TARGET="_parent">l'algorithme de Viterbi</A>, qui est relativement complexe.
<P>
<IMG ALIGN="CENTER" SRC="schem.GIF">
</BODY>
</HTML>