<HTML>
<BODY BGCOLOR="FFFFFF">
<P>
La condition n&eacute;cessaire pour offrir un service de t&eacute;l&eacute;phonie mobile sur toute l'Europe est de disposer d'une bande de fr&eacute;quence commune sur l'ensemble du territoire. La pr&eacute;histoire du GSM a commenc&eacute; en 1979 par la Conf&eacute;rence Administrative Mondiale des Radiocommunications (WARC). Un accord a &eacute;t&eacute; conclu au sein de cette instance internationale pour ouvrir la bande des 900 Mhz aux services mobiles.<BR>
Pendant les ann&eacute;es 80, les syst&egrave;mes de communications cellulaires analogiques ont connu une forte croissance dans diff&eacute;rents pays europ&eacute;ens, en particulier la Su&egrave;de, la Grande-Bretagne mais aussi la France et l'Allemagne. Chaque pays a d&eacute;velopp&eacute; son propre syst&egrave;me analogique, rendant ainsi impossible la comptabilit&eacute; des diff&eacute;rents syst&egrave;mes au niveau europ&eacute;en.<BR>
<P>
C'est afin de permettre une int&eacute;gration des services au niveau europ&eacute;en que la Conf&eacute;rence Europ&eacute;enne des Postes et T&eacute;l&eacute;communications (CEPT) de 1982 a charg&eacute; une &eacute;quipe d'&eacute;tudier et de d&eacute;velopper un syst&egrave;me europ&eacute;en  radiomobile cellulaire. Elle  a de plus d&eacute;cid&eacute; d'allouer des sous-bandes de fr&eacute;quences pr&eacute;cises autour des 900 Mhz sp&eacute;cifi&eacute;es en 1979. Ainsi, une sous-bande de 25 Mhz de 890 &agrave; 915 Mhz a &eacute;t&eacute; attribu&eacute;e aux transmissions des terminaux vers le r&eacute;seaux, et une autre sous-bande de m&ecirc;me largeur de 915 &agrave; 930 Mhz aux transmissions en sens inverse.
Fin 1990, les sp&eacute;cifications du GSM (Global System for Mobile communications) ont &eacute;t&eacute; officiellement publi&eacute;es. Les concepteurs ont choisi un syst&egrave;me num&eacute;rique &agrave; contre courant des syst&egrave;mes d&eacute;velopp&eacute;s aux Etats-Unis, tel que l'AMPS, qui &eacute;taient tous analogiques.
<P>
Ce document se veut une <A HREF="cadrepresentation.html" TARGET="_parent">description d'ensemble</A> de la norme GSM. Seules les <A HREF="cadrecanalvoix.html" TARGET="_parent">techniques de codage des donn&eacute;es</A> y sont vues dans le d&eacute;tail.

<H4>
Une Bibliographie sommaire sur la norme GSM</H4>
<UL>
<LI><EM>An Introduction to GSM</EM> par M. REDL,M.WEBER,M.OLIPHANT.<BR>
        Edition Artech House (en anglais)
<LI><EM>R&eacute;seaux GSM et DCS</EM> par M.Lagrange,Godlewski et Tabbane<BR>
        Editions Hermes (en Fran&ccedil;ais)
<LI><A HREF="http://ccnga.waterloo.ca/~jscouria/GSM/gsmreport.html" TARGET="_parent">Un site canadien en langue anglaise sur le GSM</A>
</UL>


 

</BODY>
</HTML>








