<html><head>
<title>Formation initiale
</title>

</head>
<body BGCOLOR="#ffffff" text="#2000aa" LINK="#000fff" VLINK="#7070ff"><font size=+1></body>

<a name="fi"></a><h1 align="center"><a href="../formation.html"><img src="icone/fi.gif" align=left border=0></a>
Formation initiale</h1>
<img src="../gif/lignes/vertj.gif"><p>
Suivre une formation d'ing&eacute;nieur &agrave; l'ENST, c'est d'abord 
acqu&eacute;rir des comp&eacute;tences dans le domaine des sciences et 
techniques de l'information et des communications : informatique, 
&eacute;lectronique, r&eacute;seaux, signaux et images, 
t&eacute;l&eacute;communications.
C'est aussi d&eacute;couvrir l'entreprise &agrave; travers des visites, 
un stage d'ex&eacute;cution et un stage d'ing&eacute;nieur, acqu&eacute;rir 
des connaissances en &eacute;conomie et management et d&eacute;velopper ses 
capacit&eacute;s d'expression et de communication. 
Enfin, c'est se pr&eacute;parer &agrave; travailler dans un environnement 
international : tr&egrave;s bonne ma&icirc;trise de l'Anglais, pratique d'une 
deuxi&egrave;me langue, stage ou cursus &agrave; l'&eacute;tranger.


<P> L'ENST forme chaque ann&eacute;e environ 250 ing&eacute;nieurs civils des 
T&eacute;l&eacute;communications. <p>

<a name="cursus"></a><P><center><h3>Le cursus</h3></center>
Le cursus   s'effectue en trois ans pour les &eacute;l&egrave;ves issus du Concours Commun 
(Mines, Ponts, T&eacute;l&eacute;com...).  Il dure deux ans pour les &eacute;l&egrave;ves admis sur titres 
(issus de l'Ecole Polytechnique ou titulaires d'une ma&icirc;trise ou d'un dipl&ocirc;me 
&eacute;quivalent).  
<p>
L'ENST propose &agrave; ses &eacute;l&egrave;ves une grande diversit&eacute; 
de cursus. Le caract&egrave;re optionnel des enseignements est un 
&eacute;l&eacute;ment important de souplesse et d'ouverture de la formation 
dispens&eacute;e &agrave; l'&Eacute;cole. Les &eacute;l&egrave;ves entrant 
directement en deuxi&egrave;me ann&eacute;e s'int&egrave;grent 
&agrave; ce sch&eacute;ma avec des variantes.

<P>Le <b><a href="programme.html">programme d'enseignement</a></b> est articul&eacute; en trois grandes phases 
successives, correspondant &agrave; trois niveaux d'acquisition de 
comp&eacute;tences:<br> 
<a href="bci.html">La base des connaissances indispensables</a><br>
<a href="dom.html">Les dominantes</a><br>
<a href="opt.html">Les options</a>
<P>Ind&eacute;pendamment des dominantes et des options, des modules optionnels,
 organis&eacute;s en unit&eacute;s de valaur capitalisables, sont 
 propos&eacute;s tant en deuxi&egrave;me qu'en troisi&egrave;me ann&eacute;e. 
 Ils permettent &agrave; l'&eacute;l&egrave;ve d'acqu&eacute;rir des 
 connaissances compl&eacute;mentaires dans des domaines de son choix qui ne 
 sont pas trait&eacute;es dans les dominantes ni dans les options et qui
  peuvent relever aussi bien des sciences fondamentales (math&eacute;matiques, 
  physique) que de la formation humaine, de l'&eacute;conomie, de la gestion 
  ou de certaines techniques situ&eacute;es &agrave; la fronti&egrave;re du 
  champ naturel de l'&Eacute;cole.<p>
<img src="../gif/lignes/vertj.gif">

<P align=center>
<a href="../index.html"><img src="../menu/homepage.gif" border=0></a>
<a href="../ecole.html"><IMG SRC="../menu/mecole.gif"border=0></a>
<a href="../formation.html"><IMG SRC="../menu/mformation.gif"border=0></a>
<a href="../recherche.html"><IMG SRC="../menu/mrech.gif"border=0></a>
<a href="../actu.html"><IMG SRC="../menu/mactu.gif"border=0></a>
<a href="../indexx.html"><IMG SRC="../menu/mindex.gif"border=0></a>
<a href="../serveur.html"><img src="../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../menu/meleves.gif"border=0></a>
<br><font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center>

</font></P>
</body> </html>
