<HTML>
<HEAD>
<TITLE>El candidato ideal</TITLE>
</HEAD>
<BODY>
[<a href="0507esp.rtf">RTF</a>] -- [espa&ntilde;ol] 
        [<A HREF="../deu/0507-deu.html">deutsch</A>]
        [<A HREF="../eng/0507-eng.html">English</A>] 
	[<a href="../fra/0507-fra.html">fran&ccedil;ais</a>]
	[<a href="../por/0507-por.html">portugu&ecirc;s</a>]
 	[<a href="../sve/0507-sve.html">svenska</a>]

<p>
<table>
<tr><td><a href="../tdaufgxxx.html"><img align=left src="../../pict/59.gif" border=0>INDEX</a>
    <td width=100% align=right>20.04.97 
</table>
<hr>
<h1>El candidato ideal</h1>
<h3>Tarea</h3>
<P>Hay que cubrir el puesto de un(a) animador(a)-jefe, del prestigioso club de vacaciones, el Club <I>Don Valley Spa Club</I>. Han solicitado el puesto:</P>
<OL>
<li>La se&ntilde;orita Mar&iacute;a A., espa&ntilde;ola, de 26 a&ntilde;os, soltera, con un ni&ntilde;o de 3 a&ntilde;os, azafata, domina perfectament espa&ntilde;ol, ingl&eacute;s y alem&aacute;n;
<li>La se&ntilde;ora Susanne B., alemana, de 37 a&ntilde;os, divorciada, sin hijos, profesora de deportes, domina alem&aacute;n, ingl&eacute;s, franc&eacute;s y habla algo de espa&ntilde;ol;
<li>El se&ntilde;or Philip C., ingl&eacute;s, de 34 a&ntilde;os, casado, con dos ni&ntilde;os, diplomado en Turismo, domina ingl&eacute;s, espa&ntilde;ol y franc&eacute;s;
<li>El se&ntilde;or Henri D., franc&eacute;s, de 30 a&ntilde;os, separado, gu&iacute;a de turismo, domina franc&eacute;s, ingl&eacute;s, alem&aacute;n, espa&ntilde;ol, italiano y suaheli.
</OL>
<P>Tu compa&ntilde;ero/a y t&uacute; hab&eacute;is le&iacute;do las cuatro solicitudes con toda la documentaci&oacute;n, habi&eacute;ndoos decidido por una o uno de los cuatro solicitantes. Discutid vuestras preferencias entre vosostros/as e intentad llegar a una decisi&oacute;n adecuada. Apuntad los argumentos convenientes y prepararos a defender vuestra decisi&oacute;n ante el grupo entero.</P>
<p><br>
<h3>Giros</h3>
<P>En virtud de la importancia del cargo consideramos a ... como el m&aacute;s adecuado ...</P>
<P>Proponemos a la se&ntilde;ora/se&ntilde;orita / al se&ntilde;or ... para/como ..., porque ...</P>
<P>Sin restar m&eacute;ritos a los dem&aacute;s ...</P>
<P>... y despu&eacute;s de pensarlo muy bien estamos convencidos de que ...</P>
<P>No queremos pecar de partidistas, pero ...</P>
<P>Tras un detenido examen de la documentaci&oacute;n ...</P>
<P>por las razones siguientes: primero ..., segundo ..., tercero ...</P>
<P>Opinamos que ella/&eacute;l ...</P>
<P>Estamos seguras / convencidas que con ...</P>
<P>Nos ha impresionado sobre todo con su ...</P>
<P>Seguro que ...</P>
<P>No dudamos que ...</P>
<P>Bien. ...</P>
<P>Puede ser que ...</P>
<P>De eso no cabe duda, pero no obstante ...</P>
<P>¿Por qu&eacute; no nos decidimos? Votemos.</P>
<P>Ante estos argumentos nosotros retiramos sin m&aacute;s nuestro candidato.</P>
<P>Ante el peso de estos argumentos esperamos que apoy&eacute;is nuestra propuesta.</P>
<p><br><p><br>
<h3>Argumentos</h3>
<P>Ella / &eacute;l</P>
<DIR>

<P>domina (perfectamente) ...</P>
<P>tiene una larga experiencia en/con ...</P>
<P>es (muy) abierto</P>
<P>sabe ponerse en la situaci&oacute;n de los dem&aacute;s</P>
<P>sabe convencer</P>
<P>es amigo de tomar decisiones</P>
<P>es capaz de imponerse</P>
<P>es muy activo</P>
<P>busca el &eacute;xito</P>
<P>es formal</P>
<P>es de confianza</P>
<P>ha demostrado mediante ... que ...</P>
<P>ha demostrado que es capaz de ...</P>
<P>es joven / din&aacute;mico / flexible / tolerante</P>
<P>tiene una cara muy expresiva</P>
<P>S&oacute;lo su apariencia / su aspecto exterior produce ya un efecto ... en ...</P>
<P>Con su sonrisa cautivadora crea una atm&oacute;sfera ...</P>
</DIR>
<p><br><hr>
<P><center><em>German and Spanish version 1984 by Tandem Bochum–Oviedo  &copy; 1984-1995 Seminar f&uuml;r Sprachlehrforschu</em>ng, Ruhr-Universit&auml;t Bochum (D)</em></center></P>
</BODY>
</HTML>

