<HTML>
<HEAD>
<TITLE>Hablar sobre alguien</TITLE>
</HEAD>
<BODY>
<h1>Hablar sobre alguien</h1>
<h3>Tarea</h3>
<P>Imaginaros por ejemplo que alguien quiere convivir con vosotros en vuestro piso o ir con vosotros de vacaciones. Vosotros, sin embargo, no est&aacute;is (todav&iacute;a) totalmente de acuerdo si lo acept&aacute;is o no.</P>
<P>Es un tema muy com&uacute;n en el cine: las personas no son lo que parecen. <I>Attracci&oacute;n fatal</I>, <I>Body Heat</I>, <I>La mano que mece la cuna</I>, s&oacute;lo por nombrar un par de ejemplos en los que la gente entra en la vida de los dem&aacute;s provocando el caos y la destrucci&oacute;n. Seguro que vosotras conocer&eacute;is gente que superficialmente parece ser agradable e inofensiva, pero que en el fondo puede ser desagradable y sin escr&uacute;pulos. Deb&eacute;is tener todo esto presente cuando hag&aacute;is esta tarea.</P>
<p><br>
<P><h3>Pod&eacute;is empezar as&iacute;:</h3></P>
<table width=100%>
<tr><td width=10%>A:<td>Bueno, a ver, ¿qu&eacute; te parece a ti?
<tr><td>B:<td>Hombre, no s&eacute; -- ¿y t&uacute;?
<tr><td>A:<td>¿Por qu&eacute;? ¿Tienes algo en contra? A m&iacute; me resulta un tipo muy agradable.
<tr><td>B:<td>No, no, si a m&iacute; tambi&eacute;n. Lo que pasa es que ... Bueno, me parece que deber&iacute;amos volver a hablar de eso.
<tr><td>A:<td>Vale. A ver, empieza ...
</table>
<p><br><p><br>
<P><h3>Giros</h3></P>
<P><b>Es un tipo, c&oacute;mo dir&iacute;a yo, bueno, pues ...</b></P>
<P>a m&iacute; me parece muy ... / lo considero muy ...
<br>yo creo que es ...
<br>lo veo como ...
<br>en mi opini&oacute;n es ...
<p><br>
<B><P>A m&iacute; lo que m&aacute;s / menos me gusta de &eacute;l ...</P></B>
<P>lo que me gusta mucho / me chifla / me ilusiona es que ...
<br>lo &uacute;nico que (no) me gusta ...
<br>lo que no le aguanto / soporto ...
<br>lo que no me gusta nada, pero que nada, es que ...
<p><br>
<B><P>Conmigo se ha portado siempre ...</P></B>
<P>sabes que con &eacute;l me he llevado una gran sorpresa / decepci&oacute;n
<br>al principio me pareci&oacute; ... , pero luego ...
<br>despu&eacute;s de tratarle alg&uacute;n tiempo he tenido que cambiar de  opini&oacute;n. He visto que ... / Me he dado cuenta que ...
<br>ten&iacute;as que haberlo visto cuando ...
<br>entonces se port&oacute; ... / entonces se mostr&oacute; como un t&iacute;o ...
<br>yo le he tratado mucho y siempre / nunca ...
<p><br>
<B><P>No s&eacute;, no s&eacute; ...</P></B>
<P>tampoco es que le conozca a fondo / bien, pero ...
<br>aunque, a decir verdad, ...
<br>no s&eacute;, si te digo la verdad ...
<br>chica, no s&eacute; qu&eacute; decirte / ¿qu&eacute; quieres que te  diga?, a m&iacute; / yo ...
<br>por una parte ... , pero por otra ... / por un lado ... ,  pero por otro ...
<p><br>
<B><P>Ser&aacute; as&iacute; pero ...</P></B>
<P>puede que  sea as&iacute;, pero mi experiencia es muy distinta. Yo estoy  convencido de que es ...
<br>No digo que no, pero yo lo veo de otra forma: ...
<br>yo tengo la impresi&oacute;n de que no  lo conoces nada bien / en absoluto.
<p><br>
<B><P>De por s&iacute; es ... , pero lo que pasa es que</P></B>
<P>de por s&iacute; es un buen chaval / chico, lo que pasa /  ocurre es que ...
<br>S&iacute;. Ahora que t&uacute; lo dices, en eso no hab&iacute;a ca&iacute;do yo.
<p><br><hr>
<P><center><em>German and Spanish version 1984 by Tandem Bochum–Oviedo  &copy; 1984-1995 Seminar f&uuml;r Sprachlehrforschu</em>ng, Ruhr-Universit&auml;t Bochum (D)</em></center>
</BODY>
</HTML>

