<html>
<head>
<title>Die CDU als Modell - Gr&uuml;nde f&uuml;r den dauerhaften Erfolg  </title>
</head>
<body>
<BODY BACKGROUND="gifs/zeitbg.gif">
<ul>
<br>
<h2>Die CDU als Modell - Gr&uuml;nde f&uuml;r den dauerhaften Erfolg  </h2>

<hr noshade>

<h3>
von Franz Walter  </h3>

<p>

<br clear=all>
<P>
<br>


<h3>Am Sonntag versammeln sich die Christdemokraten zum Parteitag in Hannover. Die Union schleppt eine Menge Probleme mit sich herum, und doch ist die CDU die erfolgreichste Partei der deutschen  Parlamentsgeschichte. Was ist ihr Erfolgsrezept?  </h3>
<p>

Eigentlich d&uuml;rfte Helmut Kohl gar nicht mehr Kanzler sein. Eigentlich m&uuml;&szlig;te die <A HREF="http://www.cdu.de/">CDU</A>  l&auml;ngst zu einer Zwanzigprozentpartei geschrumpft sein. Denn eigentlich laufen nach der Diagnose kundiger Soziologen die gesellschaftlichen Trends gegen die Christdemokraten, und das schon seit einem Vierteljahrhundert.<p>

Bereits damals, als Sozialdemokraten und Freidemokraten historische B&uuml;ndnisse schmiedeten, war die CDU auch bei vorsichtigen Wahlforschern abgeschrieben. Das hatte plausible Gr&uuml;nde. Die CDU war zu der Zeit eine Partei der Vergangenheit, der &uuml;beralterten, absterbenden Sozialstruktur: der Rentner, der Kleinkr&auml;mer, der Katholiken, der Provinz. Alles richtete sich in den fr&uuml;hen siebziger Jahren auf die s&auml;kularisierte Arbeitnehmergesellschaft ein, und als deren Repr&auml;sentantin galt die <A HREF="http://www.spd.de/">SPD</A> . Dann aber kamen Postmaterialismus und Individualismus &uuml;ber die Bundesb&uuml;rger. Das war schlecht f&uuml;r die SPD, aber noch nicht gut f&uuml;r die CDU, mit deren postmaterialistischer Gesinnung es noch weniger weit her war. Schon eher war das die Zeit f&uuml;r die Gr&uuml;nen und wohl auch keine schlechte Voraussetzung f&uuml;r einen flotten Yuppie-Liberalismus.<p>

Doch der Bundeskanzler der neunziger Jahre hei&szlig;t nicht Oskar Lafontaine, Joschka Fischer oder gar Guido Westerwelle. Er hei&szlig;t nun einmal Helmut Kohl und regiert demn&auml;chst - Stichtag 31. Oktober - l&auml;nger als jeder seiner Vorg&auml;nger. Die Erfolgspartei der f&uuml;nfziger Jahre pr&auml;gt auch die Bundesrepublik der neunziger Jahre. Insgesamt 34 Regierungsjahre hat die Union auf dem Buckel. Keine Frage: Die CDU ist die erfolgreichste Partei der deutschen Parlamentsgeschichte.<p>

Nur: Wieso ist sie das? Vor allem: Warum ist sie das immer noch? Die gesellschaftlichen und kulturellen Modernisierungssch&uuml;be haben sie nicht beg&uuml;nstigt. Viele ihrer organisatorischen und personellen Ressourcen aus den kirchlichen Milieus sind versiegt. Und der kritische Geist der Republik hat allezeit mit der CDU gehadert, mal larmoyant wie unter Adenauer, mal aggressiv wie unter Erhard und Kiesinger, mal resigniert wie jetzt angesichts der h&uuml;nenhaften Unbesiegbarkeit des einst s&uuml;ffisant besp&ouml;ttelten Helmut Kohl.<p>

Nat&uuml;rlich zehrt die CDU von ihrer historischen Gr&uuml;nderrolle. In der Wahrnehmung der meisten Deutschen hat sie das politische und &ouml;konomische Erfolgsmodell Bundesrepublik geschaffen, Deutschland nach Jahrzehnten verheerender Krisen, nach Diktatur, Krieg, Flucht und Vertreibung in ein ruhiges und sicheres Fahrwasser gef&uuml;hrt. Seit dieser bundesdeutschen Gr&uuml;nderzeit unter Adenauer hat sich die Gleichsetzung von Sicherheit und Wohlstand mit christdemokratischer Regierungsf&uuml;hrung tief in die Volksseele eingebrannt. Es gibt in modernen Gesellschaften nur wenige kollektive, generationen&uuml;berspannende Erinnerungen und Dispositionen. In Deutschland geh&ouml;ren die Angst vor der Inflation und das nachgerade unersch&uuml;tterliche Vertrauen in die Wirtschaftskompetenz der Union dazu, auch wenn die Partei seit Erhards Zeiten mit &ouml;konomischem Sachverstand nicht gesegnet ist.<p>

Nur einmal, Ende der sechziger, Anfang der siebziger Jahre, besa&szlig;en die Sozialdemokraten die Chance des Rollentauschs. In gewisser Weise herrschte damals wieder Gr&uuml;nderzeit. Gesellschaft und Werte waren im Wandel, und die SPD h&auml;tte sich als zweite Gr&uuml;nderpartei langfristig im Bonner Machtzentrum festsetzen k&ouml;nnen. Denn schlie&szlig;lich hatte sie in den sechziger Jahren alles richtig gemacht: Sie hatte die ideologischen Altlasten ihrer nahezu hundertj&auml;hrigen Oppositionszeit entsorgt, neue pragmatische M&auml;nner nach vorn geholt und versprach jetzt nur noch, die bessere, modernere CDU zu sein. So brachte die SPD allm&auml;hlich die Mittelschichten hinter sich, f&auml;delte die Gro&szlig;e Koalition ein und bewies dort, da&szlig; sie sich in eine seri&ouml;se Truppe gewandelt hatte.<p>

Dann aber verspielte die Sozialdemokratie ihr zwischen 1960 und 1969 m&uuml;hsam angesammeltes Kapital innerhalb weniger Jahre. Schon ein paar Monate nach der Bildung der Regierung Brandt/Scheel begann die Partei ihre Reideologisierung. Man schrieb volumin&ouml;se Langzeitprogramme, bastelte an etatistischen Pl&auml;nen und Steuerkonzepten, t&uuml;ftelte Curricula aus und postulierte exzessive Steuern und Abgaben. Die bundesdeutsche Gesellschaft sollte sich emanzipieren und demokratisieren. Vieles davon hat die Gesellschaft durchgel&uuml;ftet und entkrustet. Aber manches war exaltiert, einiges dogmatisch. Die Mehrheit der Bundesdeutschen jedenfalls war sp&auml;testens von 1973 an der Reformtheoretik und Planungshybris &uuml;berdr&uuml;ssig, f&uuml;hlte sich &uuml;berreizt und &uuml;berfordert. Die SPD verlor vor allem wieder die marktorientierten Mittelschichten.<p>

Erst jetzt wurde die CDU zur Massenpartei. In diesen Jahren, 1971 bis 1973, verlor die SPD den entscheidenden Kampf, der die CDU schlie&szlig;lich wieder an die Macht zur&uuml;ckbrachte: als Partei der verl&auml;&szlig;lichen B&uuml;rgerlichkeit und pragmatischen Vernunft, als Partei von Ma&szlig; und Mitte, als die nat&uuml;rliche Regierungspartei der Bundesrepublik.<p>

Denn was die CDU der SPD &uuml;berlegen macht, sind nicht &uuml;berlegene Konzepte oder f&auml;higeres Personal. Es ist die realistischere Anthropologie. Da&szlig; Politik sich nach Pl&auml;nen vollziehe, Gesellschaften sich modellhaft konstruieren lie&szlig;en, die Menschen von ihren irdischen &Uuml;beln erl&ouml;st werden k&ouml;nnten, sind Vorstellungen, die den Christdemokraten ganz abstrus erscheinen. Die Sozialdemokraten waren lange Zeit verliebt in ihre Programmatik, und auch heute noch k&auml;mpfen sie mit leidenschaftlichem Ernst um jeden Spiegelstrich eines Resolutionstextes.<p>

Die CDU macht sich daraus nichts. Sie glaubt nicht an gro&szlig;e Visionen, interessiert sich nicht f&uuml;r Utopien. Die CDU ist konservativ. Aber man darf "konservativ" nicht mit starrsinnig, unzeitgem&auml;&szlig; oder immobil verwechseln. Der christdemokratische Konservatismus ist empirisch. Er h&auml;lt sich an die Erfahrungen, orientiert sich am Alltagswissen, kennt die Gewohnheiten der Menschen. Er ist pragmatisch, nicht theoretisch. Eben deshalb ist die CDU oft anpassungsf&auml;higer und offener f&uuml;r neue Entwicklungen als eine mit Ideologien beladene Partei.<p>

So hat die CDU Ver&auml;nderungszw&auml;nge h&auml;ufig rascher erfa&szlig;t als die SPD. Aber mit der Rolle der Avantgarde ohne Gefolge und Erfolg hatte die CDU nichts im Sinn. Im Gegenteil. Die Christdemokraten strengten das Volk nicht zu sehr an, muteten ihm lieber etwas weniger zu, ja oft genug haben sie es unterfordert und in Watte gepackt. Nicht zuletzt deshalb tut sich die Republik in den neunziger Jahren so schwer mit dem sozialen Wandel: Ihre Wohlfahrtslarmoyanz und Tr&auml;gheit haben auch christdemokratische Wurzeln.<p>

Eine Margaret Thatcher jedenfalls w&auml;re in der CDU undenkbar. Daf&uuml;r ist die CDU zu katholisch. Katholische Christdemokraten streben nicht zu neuen Ufern, sie stellen keine allzu hohen Anspr&uuml;che an die Menschen, verlangen ihnen kein &Uuml;berma&szlig; ethischer Anstrengungen ab. Die Katholiken setzen voraus, da&szlig; die Menschen schwach sind, da&szlig; sie s&uuml;ndigen, vielleicht sp&auml;ter bereuen, dann aber doch immer wieder von neuem fehlen. Das ist verzeihlich und im Diesseits sowieso nicht zu &auml;ndern.<p>

Dieses ganz und gar unidealistische Weltbild hat sich tief in die CDU eingepflanzt. Deshalb auch hat die Union im Gefolge von zwei Diktaturen nie Bedenken dagegen gehabt, sich die kleinen und mittleren Gefolgsleute der Regime organisatorisch einzuverleiben. Andere Parteien m&ouml;gen in Evangelischen Akademien &uuml;ber Schuld und Verstrickung im SED-Staat gr&uuml;beln - der CDU k&auml;me das nie ernsthaft in den Sinn. Sie wei&szlig;, da&szlig; die Menschen mangelhafte Gesch&ouml;pfe sind und Schuld auf sich laden. Und weil sich das in ihren Augen nun einmal nicht &auml;ndern l&auml;&szlig;t, will sie sich damit nicht weiter herumqu&auml;len. Punktum, Achselzucken, weiter geht es mit der Tagespolitik. So ist die CDU. Deshalb leiden die Intellektuellen an dieser Partei. Und darum sammelt sie im Volk immer wieder entscheidende Punkte.<p>

Ohne ihren katholischen Realismus w&auml;re die CDU vielleicht gar nicht erst Volkspartei geworden, jedenfalls keine so erfolgreiche. Denn die CDU hatte sozial und &ouml;konomisch sehr viel st&auml;rkere innere Gegens&auml;tze auszuhalten als die SPD. Die CDU hatte die Interessen der Industrie und des Kleingewerbes zu ber&uuml;cksichtigen, mu&szlig;te ein offenes Ohr haben f&uuml;r die sozialpolitischen Begehrlichkeiten der katholischen Arbeiterbewegung. Sie hatte die Subventionsw&uuml;nsche der Landwirtschaft zu bedienen und die &ouml;ffentlichen Bediensteten gro&szlig;z&uuml;gig zu versorgen. Sie mu&szlig;te den rechten und den linken Fl&uuml;gel zusammenbinden, F&ouml;deralisten und Nationalisten vereinen, forsche Deutschnationale und milde Liberale vers&ouml;hnen.<p>

Sie fing damit nicht beim Nullpunkt an. Ihre katholischen Politiker hatten schon vor 1933 in der Zentrumspartei viel Erfahrungen im Ausbalancieren heterogener Interessen sammeln k&ouml;nnen. Das katholische Zentrum war damals die erste und wohl auch einzige Volkspartei in Deutschland. Schon sie hatte westf&auml;lische Bauern und badische Handwerker, saarl&auml;ndische Bergarbeiter und schlesische Adelige, Republikaner und Monarchisten bei der Stange zu halten. Ein einzigartiges Training f&uuml;r ad&auml;quate Politik in modernen, sozial und normativ pluralistischen Gesellschaften. Die Zentrumspolitiker mu&szlig;ten integrieren, Interessen vermitteln und austarieren, Harmonieformeln finden, die auseinanderlaufenden F&auml;den am Ende immer wieder in der Mitte b&uuml;ndeln. Weltanschauungs- und Klassenparteien k&ouml;nnen das nicht, brauchen das auch nicht. Allerdings bleibt ihre Wirkung und Reichweite damit auch begrenzt, w&auml;hrend die CDU, in der Zentrumstradition, in die Breite griff und dabei dennoch zu einer Politik der Mitte f&auml;hig war.<p>

Die Zentrumspartei war eine Honoratioren- und Milieupartei, gest&uuml;tzt auf starke Institutionen des katholischen Verbandswesens, ohne eigene stabile und ausdifferenzierte Parteistrukturen. Genau so funktionierte auch die CDU in ihren ersten 25 Jahren. F&uuml;r eine starke F&uuml;hrungspers&ouml;nlichkeit war das eine ideale Konstellation, im Wahlkampf lie&szlig; sich das Milieu aus dem Stand aktivieren. Zwar war die Union der SPD organisatorisch hoffnungslos unterlegen, aber in den Wahlk&auml;mpfen spannten sich die Kommunikationsnetze der b&uuml;rgerlich-christlichen Lebenswelt um so dichter und weiter &uuml;ber das Land. Nach den Wahlen aber zog sich das Milieu sofort wieder aus der Politik zur&uuml;ck.<p>

Konrad Adenauer konnte also souver&auml;n regieren, ohne da&szlig; ihm Funktion&auml;re und Parteitage gro&szlig; dazwischenfunkten, auf eherne Grunds&auml;tze pochten oder Programmkommissionen installierten. Unter demokratietheoretischen Gesichtspunkten war das keine sch&ouml;ne Sache, aber hoch effizient. Das System Adenauer erlaubte starke F&uuml;hrung und lie&szlig; dabei Raum f&uuml;r taktische Beweglichkeit, zuweilen auch f&uuml;r unpopul&auml;re Regierungsaktionen.<p>

Ihre Parteibildung holte die CDU dann in ihrer Oppositionszeit der siebziger Jahre nach. Man hat sich angew&ouml;hnt, dies als unentbehrlichen Schritt zur Modernit&auml;t zu werten. Aber es l&auml;&szlig;t sich auch anders sehen. Denn die Programmdebatten, die nun f&uuml;r kurze Zeit losbrachen, unterhielten im Grunde nur die Parteifunktion&auml;re, f&uuml;hrten die Partei auf absonderliche Themenfelder, interessierten das Publikum aber nicht im geringsten. Auch der Modernisierungskurs der CDU-Parteizentrale unter Heiner Gei&szlig;ler hat in den achtziger Jahren lediglich den Integrationsbogen der CDU enger gespannt und letztlich wohl nur die Entwicklung der "Republikaner" gef&ouml;rdert.<p>

Etwas &uuml;berspitzt formuliert: Der modernisierte Parteientypus der siebziger Jahre st&auml;rkt die abgeschottete Binnenwelt der sozial ganz unrepr&auml;sentativ zusammengesetzten Funktion&auml;rsschicht. Hier f&uuml;hren dann politisch dilettierende Studienr&auml;te das gro&szlig;e Wort. Der Kanzlerwahlverein hingegen wendet sich an die W&auml;hler. Seine politische Kompetenz bezieht er aus der Professionalit&auml;t von Machtzentrale und Fraktion. Es ist noch sehr die Frage, welchem Parteitypus die Zukunft geh&ouml;rt.<p>

Nat&uuml;rlich, zum Kanzlerwahlverein alten Schlages hat sich die CDU Helmut Kohls auch in den neunziger Jahren nicht zur&uuml;ckgebildet. Auf Parteitagen hat es Kohl keineswegs so leicht wie einst Adenauer. Aber auf CDU-Parteitagen wird ein christdemokratischer Kanzler auch nicht besch&auml;digt oder gar demontiert, jedenfalls so lange nicht, wie er bei den W&auml;hlern ankommt. Sozialdemokratische Parteitage m&ouml;gen lebendiger, spannender, von h&ouml;herer inhaltlicher Substanz sein. Aber gerade deshalb machen sie den Kanzlern und Kanzlerkandidaten der SPD das Leben schwer. Helmut Schmidt ist vielleicht nicht zuerst, aber sicher auch nicht zuletzt an den Delegierten seiner eigenen Partei gescheitert.<p>

Das Verh&auml;ltnis der SPD zur Macht ist zutiefst ambivalent. Einerseits mi&szlig;trauen die Sozialdemokraten traditionell der Macht in der "b&uuml;rgerlichen Gesellschaft" und empfinden Opposition als die eigentliche Aufgabe einer Linkspartei. Andererseits aber richten sie &uuml;bersteigerte Erwartungen an die Macht und erzeugen dadurch regelm&auml;&szlig;ig bittere Entt&auml;uschungen. Die CDU ist frei von solchen Neurosen. Sie strebt nach der Macht, das ist Antrieb und Ziel ihrer Politik. Aber sie will damit nicht die Welt ver&auml;ndern.<p>

Christdemokraten nutzen die Macht und betreiben handfest Patronage. Und ihre Kanzler haben lange ohne Skrupel ihre Klientel rundumversorgt. Besonders Adenauer war darin ein Meister. Er, und nicht ein Sozialdemokrat, hat die wohlfahrtsstaatliche &Uuml;berversorgung in der Bundesrepublik in der zweiten H&auml;lfte der f&uuml;nfziger Jahre auf den Weg gebracht. Um die finanziellen Belastungen hat er sich nicht geschert. Die &uuml;brigen christdemokratischen Kanzler hielten es ebenso: Auch der Sparrhetoriker Ludwig Erhard machte da 1965 als Kanzler keine Ausnahme. Sie alle wollten schlie&szlig;lich Wahlen gewinnen. Und im &uuml;brigen funktionierte die christdemokratische Propagandamaschinerie pr&auml;chtig, die alle Annehmlichkeiten der Republik dem Konto der Union gutschrieb, f&uuml;r die finanzpolitischen Probleme, die daraus folgten, aber die "Sozialisten" verantwortlich machte. Das war alles andere als gerecht, aber bis jetzt immer noch h&ouml;chst wirksam.<p>

Erfolgsmodell CDU also? Ganz so einfach ist es nicht. Auch die CDU schleppt eine Menge Probleme mit sich herum, die sie irgendwann um die Regierungsf&auml;higkeit im Bund bringen k&ouml;nnten: der eklatante Machtzerfall in den L&auml;ndern seit Mitte der achtziger Jahre; die erschreckende &Uuml;beralterung der Mitgliedschaft; das rasante Abschmelzen der Stammw&auml;hler; die trostlose Versammlungskultur in den siechen Ortsverb&auml;nden; die geringe Zahl herausragender K&ouml;pfe in der h&ouml;chst mittelm&auml;&szlig;igen Bundestagsfraktion. Die Mehrheit des b&uuml;rgerlichen Lagers im Bund ist denkbar gering. Fraglich auch, ob die von den Medien gep&auml;ppelten Landes- und Landtagsfraktionsvorsitzenden der CDU wirklich das Zeug zur F&uuml;hrung besitzen. H&auml;ufig genug erw&auml;chst aus den L&auml;ndern keine bundespolitische Kraft, sondern eher die Provinzialisierung einer Partei. Die SPD hat daf&uuml;r ein abschreckendes Beispiel gegeben.<p>

Keine Frage: Die Grundlagen der CDU sind in den letzten Jahren ganz sch&ouml;n m&uuml;rbe geworden. Und so meint mancher, das christdemokratische Geb&auml;ude werde nur noch von Helmut Kohl zusammengehalten, mit dem Ende der &Auml;ra Kohl werde der ganze Laden auseinanderfliegen. Aber mit solchen Prognosen liegt man schnell falsch. Die CDU ist nach dem Abgang Adenauers nicht zusammengebrochen; die CSU hat den Tod von Franz Josef Strau&szlig; verkraftet. Auch die CDU ist heute ziemlich fest in den Strukturen, Institutionen und vor allem Mentalit&auml;ten der Republik verwurzelt. Daraus zieht sie in Krisenzeiten immer wieder regenerierende Kraft. Der "Kanzlerwahlverein" kann durchaus ein Zukunftsmodell sein. Aber er kann auch ins Desaster f&uuml;hren. Denn der "Kanzlerwahlverein" braucht einen starken Kanzler. Mit einem schwachen Regierungschef oder gar in der Opposition funktioniert er nicht. So k&ouml;nnte sich r&auml;chen, da&szlig; der "Kanzlerwahlverein" CDU die Parteistrukturen vernachl&auml;ssigt hat. Das war das Problem der CDU nach 1966, das kann ihr auch nach Kohl wieder bl&uuml;hen.<p>

Schwierigkeiten wird der CDU auch noch ihre schwache Repr&auml;sentanz und Resonanz in der Altersgruppe der Drei&szlig;ig- bis F&uuml;nfzigj&auml;hrigen machen. Sie ist am wenigsten ausges&ouml;hnt mit dem Stil Helmut Kohls und seiner CDU. Und sie ist am st&auml;rksten vom sozialliberalen Zeitgeist der siebziger Jahre gepr&auml;gt und erwartet mehr von der Politik als nur Schlitzohrigkeit, Dickfelligkeit und Proporz. Diese Generation will scharfe Problemanalysen und Konzepte.<p>

Der CDU war das nie wichtig. Sie kann es sich aber jetzt nicht mehr leisten, diese Gruppe als versprengte Truppen des 68er-Geistes zu mi&szlig;achten und sich allein auf die treuen Rentner und neuerdings die ganz Jungen zu verlassen. Vor allem die Drei&szlig;ig- bis F&uuml;nfzigj&auml;hrigen m&uuml;ssen den schwierigen sozialen und &ouml;konomischen Wandel in den n&auml;chsten Jahren aushalten, mitvollziehen und gestalten. Sie wollen politisch &uuml;berzeugt werden, wollen die Richtung kennen, &uuml;ber Zusammenh&auml;nge und Folgen Bescheid wissen, dar&uuml;ber mitentscheiden. Politik als Projekt - daran h&auml;lt ein gro&szlig;er Teil dieser Gruppe bis hinein in die b&uuml;rgerlichen Eliten fest. Auch hier h&auml;ufen sich die Klagen &uuml;ber die Unstimmigkeit, Kurzatmigkeit, konzeptionelle D&uuml;rre und geringe Durchsetzungskraft der Regierungspolitik.<p>

W&auml;re die Opposition frisch und geistig auf dem Posten, dann h&auml;tte die CDU jetzt einen schweren Stand. Denn der aktive Kern des bundesdeutschen Mittelalters ordnet sich bereits diesseits des altb&uuml;rgerlichen Lagers ein. Doch diese diffuse Majorit&auml;t b&uuml;ndelt sich noch nicht zur politischen Alternative. Denn weder Rote noch Gr&uuml;ne haben, ob f&uuml;r sich oder gemeinsam, plausible Antworten auf die zentralen politischen Fragen der Gesellschaft.<p>

Hier wie dort also: Politik als "muddling through". Diese Disziplin aber beherrscht niemand so virtuos wie der Kanzler mit seiner Partei. Solange das einer Mehrheit der Bundesdeutschen gen&uuml;gt, wird die CDU die Nase vorn behalten.<p>

<b> Franz Walter lehrt Politologie an der Universit&auml;t G&ouml;ttingen.</b><p>

(c) DIE ZEIT, Ausgabe Nr. 43 vom 18.10.1996<p>

<center>

<hr noshade>
</center>
<CENTER>
<a href="../index.html">Zur&uuml;ck zur Homepage</A>
<hr>
<font size=-2>
(c) beim Autor/DIE ZEIT. All rights reserved
</font>
</CENTER>
</ul>
</body>
</html>
