<html><head>
<title>Conception et Architecture des Syst&egrave;mes Informatiques
</title>
<!-- Changed by: Enregistrement Theses, 13-Jun-1996 -->

</head>
<body BGCOLOR="#ffffff" LINK="#7070ff" VLINK="#7070ff">
<a href="master.html"><img src="icone/graduate.gif" align=left border=0></a>
<a name="top"></a><H2 align=center>Mast&egrave;re Sp&eacute;cialis&eacute; : Conception et Architecture des Syst&egrave;mes Informatiques</H2>

<center>Responsable  <a href="mailto:finger@inf.enst.fr">Ulrich FINGER</a>
D&eacute;partement <a href="http://www-inf.enst.fr/">Informatique</a></center><br>
<IMG src="../../gif/lignes/vertj.gif"><br>
<p>

<H3><img src="../../gif/greenball.gif" border=0> Domaine et objectifs</H3>

<P>Le d&eacute;veloppement fulgurant des machines informatique a 
cr&eacute;&eacute; une dynamique en architecture des syst&egrave;mes.
La concurrence entre constructeurs, les jeux d'alliance, les tentatives 
de normalisation, le d&eacute;bat sans fin autour du choix d'un syst&egrave;me 
d'exploitation (UNIX, OS/2, VMS, Chorus, ...), montrent l'importance de l'enjeu :
 il faut ma&icirc;triser les technologies n&eacute;cessaires &agrave; la 
 prochaine g&eacute;n&eacute;ration de syst&egrave;mes. Cette finalit&eacute; 
 industrielle ne se r&eacute;alise pourtant pas au d&eacute;pend d'une recherche 
 fondamentale active et diverse autour des syst&egrave;mes massivement 
 parall&egrave;les, des syst&egrave;mes d'exploitation r&eacute;partis, etc.<p>

Le Mast&egrave;re CASI est destin&eacute;e &agrave; des &eacute;l&egrave;ves 
qui veulent se sp&eacute;cialiser dans la conception et l'expertise des 
syst&egrave;mes informatiques et des r&eacute;seaux. Le programme aborde les 
<b>domaines de l'architecture mat&eacute;rielle</b> ainsi que les <b>techniques 
de compilation qui influencent de plus en plus la conception des architectures</b>. 
L'&eacute;tude compl&eacute;mentaire des syst&egrave;mes d'exploitation permet 
au futur ing&eacute;nieur de s'orienter vers la ma&icirc;trise de l'architecture 
d'un syst&egrave;me informatique (mat&eacute;riel ou logiciel).
<p>

<H3><img src="../../gif/greenball.gif" border=0> Contenu de l'enseignement</H3>

<P><b>Enseignements de base</b><p>
La premi&egrave;re p&eacute;riode est constitu&eacute;e d'une mise &agrave; 
niveau et de modules sp&eacute;cifiques. La mise &agrave; niveau porte sur les 
th&egrave;mes suivants : architecture, syst&egrave;me d'exploitation, 
r&eacute;seaux et bases de donn&eacute;es. Cet enseignement sera 
compl&eacute;t&eacute; par d'autres modules choisis parmi ceux de cette 
p&eacute;riode.<br>

<P><b>Enseignements de sp&eacute;cialisation</b><br>

Les modules propos&eacute;s durant cette p&eacute;riode se r&eacute;partissent 
en trois cat&eacute;gories :<ul>

<P><li> Les modules obligatoires
Les enseignements de sp&eacute;cialisation obligatoires pour tous les 
&eacute;l&egrave;ves du Mast&egrave;re :

<P>- ARC : Architecture des syst&egrave;mes informatiques: 3UV
<br>	Le module ARC introduit les concepts de bases de l'architecture de syst&egrave;mes informatiques 
et donne quelques &eacute;l&eacute;ments de r&eacute;f&eacute;rence sur le potentiel 
des technologies aujourd'hui disponibles.
	Il approfondit la connaissance en architecture d'ordinateurs et donne un aper&ccedil;u sur 
	les d&eacute;veloppements r&eacute;cents dans ce domaine : m&eacute;moires caches, unit&eacute; de 
	gestion de la m&eacute;moire, multiprocesseurs et leurs interconnexions, compilateurs et leur optimisation, 
	entr&eacute;es/sorties rapides dans une architecture, syst&egrave;mes tol&eacute;rants aux pannes, machines 
	superscalaires, &eacute;volution des architectures.
<br>- SEA : Syst&egrave;mes d'exploitation avanc&eacute;s : 3UV<br>
L'architecture logicielle que l'on englobe sous le terme syst&egrave;me d'exploitation est 
trait&eacute;e dans le module SEA. Le syst&egrave;me utilis&eacute; en travaux pratiques est Chorus, 
mais une large place est faite aux syst&egrave;mes &agrave; l'&eacute;tude dans les centres de recherche 
ou dans des universit&eacute;s.


<P><li> Les modules que l'on doit choisir parmi une liste restreinte<br>
Une fois les bases acquises, l'&eacute;l&egrave;ve peut choisir entre quatre voies d'approfondissement :
<br>- R&eacute;seaux
<br>	- S&eacute;curit&eacute; 
<br>	- Langages et syst&egrave;mes
<br>	- &Eacute;lectronique</ul>

<P>	Avec l'accord du responsable de Mast&egrave;re, toute combinaison entre les modules des quatre voies 
d'approfondissement est envisageable.<p>

<center><a href="#top"><img src="icone/graduate.gif" border=0></a></center>
<IMG src="../../gif/lignes/vertj.gif"><br>
<P align=center>
<a href="../../index.html"><img src="../../menu/homepage.gif" border=0></a>
<a href="../../ecole.html"><IMG SRC="../../menu/mecole.gif"border=0></a>
<a href="../../formation.html"><IMG SRC="../../menu/mformation.gif"border=0></a>
<a href="../../recherche.html"><IMG SRC="../../menu/mrech.gif"border=0></a>
<a href="../../actu.html"><IMG SRC="../../menu/mactu.gif"border=0></a>
<a href="../../indexx.html"><IMG SRC="../../menu/mindex.gif"border=0></a>
<a href="../../serveur.html"><img src="../../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../../menu/meleves.gif"border=0></a>
<br>
<font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center></font>
</P>
</body> </html>
