<html><head>
<title> Dispositifs  et Techniques de communications
</title>
<!-- Changed by: Enregistrement Theses, 13-Jun-1996 -->
</head>
<body BGCOLOR="#ffffff" LINK="#7070ff" VLINK="#7070ff">
<a href="master.html"><img src="icone/graduate.gif" align=left border=0></a>
<a name="top"></a><H2 align=center> Mast&egrave;re Sp&eacute;cialis&eacute; : Dispositifs  et Techniques de communications</H2>

<center>Responsable  <a href="mailto:erasme@com.enst.fr">Didier Erasme</a>
, D&eacute;partement <a href="../../dept/com.html">Communication</a>
<P></center>
<IMG src="../../gif/lignes/vertj.gif"><br>
<p>

<H3><img src="../../gif/greenball.gif" border=0> Domaine et objectifs</H3>

<P>Les syst&egrave;mes micro-ondes (faisceaux hertziens, liaisons satellites, 
liaisons avec les mobiles, ...) et les syst&egrave;mes opto&eacute;lectroniques 
(liaisons par fibres, r&eacute;seaux de vid&eacute;ocommunications, liaisons 
optiques spatiales, ...) se partagent aujourd'hui l'essentiel du trafic des 
t&eacute;l&eacute;communications professionnelles et grand public. Dans le 
m&ecirc;me temps, les techniques de transmission (modulation, codage, 
d&eacute;tection, &eacute;galisation, synchronisation) et les composants et 
dispositifs (opto&eacute;lectroniques et micro-ondes) voient s'&eacute;tendre 
leur champ d'application &agrave; d'autres domaines comme par exemple 
l'enregistrement magn&eacute;tique, le radar, les m&eacute;moires et disques 
optiques, les senseurs, la m&eacute;trologie, l'instrumentation.

<P>Le Mast&egrave;re DTC s'adresse aux personnes d&eacute;sireuses de <b>comprendre 
les m&eacute;canismes fondamentaux des communications</b> et de <b>ma&icirc;triser les 
principes des composants, des fonctions et des techniques 
opto&eacute;lectroniques et micro-ondes</b> et leur mise en oeuvre dans les 
syst&egrave;mes de t&eacute;l&eacute;communications au sens large. Elle 
concerne aussi bien le futur ing&eacute;nieur de conception et de 
d&eacute;veloppement des nouveaux syst&egrave;mes de transmission que celui 
qui utilisera les m&ecirc;mes composants et les m&ecirc;mes techniques dans 
leurs tr&egrave;s nombreuses applications actuelles et &agrave; venir.<p>

<h3><img src="../../gif/greenball.gif" border=0> Le cursus</h3>
<P>Le Mast&egrave;re se d&eacute;roule sur une p&eacute;riode de douze mois, 
partag&eacute;s entre:<br>
- <b>un ensemble d'enseignements</a></b> traitant des 
 diff&eacute;rents th&egrave;mes du domaine des communications <br> 
- <b>un travail pratique personnel</a> de type 
"recherche et d&eacute;veloppement"</b> correspondant &agrave; 
l'&eacute;quivalent de 6 mois de travail &agrave; plein temps.<p>


<a href="DTCens.html"><H3><img src="../../gif/greenball.gif" border=0>  
Contenu de l'enseignement</H3></a>

<h3><img src="../../gif/greenball.gif" border=0> Th&egrave;se professionnelle</h3>

Parall&egrave;lement aux enseignements, chaque &eacute;l&egrave;ve se voit confier, 
vers le d&eacute;but du mois de d&eacute;cembre, un travail d'ing&eacute;nieur dans 
les laboratoires d'opto&eacute;lectronique, de micro-ondes ou de communications de 
l'ENST. Le sujet de cette th&egrave;se doit &ecirc;tre en harmonie avec l'orientation
 choisie.  Ce travail personnel peut s'effectuer en liaison avec l'industrie et 
 pr&eacute;sente le plus souvent une forte coloration exp&eacute;rimentale comme en 
 attestent ces quelques exemples de sujets repr&eacute;sentatifs du domaine 
 r&eacute;cemment propos&eacute;s :


<P>	- Effets non lin&eacute;aires et amplification dans les fibres optiques, 
	<br>- &Eacute;tude technico-&eacute;conomique des syst&egrave;mes optiques coh&eacute;rents,
	<br>- &Eacute;tude d'antenne r&eacute;seau pour les t&eacute;l&eacute;communications par satellite, 
	<br>- Dispositifs quasi-optiques pour r&eacute;cepteur sub-millim&eacute;trique, 
	<br>- &Eacute;tude de la sensibilit&eacute; des codages d'image aux erreurs de transmission,
	<br>- R&eacute;alisation d'un codeur-d&eacute;codeur convolutionnel param&eacute;trable,
	<br>- &Eacute;galisation pour enregistrement magn&eacute;tique haut-d&eacute;bit,
	<br>- R&eacute;alisation enti&egrave;rement num&eacute;rique d'un modem MAQ.

<P>Ce travail se termine par une soutenance devant un jury constitu&eacute; de 
professeurs de TELECOM Paris, d'ing&eacute;nieurs et de chercheurs des laboratoires 
industriels et publics concern&eacute;s par le domaine.<p>



<center><a href="#top"><img src="icone/graduate.gif" border=0></a></center>
<IMG src="../../gif/lignes/vertj.gif"><br>
<P align=center>
<a href="../../index.html"><img src="../../menu/homepage.gif" border=0></a>
<a href="../../ecole.html"><IMG SRC="../../menu/mecole.gif"border=0></a>
<a href="../../formation.html"><IMG SRC="../../menu/mformation.gif"border=0></a>
<a href="../../recherche.html"><IMG SRC="../../menu/mrech.gif"border=0></a>
<a href="../../actu.html"><IMG SRC="../../menu/mactu.gif"border=0></a>
<a href="../../indexx.html"><IMG SRC="../../menu/mindex.gif"border=0></a>
<a href="../../serveur.html"><img src="../../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../../menu/meleves.gif"border=0></a>
<br>
<font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center></font>
</P>
</body> </html>
