<html><head>
<title> Mast&egrave;re sp&eacute;cialis&eacute; en
Multim&eacute;dia-Hyperm&eacute;dia
</title>
<!-- Changed by: Christine Potier,  9-May-1996 -->
<!-- Changed by: Enregistrement Theses, 13-Jun-1996 -->

</head>
<body BGCOLOR="#ffffff" LINK="#7070ff" VLINK="#7070ff">
<a href="master.html"><img src="icone/graduate.gif" align=left border=0></a>
<a name="top"></a><H2 align=center>Mast&egrave;re sp&eacute;cialis&eacute; en
Multim&eacute;dia-Hyperm&eacute;dia</H2>

<center>Responsable : <a href="mailto:potier@inf.enst.fr"> Christine POTIER </a>
</center><p>

<IMG src="../../gif/lignes/vertj.gif"><br>
<br>
<H3><img src="../../gif/greenball.gif"> Pour une <A
	  HREF="http://masteremh.rever.fr/index.htm">visite
	  d&eacute;taill&eacute;e</A>
<br>
<IMG src="../../gif/lignes/vertj.gif"><br>
<p>

<H3><img src="../../gif/greenball.gif">Domaine et objectifs du Mast&egrave;re</H3>

<P>Le d&eacute;veloppement rapide des techniques de num&eacute;risation, les 
progr&egrave;s ininterrompus dans le domaine du stockage de donn&eacute;es sur 
support optique, la perspective de la mise en r&eacute;seau &eacute;lectronique 
g&eacute;n&eacute;ralis&eacute;e des soci&eacute;t&eacute;s donnent naissance 
&agrave; une industrie et &agrave; une culture nouvelles.
<P>Les besoins du march&eacute; n&eacute; de ces nouvelles technologies sont de 
deux types : 
<ul>
<li>	des sp&eacute;cialistes capables de ma&icirc;triser l'ensemble du processus de production : ce sp&eacute;cialiste multim&eacute;dia-hyperm&eacute;dia doit pouvoir concevoir un projet multim&eacute;dia, r&eacute;unir et diriger l'&eacute;quipe de production dans l'enveloppe budg&eacute;taire et le calendrier fix&eacute;s.
<li>	des auteurs : les produits multim&eacute;dia-hyperm&eacute;dia 
n'existeront pas sans contenu. Il importe de donner les moyens &agrave; des 
auteurs de r&eacute;aliser des produits et d'inventer une nouvelle 
&eacute;criture pour ce type de m&eacute;dia.</ul>

<P>Le contenu de la formation prend en compte ces besoins et a pour but de 
former des auteurs-r&eacute;alisateurs, chefs de projets et chefs de produits, 
ayant &agrave; la fois une grande culture g&eacute;n&eacute;rale, un sens 
artistique et capables de ma&icirc;triser les aspects techniques et 
&eacute;conomiques d'une production multim&eacute;dia.

<p><H3><img src="../../gif/greenball.gif">Partenaires du Mast&egrave;re</H3>
<P>L'originalit&eacute; de cette formation r&eacute;side dans la 
mise en commun de comp&eacute;tences diverses et de 
savoir-faire diff&eacute;rents 
que repr&eacute;sentent les diverses &eacute;coles associ&eacute;es dans ce 
projet (le <a href="http://www.cdi.fr/home.html">coll&egrave;ge des
	  ing&eacute;nieurs</A>, le groupement des &eacute;coles des T&eacute;l&eacute;communications, 
l'&eacute;cole nationale sup&eacute;rieure des Beaux-Arts) ainsi que 
l'exp&eacute;rience et la connaissance du march&eacute; par les industriels 
concern&eacute;s (Apple Computer France, Hewlett Packard, Matra Hachette 
Multim&eacute;dia, Philips Interactive Media France, la r&eacute;union des 
mus&eacute;es nationaux).

<p><H3><img src="../../gif/greenball.gif"><a href="#ens">
Contenu de l'enseignement</a></h3>

- Culture g&eacute;n&eacute;rale<br>
- Pens&eacute;e hyperm&eacute;dia<br>
- Lectures critiques<br>
- Ing&eacute;nierie<br>
- Gestion et management<br>
- Ateliers de pratique<br>
L'atelier est accessible 24 heures sur 24.

<p><h3><img src="../../gif/greenball.gif">
Th&egrave;se professionnelle</h3>
<P>A l'issue des 7 mois de cours, l'&eacute;l&egrave;ve entreprend, pour une 
dur&eacute;e de 4 mois sa th&egrave;se professionnelle. Ce travail consiste 
dans l'&eacute;laboration d'une maquette de d&eacute;monstration dans des 
conditions similaires &agrave; celles de la vie professionnelle (prise en 
compte des d&eacute;lais, des co&ucirc;ts, des demandes r&eacute;elles des 
experts et des entreprises...).
La pr&eacute;sentation de la maquette (soutenance de la th&egrave;se 
professionnelle) tient lieu d'examen final. Un contr&ocirc;le continu 
est assur&eacute; pour chaque module.<p>



<p><H3><img src="../../gif/greenball.gif">Niveau de recrutement</h3>

<P>Le Mast&egrave;re multim&eacute;dia-hyperm&eacute;dia s'adresse &agrave; des dipl&ocirc;m&eacute;s de l'enseignement sup&eacute;rieur, de toutes disciplines (scientifiques, litt&eacute;raires, artistiques, commerciales, etc.), ayant fait leurs &eacute;tudes dans l'un des pays membres de l'Union europ&eacute;enne.
Ils sont recrut&eacute;s au niveau du 3e cycle (bac+5) ou &eacute;quivalent, doivent poss&eacute;der une culture g&eacute;n&eacute;rale et transversale, et &ecirc;tre d&eacute;j&agrave; bien familiaris&eacute;s avec l'ordinateur, sans &ecirc;tre n&eacute;cessairement des sp&eacute;cialistes de l'informatique.
Ils peuvent soit poursuivre un cycle d'&eacute;tudes, soit &ecirc;tre d&eacute;j&agrave; engag&eacute;s dans la vie professionnelle.


<IMG src="../../gif/lignes/vertj.gif"><br>

<P align=center>
<a href="../../index.html"><img src="../../menu/homepage.gif" border=0></a>
<a href="../../ecole.html"><IMG SRC="../../menu/mecole.gif"border=0></a>
<a href="../../formation.html"><IMG SRC="../../menu/mformation.gif"border=0></a>
<a href="../../recherche.html"><IMG SRC="../../menu/mrech.gif"border=0></a>
<a href="../../actu.html"><IMG SRC="../../menu/mactu.gif"border=0></a>
<a href="../../indexx.html"><IMG SRC="../../menu/mindex.gif"border=0></a>
<a href="../../serveur.html"><img src="../../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../../menu/meleves.gif"border=0></a><br>
<font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center></font><p>
<IMG src="../../gif/lignes/vertj.gif"><br>


<a name="ens"></a><P><h3>Contenu de l'enseignement</h3>
- Culture g&eacute;n&eacute;rale<br>
R&eacute;flexion sur la cr&eacute;ation contemporaine litt&eacute;raire, artistique, musicale ;<br>
concepts de la communication ;<br>
logique. <br>
Dur&eacute;e annuelle : 112 heures.


<P>- Pens&eacute;e hyperm&eacute;dia
Historique ; <br>principaux auteurs ;<br>
enjeux de la r&eacute;volution de la connaissance ;<br>
outils intellectuels (th&eacute;ories des syst&egrave;mes, s&eacute;mantique 
g&eacute;n&eacute;rale, sciences cognitives, intelligence artificielle) ;<br>
approche &agrave; partir des jeux.<br>
Dur&eacute;e annuelle : 112 heures.


<P>- Lectures critiques
Analyse critique d'oeuvres multim&eacute;dia existant sur le march&eacute; ;<br>
par ce biais sont &eacute;tudi&eacute;s les diff&eacute;rents &eacute;l&eacute;ments des 
langages des m&eacute;dias et leurs r&egrave;gles fondamentales : le sc&eacute;nario, le film, 
la vid&eacute;o, le graphisme, la photo...<br>
Des cr&eacute;ateurs et des techniciens des domaines consid&eacute;r&eacute;s sont associ&eacute;s 
&agrave; des artistes pour donner des &eacute;clairages diff&eacute;rents sur les oeuvres.<br>
Dur&eacute;e annuelle : 112 heures.


<P>- Ing&eacute;nierie
Notions de base en informatique et t&eacute;l&eacute;communications ; <br>
interactions homme-machine ( interaction, communication, les entr&eacute;es-sorties, ergonomie, 
mod&egrave;les de connaissance et de repr&eacute;sentation, conception, analyse) ; <br>
techniques multim&eacute;dia.<br>
Dur&eacute;e annuelle : 112 heures.<br>


<P>- Gestion et management
Marketing ;<br>
strat&eacute;gie ;<br>
management de projets et de processus ;<br>
notions financi&egrave;res ;<br>
march&eacute; et production multim&eacute;dia ;<br>
gestion d'un projet multim&eacute;dia ;<br>
&eacute;volution des outils ;<br>
propri&eacute;t&eacute; intellectuelle et droits.<br>
Dur&eacute;e annuelle : 112 heures.<br>


<P>- Ateliers de pratique<br>
Travaux dirig&eacute;s ayant pour objet l'initiation aux syst&egrave;mes d'exploitation et leur extension multim&eacute;dia, aux principaux outils logiciels multim&eacute;dia ainsi qu'une approche des techniques audiovisuelles.
Dur&eacute;e annuelle : environ 400 heures.
LÕatelier est accessible 24 heures sur 24.
Chacun des modules d'enseignement th&eacute;orique est constitu&eacute; de 2 cr&eacute;dits de 2 heures par semaine, c'est &agrave; dire, 20 heures par semaine et 112 heures annuelles. Le module &quot;Ateliers pratiques&quot; repr&eacute;sente 3 heures par jour, c'est &agrave; dire environ 400 heures annuelles. Les cours ont lieu, dans la mesure du possible, chaque matin.
La charge horaire annuelle globale est d'environ 1000 heures
Des conf&eacute;rences sont r&eacute;guli&egrave;rement organis&eacute;es en plus des cours.<p>

<center><a href="#master"><img src="icone/graduate.gif" border=0></a></center>
<IMG src="../../gif/lignes/vertj.gif"><br>
<P align=center>
<a href="../../index.html"><img src="../../menu/homepage.gif" border=0></a>
<a href="../../ecole.html"><IMG SRC="../../menu/mecole.gif"border=0></a>
<a href="../../formation.html"><IMG SRC="../../menu/mformation.gif"border=0></a>
<a href="../../recherche.html"><IMG SRC="../../menu/mrech.gif"border=0></a>
<a href="../../actu.html"><IMG SRC="../../menu/mactu.gif"border=0></a>
<a href="../../indexx.html"><IMG SRC="../../menu/mindex.gif"border=0></a>
<a href="../../serveur.html"><img src="../../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../../menu/meleves.gif"border=0></a>
<font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center>

</font></P>

