<html><head>
<title> S&eacute;curit&eacute; des Syst&egrave;mes Informatiques et des R&eacute;seaux
</title>
<!-- Changed by: Enregistrement Theses, 13-Jun-1996 -->

</head>
<body BGCOLOR="#ffffff" LINK="#7070ff" VLINK="#7070ff">

<a href="master.html"><img src="icone/graduate.gif" align=left border=0></a><center>
<a name="top"></a><H2 align=center>Mast&egrave;re Sp&eacute;cialis&eacute; en S&eacute;curit&eacute; des Syst&egrave;mes Informatiques et des R&eacute;seaux</H2>

Responsable : <a href="mailto:dupuy@inf.enst.fr">Michel DUPUY</a> , 
D&eacute;partement <a href="inf.html">Informatique</a></center><p>
<IMG src="../../gif/lignes/vertj.gif"><br>
<p>

<h3><img src="../../gif/greenball.gif" border=0> Domaine</H3>
Ce Mast&egrave;re est destin&eacute; &agrave; des ing&eacute;nieurs en 
informatique qui d&eacute;sirent devenir des sp&eacute;cialistes de haut 
niveau en s&eacute;curit&eacute; des syst&egrave;mes d'information.

<P>Il a &eacute;t&eacute; cr&eacute;&eacute; en 1990 pour r&eacute;pondre aux 
fortes demandes du march&eacute; de l'emploi en :

<P>-	Responsable S&eacute;curit&eacute; Informatique<br>
-	Auditeurs de S&eacute;curit&eacute; Informatique<br>
-	Ing&eacute;nieurs d'&eacute;tudes (conception, r&eacute;alisation, mise 
en place) de syst&egrave;mes sp&eacute;cifiques (logiciels, mat&eacute;riels, 
architectures) dans le secteur des services<br>
-	Chefs de projets<br>
-	Ing&eacute;nieurs de Recherche et D&eacute;veloppement<br>
-	Chercheurs<br>
-	Enseignants

<P>L'organisation du programme permet d'associer des enseignements 
th&eacute;oriques et concrets, avec un accent particulier sur les technologies 
en cours d'&eacute;mergence (UNIX s&eacute;curis&eacute;,  projets de la 
CEE, ...) et une &eacute;troite collaboration avec le secteur de l'industrie.

<P>Le programme est principalement orient&eacute; vers les applications dans le 
domaine des t&eacute;l&eacute;communications. Les services de FRANCE TELECOM 
concern&eacute;s par la s&eacute;curit&eacute; coop&egrave;rent 
&eacute;troitement avec le direction du Mast&egrave;re aussi bien pour la 
d&eacute;finition du programme que pour certaines conf&eacute;rences et 
&eacute;tudes de cas.

<P>A part quelques rappels, les notions de base de l'informatique sont 
suppos&eacute;es connues.


<a href="SSIRens.html"><h3><img src="../../gif/greenball.gif" border=0> Organisation et contenu de l'enseignement</h3></a>

<ul><li><b> Octobre &agrave; d&eacute;cembre : enseignements (plein temps)</b><br>
L'enseignement dispens&eacute; pendant cette premi&egrave;re p&eacute;riode est 
constitu&eacute; d'une harmonisation des connaissances et d'un enseignement de base. 
L'harmonisation des connaissances porte sur les th&egrave;mes suivants : architecture, 
syst&egrave;mes d'exploitation, r&eacute;seaux et bases de donn&eacute;es.

<P>L'enseignement de base est constitu&eacute; des <a href="SSIRens.html#base">modules 
suivants</a>. 

<P><li><b> Janvier &agrave; juin : enseignements (2/3 de temps)</b><br>
- <a href="SSIRens.html#obl">Les modules obligatoires</a>.<br>
- <a href="SSIRens.html#choi">Les modules au choix</a>
</ul>
<P>
<h3><img src="../../gif/greenball.gif" border=0> Th&egrave;se professionnelle</h3></a>

<li> Janvier &agrave; juin : Th&egrave;se professionnelle (1/3 de temps)
<P><li> Juillet &agrave; septembre : Th&egrave;se professionnelle (&agrave; plein temps)
<p><li><b>Quelques exemples de th&egrave;ses professionnelles</b>

<P>L'enseignement est compl&eacute;t&eacute; par un travail personnel effectu&eacute;, 
le plus souvent,  au sein de l'E.N.S.T. Ce travail de type recherche &amp; d&eacute;veloppement est d&eacute;fini et contr&ocirc;l&eacute; par un enseignant-chercheur du D&eacute;partement Informatique (en liaison &eacute;ventuelle avec un industriel).
On trouvera ci-dessous, &agrave; titre d'exemples, quelques sujets de Th&egrave;se professionnelle r&eacute;alis&eacute;s par les &eacute;tudiants des ann&eacute;es pr&eacute;c&eacute;dentes :


<P>-	Analyse de la vuln&eacute;rabilit&eacute; des syst&egrave;mes d'information au 
niveau du sch&eacute;ma directeur
<br>-	Les sp&eacute;cifications formelles
<br>-	Syst&egrave;me de surveillance dynamique d'applications
<br>-	Le zero-knowledge
<br>-	&Eacute;tude sur le contr&ocirc;le d'acc&egrave;s dans un r&eacute;seau d'interconnexion ETHERNET
<br>-	Analyse des syst&egrave;mes de s&eacute;curit&eacute; en environnements distribu&eacute;s (KERBEROS et SESAME)
<br>-	&Eacute;tude de SPX, outil d’authentification utilisant des cl&eacute;s publiques avec certificat
<br>-	Syst&egrave;mes d’authentification par carte &agrave; microcalculateur utilisables sous un syst&egrave;me UNIX
<br>-	Mise en &brkbar;uvre du protocole de signature DSS avce coupons. Application dans le paiement &eacute;lectronique
<br>-	Analyse s&eacute;curit&eacute; en environnement Client-Serveur. La m&eacute;thode ERECLIS


<center><a href="#top"><img src="icone/graduate.gif" border=0></a></center>
<IMG src="../../gif/lignes/vertj.gif"><br>
<P align=center>
<a href="../../index.html"><img src="../../menu/homepage.gif" border=0></a>
<a href="../../ecole.html"><IMG SRC="../../menu/mecole.gif"border=0></a>
<a href="../../formation.html"><IMG SRC="../../menu/mformation.gif"border=0></a>
<a href="../../recherche.html"><IMG SRC="../../menu/mrech.gif"border=0></a>
<a href="../../actu.html"><IMG SRC="../../menu/mactu.gif"border=0></a>
<a href="../../indexx.html"><IMG SRC="../../menu/mindex.gif"border=0></a>
<a href="../../serveur.html"><img src="../../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../../menu/meleves.gif"border=0></a>
<br>
<font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center>

</font></P>
</body> </html>
