<html><head><title>Hypermine: R&egrave;gles du jeu.</title></head>

<!-- Included in most of my pages -->
<body background="pictures/backgrounds/slate.gif"
text=#00ffde
link=#ffffff
alink=#ff0000
vlink=#c9c9c9>



<center>
<a href="rules.html"><img src="pictures/icons/uk.gif" border=0></a>
</center>

<br><br>

<font size=4>
<p>
Bonjour Jim.<br><br>
Votre mission, si vous d&eacute;cidez de l'accepter, consistera &agrave;
nettoyer compl&egrave;tement un champ de mines dans lequel vous allez &ecirc;tre parachut&eacute;.<br>
Le champ de mines se compose d'un tableau de 25x15 cases. Les mines sont
r&eacute;parties al&eacute;atoirement sur les cases (Je ne peux malheureusement
pas vous dire combien de mines sont pr&eacute;sentes...). Chaque case du
tableau est entour&eacute;e par 8 cases maximum, et 3 cases minimum (les
extremit&eacute;s). Chaque case non pieg&eacute;e contient un chiffre
correspondant au nombre de mines qui l'entourent (donc entre 0 et
8). Cependant, si la case n'est entour&eacute;e d'aucune mine, elle est laissee
vide (on n'affiche pas le 0).<br><br> Sur chaque case, vous avez trois actions
possibles:<br>

<ul>
  <li> <b>OUVRIR</b>, si vous pensez qu'elle n'est pas
      pieg&eacute;e. Attention, car l'ouverture d'une case pieg&eacute;e vous
      fait sauter la t&ecirc;te ! Si vous avez vu juste, la case affichera
      alors le nombre de mines alentour, ce qui vous donne des informations sur
      les cases voisines.
  <li> <b>MARQUER</b>, si vous pensez que la case est pieg&eacute;e.
  <li> <b>EFFACER</b>,si vous avez marqu&eacute; une case, mais que vous
      n'&ecirc;tes plus tr&egrave;s sur qu'elle est pieg&eacute;e. La case sera
      alors &agrave; nouveau consider&eacute;e comme non explor&eacute;e.
</ul>

<br>

Votre mission sera accomplie quand vous aurez marqu&eacute; toutes les cases
contenant une mine, et ouvert toutes les autres...<br><br>

<i>Bonne chance Jim !</i><br><br>

Cliquez <a href="../cgi-bin/hypermine.cgi">ici </a>si vous voulez jouer tout de
suite.<br>
<br>
<br>
</font>


<table>
  <tr>
    <td>
	<table border=3 cellpadding=0>
	  <tr>
	    <td><a href="../index-fr.html#choix">
		<img src="pictures/arrows/docscont.gif" alt="SOMMET" border=0>
		</a></td>
	    <td><a href="index-fr.html">
		<img src="pictures/arrows/docsupar.gif" alt="HAUT" border=0>
		</a></td>
	  </table>
      </td>
      <td><img src="pictures/icons/1katt022.gif">
<img src="pictures/icons/0katt022.gif">
<img src="pictures/icons/0katt022.gif">
<img src="pictures/icons/1katt022.gif">
</td>
    </tr>
</table>

<!-- Inclus dans la plupart de mes pages -->
<hr size=5>
<i>Page Maintenue par <a href="/~verna/index-fr.html">Didier Verna</a> &nbsp;
<a href=mailto:verna@inf.enst.fr>(verna@inf.enst.fr)</a><br>
Dernière mise à jour:



<!-- hhmts start -->
Mon Mar 10 14:35:38 MET 1997
<!-- hhmts end -->
</i>


</body></html>
