<html><head>
<title>Les relations avec l'entreprise
</title>
<!-- Changed by: Deborah Lewiner,  5-Dec-1995 -->

</head>
<body BGCOLOR="#ffffff" text="#2000aa" LINK="#000fff" VLINK="#7070ff"><font size=+1></body>


<a name="top"></a><h1 align="center"><a href="ent.html">
<img src="icone/prince.gif" align=left border=0></a>Fondation Louis Leprince-Ringuet</h1>
<img src="../gif/lignes/barre.bleu.bleu.gif"><p><br>

<p><h3><img src="../gif/blue.gif"> Cr&eacute;ation</h3>

La Fondation Louis Leprince-Ringuet a &eacute;t&eacute; cr&eacute;&eacute;e 
le 25 octobre 1988 sous l'&eacute;gide de la Fondation de France par vingt 
entreprises de grand renom, sous le patronage de Louis Leprince-Ringuet, 
membre de l'Acad&eacute;mie des Sciences.<P>

<h3><img src="../gif/blue.gif"> Les objectifs</H3>

La fondation Louis Leprince-Ringuet a pour objectif principal de contribuer 
&agrave; l'&eacute;volution et au d&eacute;veloppement de l'enseignement 
sup&eacute;rieur des t&eacute;l&eacute;communications tant au plan de la 
recherche qu'au plan de la formation. Pour ce faire, un v&eacute;ritable 
partenariat a &eacute;t&eacute; mis en place entre les &eacute;coles et les 
entreprises et grands groupes industriels du secteur des 
t&eacute;l&eacute;communications.

<P>Les actions engag&eacute;es par la fondation ont pour objet, notamment :

<ul><li> d'accro&icirc;tre la participation des entreprises &agrave; la formation ;
	<li> de promouvoir de nouveaux domaines ;
	<li> de faciliter l'ouverture internationale &agrave; la formation ;
<li> d'aider l'int&eacute;gration des &eacute;tudiants dans l'entreprise.</ul>

<b><img src="../gif/blue.gif"><a href="#exe"> Le comit&eacute; 
&eacute;x&eacute;cutif</a><p>
<img src="../gif/blue.gif"><a href="#act"> Les actions</a><p>
<img src="../gif/blue.gif"><a href="#vie"> Vie de la fondation</a><p>
<img src="../gif/blue.gif"><a href="#ecol"> Les &eacute;coles des 
t&eacute;l&eacute;communications</a><p>
<img src="../gif/blue.gif"><a href="#ctr"> Les contreparties</a><p>
<img src="../gif/blue.gif"><a href="#part"> Participation</a></b><p>



<P><img src="../gif/lignes/barre.bleu.bleu.gif">
<P align=center>
<a href="../index.html"><img src="../menu/homepage.gif" border=0></a>
<a href="../ecole.html"><IMG SRC="../menu/mecole.gif" border=0></a>
<a href="../formation.html"><IMG SRC="../menu/mformation.gif" border=0></a>
<a href="../recherche.html"><IMG SRC="../menu/mrech.gif" border=0></a>
<a href="../actu.html"><IMG SRC="../menu/mactu.gif" border=0></a>
<a href="../indexx.html"><IMG SRC="../menu/mindex.gif" border=0></a>
<a href="../serveur.html"><img src="../menu/mweb.gif" border=0></a>
<a href="http://www-stud.enst.fr/french/"><IMG SRC="../menu/meleves.gif" border=0></a>
<br><font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br>
</font></P>
<p>


<a name="exe"></a><img src="../gif/lignes/barre.bleu.bleu.gif"><p>
<h3 align=center>Le comit&eacute; &eacute;x&eacute;cutif</H3>

<li>Le comit&eacute; ex&eacute;cutif de la fondation d&eacute;cide des 
priorit&eacute;s et des actions &agrave; entreprendre, celles-ci ayant 
&eacute;t&eacute; propos&eacute;es et approuv&eacute;es par le Directeur de 
l'Enseignement Sup&eacute;rieur des T&eacute;l&eacute;communications.<p>

<li>Louis-Joseph Libois, ancien Directeur G&eacute;n&eacute;ral des 
T&eacute;l&eacute;communications et membre du Conseil des Applications de 
l'Acad&eacute;mie des Sciences (C.A.D.A.S), pr&eacute;side le comit&eacute; 
ex&eacute;cutif qui se r&eacute;unit deux fois par an.

<P><li>Le pr&eacute;sident de la Fondation de France y si&egrave;ge de droit ou 
s'y fait repr&eacute;senter, et garantit le respect des r&egrave;gles de la 
fondation.

<P><li>Le comit&eacute; ex&eacute;cutif se compose de membres de droit, de membres partenaires et de membres bienfaiteurs. Le pr&eacute;sident est assist&eacute; d' un bureau &eacute;lu, form&eacute; d'un vice-pr&eacute;sident, d'un secr&eacute;taire, et d'un tr&eacute;sorier.
<P>


<center><a href="#top"><img src="icone/prince.gif" border=0 width=35></a></center>
<a name="act"></a><img src="../gif/lignes/barre.bleu.bleu.gif"><p>
<h3 align=center>Les actions</H3>

<li>Financement de chaires d'enseignement en 1993, 1994, et 1995 : 


<P>			- r&eacute;seaux pour option r&eacute;seaux et finance
			- intelligence artificielle
			- sciences humaines 
			- t&eacute;l&eacute;com et syst&egrave;mes a&eacute;rospatiaux
			- syst&egrave;me d'information
			- droit des t&eacute;l&eacute;coms 
			- micro &eacute;lectronique
			- grands projets
			- architecture de syst&egrave;me 
			- propagation
			- syst&egrave;me expert pour les banques
			- radio-communication avec les mobiles


<P><li>	Lancement du mast&egrave;re radio-mobile (1992)


<P><li>	Projet multim&eacute;dia &quot;ERNEST&quot;(1995)<p>


<center><a href="#top"><img src="icone/prince.gif" border=0 width=35></a></center>
<a name="vie"></a><img src="../gif/lignes/barre.bleu.bleu.gif"><p>
<h3 align=center>Vie de la fondation</H3>

<P>Exemples :<br>
- une journ&eacute;e-recherche &agrave; laquelle participent les responsables des d&eacute;partements scientifiques des &eacute;coles et les directeurs scientifiques des entreprises-membres ;


<P>- des conf&eacute;rences recrutement sont organis&eacute;es avec le Bureau des &eacute;l&egrave;ves ; 


<P>- des petits-d&eacute;jeuners sur un th&egrave;me pr&eacute;cis anim&eacute;s par un professeur sabbatique;


<P>- le &quot;prix de la Fondation&quot; qui r&eacute;compense les meilleurs rapports de stage par &eacute;cole et les meilleurs m&eacute;moires de mast&egrave;res ;


<P>- parution trimestrielle d'un bulletin sur la vie des &eacute;coles.


<P><center><a href="#top"><img src="icone/prince.gif" border=0 width=35></a></center>
<a name="ecol"></a><img src="../gif/lignes/barre.bleu.bleu.gif"><p>
<h3 align=center>Les &eacute;coles des t&eacute;l&eacute;communications</h3>
<P>
L'enseignement sup&eacute;rieur des t&eacute;l&eacute;communications comprend 
trois grandes &eacute;coles; 
<li>l'Ecole Nationale Sup&eacute;rieure des T&eacute;l&eacute;communications 
situ&eacute;e &agrave; Paris, 
<br><li>l'Ecole Nationale Sup&eacute;rieure des 
T&eacute;l&eacute;communications de Bretagne &agrave; Brest avec une antenne 
&agrave; Rennes,
<br><li>l'Institut National des T&eacute;l&eacute;communications &agrave; Evry,
 qui comprend lui-m&ecirc;me une Ecole d'Ing&eacute;nieurs et une Ecole de 
 Gestion.<br>
Ces &eacute;coles sont regroup&eacute;es au sein de la Direction de l'Enseignement Sup&eacute;rieur des T&eacute;l&eacute;communications, service interne &agrave; France T&eacute;l&eacute;com.
La s&eacute;lection des &eacute;l&egrave;ves se fait soit sur concours &agrave; partir des classes pr&eacute;paratoires soit sur titres &agrave; l'issue d'une ma&icirc;trise ou d'un dipl&ocirc;me d'une grande &eacute;cole (Polytechnique, Ecole Normale Sup&eacute;rieure, etc..). Un polytechnicien sur cinq, environ, choisit chaque ann&eacute;e l'ENST comme &eacute;cole d'application.


<P>Si l'on tient compte par ailleurs de ses filiales cr&eacute;&eacute;es avec d'autres &eacute;tablissements fran&ccedil;ais ou &eacute;trangers, la Direction de l'Enseignement Sup&eacute;rieur des T&eacute;l&eacute;communications regroupe plus de 3 500 &eacute;tudiants et ses &eacute;coles d&eacute;livrent au total chaque ann&eacute;e 1 150 dipl&ocirc;mes. Le co&ucirc;t moyen de la formation par &eacute;l&egrave;ve et par an est de 138,5 KF, France T&eacute;l&eacute;com finance les &eacute;coles &agrave; 78 % et embauche 10 % des ing&eacute;nieurs dipl&ocirc;m&eacute;s.


<P>L'importance de la recherche dans ces &eacute;coles a permis d'y d&eacute;velopper en outre une formation de 3e cycle, avec de nombreux doctorats, et des mast&egrave;res accr&eacute;dit&eacute;s par la Conf&eacute;rence des Grandes Ecoles.


<P>Enfin les &eacute;coles d&eacute;veloppent des fili&egrave;res promotionnelles et une formation continue sur mesure adapt&eacute;e &agrave; la demande des entreprises comme par exemple, une session sur le panorama des r&eacute;seaux d'entreprise.


<P>

<center><a href="#top"><img src="icone/prince.gif" border=0 width=35></a></center>
<a name="ctr"></a><img src="../gif/lignes/barre.bleu.bleu.gif"><p>
<h3 align=center>Les contreparties</H3>


<P>La Fondation Louis Leprince-Ringuet s'efforce de faire b&eacute;n&eacute;ficier ses membres, en contrepartie de leur adh&eacute;sion, d'un acc&egrave;s privil&eacute;gi&eacute; &agrave; certaines informations, manifestations et instances diverses de la Direction de l'Enseignement Sup&eacute;rieur des T&eacute;l&eacute;communications (D.E.S.T.) et de ses &eacute;coles.


<P>Aux Membres bienfaiteurs :


<P>	- acc&egrave;s aux publications des &eacute;coles ;
	- acc&egrave;s privil&eacute;gi&eacute; au Forum annuel ;
	- invitation &agrave; participer &agrave; certaines manifestations organis&eacute;es par les &eacute;coles ;
	- b&eacute;n&eacute;ficier d'une image institutionnelle valoris&eacute;e au sein des &eacute;coles, de 	France Telecom, et du Minist&egrave;re des technologies, de l'information et de 	la Poste.


<P>
Aux Membres Partenaires :
 

<P>	- acc&egrave;s privil&eacute;gi&eacute; aux &eacute;tudiants pour les conf&eacute;rences-recrutement ;
	- participation aux Groupes de Travail, et aux Conseils de Domaine qui 	ont pour but d'associer les entreprises aux enseignements des &eacute;coles ;
	- communications conjointes Ecoles/Entreprises-Membres/Fondation ;
	- invitation &agrave; toutes les manifestations organis&eacute;es par la Fondation et les 	&eacute;coles.


<P>Aux Membres Fondateurs :


<P>les contreparties cit&eacute;es pr&eacute;c&eacute;demment, plus :
 

<P>	- proposer de nouvelles actions &agrave; entreprendre ;
	- participation de droit au Comit&eacute; &eacute;x&eacute;cutif ;
	- participation privil&eacute;gi&eacute;e aux Conseils de perfectionnement et autres 
	instances de la DEST et de ses &eacute;coles.


<P><center><a href="#top"><img src="icone/prince.gif" border=0 width=35></a></center>
<a name="part"></a><img src="../gif/lignes/barre.bleu.bleu.gif"><p>
<h3 align=center>Participation</h3>

<P>Les membres de la Fondation s'engagent &agrave; un versement annuel aupr&egrave;s de la Fondation de France pendant une p&eacute;riode de trois ans renouvelable, selon les possibilit&eacute;s suivantes :


<P>			Membres fondateurs : plus de 400 000 F


<P>			Membres partenaires : 75 000 F &agrave; 400 000 F


<P>			Membres bienfaiteurs : moins de 75 000 F


<P>Cette aide au d&eacute;veloppement de l'enseignement sup&eacute;rieur des 
t&eacute;l&eacute;communications b&eacute;n&eacute;ficie des avantages 
attribu&eacute;s aux dons &agrave; la Fondation de France : d&eacute;duction 
du b&eacute;n&eacute;fice imposable &agrave; concurrence de 3 &deg;/oo du 
chiffre d'affaires.


<P>
Vos fonds peuvent &ecirc;tre affect&eacute;s &agrave; une action 
pr&eacute;cise, pour cela il suffit de le mentionner sur la convention 
d'adh&eacute;sion qui est sign&eacute;e avec l'entreprise-membre et la 
Fondation de France.


<P>
La Fondation accepte les subventions occasionnelles d'entreprises, par 
ailleurs le versement de la taxe d'apprentissage s'effectue directement 
aupr&egrave;s des &eacute;coles sans passer par la Fondation Louis 
Leprince-Ringuet.
<P>
<center><a href="#top"><img src="icone/prince.gif" border=0 width=35></a></center>
<img src="../gif/lignes/barre.bleu.bleu.gif">
<P align=center>
<a href="../index.html"><img src="../menu/homepage.gif" border=0 alt="home"></a>
<a href="../ecole.html"><IMG SRC="../menu/mecole.gif"border=0 alt="ecole"></a>
<a href="../formation.html"><IMG SRC="../menu/mformation.gif"border=0 alt="formation"></a>
<a href="../recherche.html"><IMG SRC="../menu/mrech.gif"border=0 alt="recherche"></a>
<a href="../actu.html"><IMG SRC="../menu/mactu.gif"border=0 alt="actu"></a>
<a href="../indexx.html"><IMG SRC="../menu/mindex.gif"border=0 alt="index"></a>
<a href="../serveur.html"><img src="../menu/mweb.gif" border=0 alt="serveur"></a>
<a href="http://www-stud.enst.fr/french/">
<IMG SRC="../menu/meleves.gif"border=0 alt="eleves"></a>

<br><font size=2>Page cr&eacute;&eacute;e par Deborah LEWINER<br></center>
</font></P>
</body> </html>
