<HTML>
<HEAD>
<TITLE>Verflixt!</TITLE>
</HEAD>
<BODY>
<P>
<h1>Verflixt!</h1>
0704-deu [<a href="0704-deu.rtf">RTF</a>] - 
[<a href="../deu/0704-deu.html">auf deutsch</a>]
 [<a href="../eng/0704-eng.html">in English</a>]
 [<a href="../esp/0704-esp.html">en espa&ntilde;ol</a>]
 [<a href="../fra/0704-fra.html">en fran&ccedil;ais</a>]
 [<a href="../por/0704-por.html">em portugu&ecirc;s</a>]
 [<a href="../sve/0704-sve.html">p&aring; svenska</a>]
 (05.02.97)
<HR>
<P>
Wenn sie &uuml;ber etwas w&uuml;tend sind, sich erschrocken
haben oder sich in &auml;hnlichen Situationen befinden, dann reagieren
sich Deutsche wie Leute aus deinem Land h&auml;ufig durch <em><strong>Verw&uuml;nschungen</strong></em> und <em><strong>Fl&uuml;che</strong></em> ab. Kennst du deutsche Fl&uuml;che?
Und vor allem: wei&szlig;t du genau, unter welchen Umst&auml;nden
man sie benutzen kann?
<P>
<h4>Beispiele:</h4>
<em>Ach du meine G&uuml;te!<BR>
Mist!<BR>
Schei&szlig;e!</em>
<BR>
<BR>
<BR>
<BR>
<BR>
<P>
Noch mehr M&ouml;glichkeiten gibt es in beiden Sprachen,
um eine bestimmte Person zu beschimpfen, &uuml;ber die man sauer
ist, von der man wenig h&auml;lt oder die man loswerden will.
Aber wei&szlig;t du, wie man jemanden auf deutsch beschimpft?
Wei&szlig;t du, was man als Frau sagen kann? Oder was man nur
zu M&auml;nnern oder nur zu Frauen sagt? Oder was nur &auml;ltere
Leute noch sagen? Und was man auf keinen Fall sagen kann, ohne
den anderen schrecklich zu beleidigen?
<P>
<h4>Beispiele:</h4>
<I>Dummerchen!<BR>
Bl&ouml;de Ziege!<BR>
Arschloch!<BR>
Bei dir piept's wohl? <BR>
Geh zum Teufel!<BR>
<BR>
<BR>
<BR>
<BR>
<BR>
<BR>
<P>
Ja, es ist nicht ungef&auml;hrlich, in einer Fremdsprache
zu schimpfen. In den meisten Lehrb&uuml;chern kommen solche Ausdr&uuml;cke
auch kaum vor, und Fremdsprachenlehrer raten ihren Sch&uuml;lern
in der Regel - mit Recht! -, solche Ausdr&uuml;cke als Ausl&auml;nder
lieber zu vermeiden.
<P>
Aber wir denken trotzdem, da&szlig; ihr diese Ausdr&uuml;cke
wenigstens <em>verstehen</em> und <em>einsch&auml;tzen</em> k&ouml;nnen
sollt, wenn jemand sie zu euch oder andern sagt oder wenn ihr
sie irgendwo lest. Und anders als im normalen Deutschunterricht
habt ihr ja jetzt - in der Tandemstunde - die Gelegenheit, euch
von einem Deutschen jeden Ausdruck einschlie&szlig;lich seiner
Verwendungsm&ouml;glichkeiten genau erkl&auml;ren zu lassen.
<P><br>
<h3>Aufgaben</h3>
<ul>
<li>Frag deine Partnerin bzw. deinen Partner, unter
welchen Umst&auml;nden die folgenden Ausdr&uuml;cke gebraucht
werden. W&uuml;rde sie/er so etwas sagen? K&ouml;nntest du als
Ausl&auml;nder/in sie benutzen? Wer w&uuml;rde sie benutzen?
<P>
<em>Bengel!<BR>
Verdammter Mist!<BR>
Schei&szlig;e<BR>
Arschloch!<BR>
Bl&ouml;dmann!<BR>
Du bist verr&uuml;ckt! <BR>
Frecher Kerl!<BR>
Quatsch!<BR>
Armleuchter!<BR>
Rutsch mir den Buckel runter!<BR>
</em><BR>
<BR>
<P>
<li>Erkl&auml;rt euch gegenseitig, wie ihr in eurer
Muttersprache in den folgenden Situationen reagieren w&uuml;rdet.
Und eure Mutter? Euer Vater? Eure Geschwister? Eure Gro&szlig;eltern?
<P>
<ul>
<li><em>Als du zu deinem Wagen kommst, siehst du
wie jemand deine Antenne abbricht.<p><BR>
<P>
<li>Jemand sch&uuml;ttet dir absichtlich ein
Glas Rotwein &uuml;ber die Hose.<p><BR>
<P>
<li>Ein Mann bel&auml;stigt dich (oder deine
Freundin, wenn du ein Mann bist) mit Worten oder Taten.<BR>
</ul>
<p><br><p><br><p><br><p><br>
<LI>Schreibt je einen Dialog in beiden Sprachen,
in denen mindestens 5 Fl&uuml;che oder Schimpfw&ouml;rter vorkommen.
Beschreibt dabei genau den sozialen Kontext der Gespr&auml;chspartner
(Berufe, Grad der Freundschaft oder Vertrautheit usw.).
</UL><p><br><p><br><p><br><p><br>
</FONT>
<p><p><hr>
<center><em>&copy; Tandem Bochum–H&auml;rn&ouml;sand–Oviedo–Sheffield 1984-1994, Seminar für Sprachlehrforschung, Ruhr-Universit&auml;t, D–44780 Bochum</center></em>
</BODY>
</HTML>
