<!--This file created 3/03/97 17:17 by Claris Home Page version 2.0b1-->
<HTML>
<HEAD>
   
   <META NAME=GENERATOR CONTENT="Claris Home Page 2.0b1">
   <X-SAS-WINDOW TOP=41 BOTTOM=551 LEFT=1 RIGHT=781>
</HEAD>
<BODY background="back2.GIF">

<P><TABLE BORDER=0 CELLPADDING=1 WIDTH="100%">
   <TR>
      <TD>
         <P><B><FONT SIZE="+2">M</FONT>ont-<FONT
         SIZE="+2">M</FONT>ar&ccedil;al<FONT SIZE="+2">,
         M</FONT>anuel <FONT SIZE="+2">S</FONT>ancho e <FONT
         SIZE="+2">H</FONT>ijas S.A.<BR>
         
         <FONT SIZE="+1">P</FONT>edro <FONT
         SIZE="+1">M</FONT>u&ntilde;oz, <FONT
         SIZE="+1">G</FONT>erm&aacute;n <FONT
         SIZE="+1">E</FONT>steban</B></P>
         
         <P><B><FONT SIZE="+2">F</FONT>inca <FONT
         SIZE="+2">M</FONT>anlleu<BR>
         
         <FONT SIZE="+1">E</FONT>-08732, <FONT
         SIZE="+1">C</FONT>astellv&iacute; de la <FONT
         SIZE="+1">M</FONT>arca <FONT
         SIZE="+1">(B</FONT>arcelona<FONT SIZE="+1">)</FONT></B></P>
         
         <P><B><FONT SIZE="+2">T</FONT>el. +34.(9)3.891-8281<BR>
         
         <FONT SIZE="+2">F</FONT>ax. +34.(9)3.891-9045</B></P>
         
         <P><B>URL:
         <I><A HREF="http://www.troc.es/manuel-sancho">www.troc.es/manuel-sancho</A></I><BR>
         
         E-Mail: <A HREF="mailto:mmar@troc.es">mmar@troc.es</A></B>
      </TD><TD>
         <P ALIGN=RIGHT><IMG SRC="M_F1.JPG" WIDTH=229 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom>
      </TD></TR>
</TABLE>
<HR>
</P>

<P><B><FONT SIZE="+1">D</FONT>enominaci&oacute;n de Origen
(D.O.):</B> Pened&egrave;s</P>

<P><B><FONT SIZE="+1">D</FONT>escripci&oacute;n de las <FONT
SIZE="+1">B</FONT>odegas:</B></P>

<P>Con una extensi&oacute;n de 42 hect&aacute;reas de vi&ntilde;edos,
la finca Mont-Mar&ccedil;al se alza en pleno coraz&oacute;n del
Pened&egrave;s, justo en el l&iacute;mite geogr&aacute;fico de Alt y
Baix Pened&egrave;s, a 50 km de Barcelona y 200 de la frontera
francesa. Enclavada en el valle del r&iacute;o Foix, se eleva a 215
metros sobre el nivel del mar, estando rodeada por la Sierra del
Litoral, el Macizo del Garraf y las estribaciones monta&ntilde;osas
de Montserrat, que confieren a la zona un microclima especial donde
se cultivan las mejores uvas del Pened&egrave;s.</P>

<P>Los vi&ntilde;edos Mont-Mar&ccedil;al producen las uvas utilizadas
para la elaboraci&oacute;n de los vinos blancos, rosados, tintos y
cavas, amparados por la D.O. Pened&egrave;s y el Consejo Regulados
del Cava. Se cultivan las variedades Macabeo, Xarel&#183;lo,
Parellada, Chardonnay, Cabernet Sauvignon, Merlot, Tempranillo y
Moscatell.</P>

<P><B><FONT SIZE="+1">&nbsp;</FONT></B></P>

<P><B><FONT SIZE="+1">M</FONT>anuel <FONT SIZE="+1">S</FONT>ancho e
<FONT SIZE="+1">H</FONT>ijas <FONT SIZE="+1">S</FONT>.<FONT
SIZE="+1">A</FONT>. recomienda:</B></P>

<P><CENTER><TABLE BORDER=0 CELLSPACING=10 CELLPADDING=5 WIDTH="100%">
   <TR>
      <TD>
         <P><CENTER><B><IMG SRC="M_E4.JPG" WIDTH=92 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom></B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B><IMG SRC="M_E5.JPG" WIDTH=97 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom></B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B><IMG SRC="M_E2.JPG" WIDTH=194 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom></B>
         </CENTER>
      </TD></TR>
   <TR>
      <TD>
         <P><CENTER><B>Mont-Mar&ccedil;al Cabernet Sauvignon 1991</B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B>Mont-Mar&ccedil;al Tinto Reserva 1992</B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B>Mont-Mar&ccedil;al Brut Nature Vintage
         1989</B></CENTER>
      </TD></TR>
   <TR>
      <TD VALIGN=top>
         <P>Vino Tinto. Crianza 14 meses en barrica de roble y 6
         meses en botella. Variedades de uva: Cabernet Sauvignon y
         Merlot. Color: Rub&iacute; intenso, brillante, con ligeros
         reflejos teja. Aroma: de crianza sobre roble americano,
         destacando las notas de especias como la vainilla y canela,
         frutos secos como las almendras, avellanas y ciruelas secas
         y con un fondo afrutado que recuerda el cas&iacute;s y la
         grosella. Gusto: redondo, aterciopelado, c&aacute;lido, muy
         personal, con cuerpo pero sin excesiva astringencia,
         armonioso, delicado, sugestivo, muy completo.</P>
         
         <P>Platos a base de carne como asados, parrilladas, etc. y
         conjunta muy bien con quesos y embutidos curados, carnes y
         pescados ahumados. Se recomienda servir a 18&#170;C. este
         vino puede conservarse durante largo tiempo, siempre que se
         haga en un lugar acondicionado a 15-18&#186;C y sin excesiva
         humedad ambiental.
      </TD><TD VALIGN=top>
         <P>Vino Tinto. Crianza: 14 meses en barrica y 22 meses en
         botella. Variedades de uva: Tempranillo, Cabernet Sauvignon
         y Merlot. Color: Rub&iacute; brillante intenso con reflejos
         ocre. Aroma: de crianza sobre roble, con un fondo afrutado,
         predominando sobre todo las notas de frutos secos como la
         almendra, avellana y especias como la vainilla y la canela.
         Gusto: en la boca muestra su viveza y con un retrogusto que
         se corresponde a su aroma de crianza.</P>
         
         <P>Platos a base de carne, asados, quesos fuertes, etc. Se
         recomienda servir a temperatura ambiente de 18&#186;C. Este
         vino seguir&aacute; evolucionando favorablemente en botella
         durante por lo menos cinco a&ntilde;os m&aacute;s y en tal
         caso se recomienda conservar en un lugar sin excesiva
         humedad y a temperatura de 15 a 18&#186;C.
      </TD><TD VALIGN=top>
         <P>Cava Brut Nature. Crianza: tres a&ntilde;os en cava.
         Variedades de uva: Macabeo, Xarel&#183;lo y Parellada.
         Color: Amarillo p&aacute;lido con reflejos dorados, con buen
         desprendimiento de finas burbujas y formaci&oacute;n de
         corona. Aroma: de evoluci&oacute;n en contacto con las
         levaduras, pero sobre un ligero fondo afrutado que recuerda
         las variedades de uva con las que est&aacute; elaborado.
         Gusto: buen paso de boca, muy seco pero arom&aacute;tico y
         equilibrado, fresco y elegante.</P>
         
         <P>Se indica para acompa&ntilde;ar una gran variedad de
         platos desde los pescados y mariscos hasta las carnes
         ligeras, pastas y arroces. Tambi&eacute;n es un
         magn&iacute;fico aperitivo. La temperatura ideal de servicio
         ideal es de 6&#186;C.
      </TD></TR>
</TABLE>
<HR>
<FONT SIZE="-1">Todas los datos tanto textuales como gr&aacute;ficos
han sido facilitados por las cavas mismas, salvo indicaci&oacute;n.
</FONT></CENTER></P>
</BODY>
</HTML>
