<!--This file created 3/03/97 17:19 by Claris Home Page version 2.0b1-->
<HTML>
<HEAD>
   
   <META NAME=GENERATOR CONTENT="Claris Home Page 2.0b1">
   <X-SAS-WINDOW TOP=40 BOTTOM=574 LEFT=3 RIGHT=783>
</HEAD>
<BODY background="back2.GIF">

<P><TABLE BORDER=0 CELLPADDING=1 WIDTH="100%">
   <TR>
      <TD>
         <P><B><FONT SIZE="+2">C</FONT>ellers <FONT
         SIZE="+2">S</FONT>cala <FONT SIZE="+2">D</FONT>ei, S.A.<BR>
         
         <FONT SIZE="+1">M</FONT>anuel <FONT SIZE="+1">P</FONT>eyra i
         <FONT SIZE="+1">A</FONT>meller</B></P>
         
         <P><B><FONT SIZE="+2">R</FONT>ambla de la <FONT
         SIZE="+2">C</FONT>artoixa S/N<BR>
         
         <FONT SIZE="+1">E</FONT>-43379, <FONT SIZE="+1">S</FONT>cala
         <FONT SIZE="+1">D</FONT>ei <FONT
         SIZE="+1">(T</FONT>arragona<FONT SIZE="+1">)</FONT></B></P>
         
         <P><B><FONT SIZE="+2">T</FONT>el. +34.(9)77.82-7027<BR>
         
         <FONT SIZE="+2">F</FONT>ax. +34.(9)77.82-7044</B></P>
         
         <P><B>URL:<BR>
         
         E-Mail:</B>
      </TD><TD>
         <P ALIGN=RIGHT><IMG SRC="SD_F3.JPG" WIDTH=158 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom>
      </TD></TR>
</TABLE>
<HR>
</P>

<P><B><FONT SIZE="+1">D</FONT>enominaci&oacute;n de Origen
(D.O.):</B> Priorat</P>

<P><B><FONT SIZE="+1">D</FONT>escripci&oacute;n de las <FONT
SIZE="+1">B</FONT>odegas:</B></P>

<P>Su origen data del siglo XIX cuando, tras la
desamortizaci&oacute;n de Mendiz&aacute;bal, los tatarabuelos de los
actuales responsables adquir&iacute;an las tierras de la Cartuja de
Scala Dei y se convert&iacute;an en los pioneros del embotellado de
vino en el Priorat. La filoxera par&oacute; la producci&oacute;n, y
en el a&ntilde;o 1973 se volvi&oacute; a empezar con la
fundaci&oacute;n de los Cellers d'Scala Dei, S.A. Las instalaciones
est&aacute;n ubicadas en las antiguas bodegas de los cartujanos,
debidamente restauradas y equipadas con los sistemas de
elaboraci&oacute;n modernos. Las bodegas de envejecimiento son
construcci&oacute;n del s. XVII, con muros de piedra de m&aacute;s de
un metro de grosor. La producci&oacute;n anual es de 300.000
botellas, y todo el vino elaborado y embotellado por Cellers d'Scala
Dei, S.A. procede de la vid de las 70 Ha. de vi&ntilde;edos que se
cultivan en esta propiedad.</P>

<P><B><FONT SIZE="+1">C</FONT>ellers <FONT SIZE="+1">S</FONT>cala
<FONT SIZE="+1">D</FONT>ei recomienda:</B></P>

<P><CENTER><TABLE BORDER=0 CELLSPACING=10 CELLPADDING=5 WIDTH="100%">
   <TR>
      <TD>
         <P><CENTER><B><IMG SRC="SD_A2.JPG" WIDTH=56 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom></B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B><IMG SRC="SD_A3.JPG" WIDTH=46 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom></B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B><IMG SRC="SD_A1.JPG" WIDTH=57 HEIGHT=150
         X-SAS-UseImageWidth X-SAS-UseImageHeight ALIGN=bottom></B>
         </CENTER>
      </TD></TR>
   <TR>
      <TD>
         <P><CENTER><B>Cartoixa d'Scala-Dei Gran Reserva 1991</B>
         </CENTER>
      </TD><TD>
         <P><CENTER><B>Blanc Prior 1995</B></CENTER>
      </TD><TD>
         <P><CENTER><B>Scala-Dei Crian&ccedil;a 1992</B></CENTER>
      </TD></TR>
   <TR>
      <TD VALIGN=top>
         <P>Vino Tinto Seco. Crianza en barricas de roble de 300 l
         durante 18 a 20 meses. Color: cereza tirando a teja. Aroma:
         muy potente, complejos aromas de crianza en madera
         (vainilla) con recuerdos de fruta madura. Boca: amplio,
         gustoso, suave, con gran car&aacute;cter, equilibrado,
         vigoroso, bien estructurado, con un potente toque de tanino
         que no molesta. Larga persistencia. Evoluciona muy bien en
         botella durante un periodo ascendente de 25 a&ntilde;os.
      </TD><TD VALIGN=top>
         <P>Vino Blanco Seco. Fermentado y criado en roble
         franc&eacute;s Allier durante 4 a 6 meses. Color: amarillo
         intenso. Aroma: muy potente, complejos aromas de crianza en
         madera (vainilla) con recuerdos a fruta madura. Boca:
         amplio, gustoso, suave, con gran car&aacute;cter,
         equilibrado, vigoroso, bien estructurado. Larga
         persistencia. Variedad: 100% garnacha. Evoluciona muy bien
         en botella durante un periodo ascendente de 5 a&ntilde;os.
      </TD><TD VALIGN=top>
         <P>Vino Tinto Seco. Crianza durante 6 meses en barricas de
         roble franc&eacute;s y bosnio. Envejecido en botella. Color:
         cereza con reflejos viol&aacute;ceos y brillantes. Aroma: de
         fruta con elegantes tonos florales y bals&aacute;micos, con
         el tradicional fondo yodato. Boca: vigoroso y potente,
         amplio, gustoso, con buen equilibrio, serio, fuerte y suave,
         con car&aacute;cter y larga persistencia. V&iacute;a
         retronasal amplia y limpia, con notas florales y de yodo.
         Variedad: 80% Garnacha y 20% Cabernet Sauvignon. Mejora con
         el tiempo. 13'5% vol alcohol.
      </TD></TR>
</TABLE>
<HR>
<FONT SIZE="-1">Todas los datos tanto textuales como gr&aacute;ficos
han sido facilitados por las cavas mismas, salvo indicaci&oacute;n.
</FONT></CENTER></P>
</BODY>
</HTML>
