<HTML>
<HEAD>
<TITLE>Pr&eacutesentation g&eacuten&eacuterale</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff"  text="#101066" link="#000fff" vlink="#2000aa">

<BR>
<center>
<H1>Pr&eacutesentation g&eacuten&eacuterale</H1>
<BR>
<IMG SRC="images/english.gif"><BR>
<!--a href="english/presentation_gen.html"-->English version<!--/a-->
<BR>
</center>
<BR>
<IMG SRC="images/barre.bleu.bleu.gif">
<BR>
C'est &agrave; <a href="#p2">Toulouse</a>, capitale europ&eacute;enne de l'industrie spatiale, que l'Ecole Nationale Sup&eacute;rieure des T&eacute;l&eacute;communications accueille les &eacute;l&egrave;ves ing&eacute;nieurs d&eacute;sireux de se sp&eacute;cialiser dans le domaine des <a href="#p1">t&eacute;l&eacute;communications spatiales</a>. Disposant de moyens p&eacute;dagogiques propres et d'un laboratoire de recherche, le Site de Toulouse accueille en outre des &eacute;tudiants pr&eacute;parant le mast&egrave;re "Syst&egrave;mes de Radiocommunications Spatiales", des stagiaires et des &eacute;l&egrave;ves doctorants.<BR>
<BR>
(N'oubliez pas de consulter notre <a href="#p3">liste des serveurs r&eacute;gionaux</a> &agrave la fin de cette page)<br>
<a name=p1></a>
<IMG SRC="images/barre.bleu.bleu.gif">
<h3>Les T&eacute;l&eacute;communications spatiales</h3>
Les ann&eacute;es 60 ont vu la naissance des radiocommunications spatiales.
Les premiers syst&egrave;mes &agrave; satellite offraient une capacit&eacute;
faible et un co&ucirc;t relativement &eacute;lev&eacute;. Ce co&ucirc;t
r&eacute;sultait de la conjonction du co&ucirc;t du lanceur, de celui du
satellite, de la faible dur&eacute;e de vie du satellite et de sa faible
capacit&eacute;.<BR>
<BR>
La r&eacute;duction du co&ucirc;t des radiocommunications spatiales est le
r&eacute;sultat :<BR>
<UL>
<LI>d'une fiabilit&eacute; accrue  des lanceurs ; 
<LI>de leur aptitude &agrave; mettre en orbite des satellites de plus en plus
lourds ;
<LI>&nbsp;des progr&egrave;s des techniques microondes (antennes
multifaisceaux &agrave; faisceaux conform&eacute;s, r&eacute;utilisation  de
fr&eacute;quence, amplificateurs d'&eacute;mission embarqu&eacute;s de
puissance plus &eacute;lev&eacute;e).</UL>

Les applications se sont par ailleurs consid&eacute;rablement
diversifi&eacute;es. A l'origine, les satellites &eacute;taient con&ccedil;us
pour acheminer des communications d'un point &agrave; un autre et l'on mettait
&agrave; profit leur couverture &eacute;tendue pour &eacute;tablir des liaisons
&agrave; grande distance.  Aujourd'hui, le satellite est devenu un canal
d'&eacute;change entre des milliers de petites stations dans la mesure
o&ugrave; il collecte et diffuse, mieux que tout autre r&eacute;seau, des
messages et des donn&eacute;es provenant du monde entier. Cette qualit&eacute;
irrempla&ccedil;able est mise &agrave; profit dans un nombre sans cesse
croissant de domaines comme les r&eacute;seaux de "VSAT", la
t&eacute;l&eacute;diffusion, les communications avec les mobiles, la
transmission d'appels de d&eacute;tresse... Mais le satellite est aussi devenu
un incomparable instrument d'observation de la terre dont les applications en
m&eacute;t&eacute;orologie et en d&eacute;tection des ressources naturelles
sont bien connues. Enfin, transform&eacute; en outil d'arpentage de notre
plan&egrave;te, le satellite apporte une pr&eacute;cision
in&eacute;gal&eacute;e en mati&egrave;re de radiolocalisation et de
radionavigation.<br>
<a name=p2></a>
<IMG SRC="images/barre.bleu.bleu.gif">
<BR>
<h3>Toulouse</h3>
<b></b>
Install&eacute; sur le campus de <a href="http://www.supaero.fr">SUPAERO</a> (ENSAE), le Site de
Toulouse de l'ENST b&eacute;n&eacute;ficie d'un environnement
particuli&egrave;rement favorable au coeur de la 
<a href="http://www.cict.fr/toulouse">r&eacute;gion Midi-Pyr&eacute;n&eacute;es</a> 
: proximit&eacute; du <a href="http://www.cnes.fr">CNES</a> (Centre National d'Etudes Spatiales), 
des industries spatiales (Alcatel Espace, Matra Marconi Space, A&eacute;rospatiale, etc) 
et des laboratoires de recherche renomm&eacute;s du CERT/ONERA, de 
l'<a href="http://www.ups.fr">Universit&eacute; Paul Sabatier</a> 
et de l'Institut National Polytechnique. Un grand nombre des enseignants vacataires de la formation en est issu.
<BR>
<BR>
Avec un tissu industriel diversifi&eacute;, compl&eacute;mentaire et
performant, l'agglom&eacute;ration toulousaine occupe une position
europ&eacute;enne et nationale de tout premier plan :<BR>
<UL>
<LI>premier centre europ&eacute;en de l'espace
<LI>premier centre a&eacute;ronautique en Europe
<LI>premier centre fran&ccedil;ais d'&eacute;lectronique (composants actifs,
robotique, automatique)
<LI>deuxi&egrave;me centre fran&ccedil;ais en g&eacute;nie logiciel 
<LI>deuxi&egrave;me centre universitaire fran&ccedil;ais (105 000
&eacute;tudiants dont 12% sont &eacute;trangers, 4 universit&eacute;s, 14
&eacute;coles nationales d'ing&eacute;nieurs, 343 laboratoires)</UL>

Au-del&agrave; de leur r&eacute;ussite &eacute;conomique, 
<a href="http://www.cict.fr/toulouse">Toulouse</a> et son
agglom&eacute;ration poss&egrave;dent d'autres attraits : sous la double
influence de la M&eacute;diterran&eacute;e et de l'Oc&eacute;an,
l'agglom&eacute;ration toulousaine b&eacute;n&eacute;ficie d'un 
<a href="http://www.meteo.fr:80/tpsreel/tpsreel.html">climat</a>
tr&egrave;s agr&eacute;able et ensoleill&eacute;.<BR>
<BR>
Empreinte de l'architecture des si&egrave;cles pass&eacute;s, Toulouse a
conserv&eacute; tout le charme et le prestige d'un patrimoine
c&eacute;l&egrave;bre : le Capitole, Saint-Sernin, les Jacobins, la
Cath&eacute;drale Saint-Etienne, les vieux h&ocirc;tels particuliers de la
Renaissance, autant d'&eacute;difices civils ou religieux tr&egrave;s
fr&eacute;quent&eacute;s par les visiteurs du monde entier.<BR>
<BR>
Si sa gastronomie est reconnue comme l'une des meilleures, le
succ&egrave;s de ses artistes a largement d&eacute;pass&eacute; les murs de la
Ville Rose : Carlos Gardel, Madie Mespl&eacute;, Claude Nougaro, Gold, Image,
Exam, Jean-Pierre Mader...<BR>
<BR>
V&eacute;ritable cit&eacute; des Arts, musique et th&eacute;&acirc;tre s'y
c&ocirc;toient : l'Orchestre National du Capitole dirig&eacute; par Michel
Plasson de renomm&eacute;e internationale, le Th&eacute;&acirc;tre Daniel
Sorano, le Centre Dramatique National du Grenier de Toulouse, la Compagnie
chor&eacute;graphique Joseph Russillo et le Centre Multim&eacute;dia Odyssud
(salle de spectacles, studios d'enregistrement...). Le cin&eacute;ma est
tr&egrave;s pr&eacute;sent avec 50 salles dont 10 d'Art et d'Essais.<BR>
<BR>
Toulouse est aussi une ville de sports. Capitale du 
<a href="http://www.igd.u-bordeaux.fr/~alazet/stade.html">rugby</a>, Toulouse
accueille plus de 200 terrains de tennis, 40 piscines, 8 centres
&eacute;questres, 12 terrains de golf &agrave; moins d'une heure du centre
ville. Et &agrave; m&ecirc;me distance, le Grand Toulouse c'est aussi 1135
hectares d'espaces verts, parmi lesquels les 4 zones de loisirs de
Sesqui&egrave;res, La Ram&eacute;e, les Argoulets, Pech-David, et les 45
hectares de grands jardins, ainsi que le canal du Midi dont le charme
touristique est universellement reconnu.<BR>
<BR>
Enfin, toutes proches, les Pyr&eacute;n&eacute;es combleront les amateurs
de montagne en leur permettant de pratiquer facilement le 
<a href="http://www.skifrance.fr/e-regi-f.htm#pyr">ski</a> (20 stations &agrave; moins de deux heures), 
l'escalade, la randonn&eacute;e, les sports d'eaux vives, etc...
<br>
<a name=p3></a>
<IMG SRC="images/barre.bleu.bleu.gif">
<h3>Quelques serveurs r&eacute;gionaux</h3>
<UL>
<LI>Pour le travail :</LI><UL>
<LI><A HREF="http://www.cict.fr"><B>Le CICT</B></A> Le Centre Interuniversitaire de Calcul de Toulouse
<LI><A HREF="http://www.ups-tlse.fr/ups-tlse.html">L'<B>UPS</B></A> L'Universit&eacute Paul Sabatier
<LI><A HREF="http://www.insa-tlse.fr"><B>L'INSA</B></A> L'Institut National des Sciences Appliqu&eacute;es
<LI><A HREF="http://www.enseeiht.fr"><B>L'ENSEEIHT</B></A> L'Ecole Nationale Sup&eacute;rieure d'Electronique, d'Electrotechnique, d'informatique er d'Hydrolique de Toulouse
<LI><A HREF="http://www.irit.fr"><B>L'IRIT</B></A> L'Institut de recherche en informatique de Toulouse
<LI><A HREF="http://www.cnes.fr"><B>Le CNES</B></A> Le Centre National d'Etudes Spatiales</UL>

<BR>
<LI>Pour les loisirs :</LI><UL>
<LI><A HREF="http://www.igd.u-bordeaux.fr/~alazet/stade.html"><B>La section Rugby du Stade Toulousain</B></A><LI>
<A HREF="http://www.skifrance.fr/e-regi-f.htm#pyr"><B>Le ski dans les pyr&eacute;n&eacute;es</B></A><LI>
<A HREF="http://www.netsurf.org/CyberRout/cgi-bin/CR_Liste.cgi/FR/FRANCE/31/TOULOUSE"><B>O&ugrave manger ?</B></A>
</UL>
<BR>
<LI><A HREF="http://www.cict.fr/toulouse/FServeurs.html"><B>D'autres serveurs r&eacute;gionaux ...</B></A> (liste des serveurs du CICT)</UL>

<IMG SRC="images/barre.bleu.bleu.gif">
<br>
<I>Dernière modification 28/05/97</I><br>
Pour plus d'informations contactez:
<ADDRESS><A HREF="mailto:figarol@tlse.enst.fr">figarol@tlse.enst.fr</A></ADDRESS>
<P></P>
</BODY>
</HTML>
