<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>Les contrats</TITLE>
   <META NAME="GENERATOR" CONTENT="Mozilla/3.0Gold (X11; I; SunOS 5.5 sun4m) [Netscape]">
</HEAD>
<BODY BACKGROUND="Fongranu.jpg" BODY TEXT="#101066" BGCOLOR="E6E8FA" LINK="#000FFF" VLINK="#2000AA">

<TABLE WIDTH="100%" >
<TR align=middle valign=top>
<TD>
<H2><B>Les rapports</H2></B>
</TD>

<TD>
<H2><B>Reports</H2></B>
</TD>
</TR>
</TABLE>

<IMG SRC="barre.bleu.bleu.gif" HEIGHT=4 WIDTH="100%"> <BR>

<H3><B>Rapports techniques</B>
</H3>

<P><B>G. Maral,</B> &quot;Satellite orbits offering repeating ground tracks
and time of passage&quot;, 1995<BR>
<BR>
<B>A. Pirovano,</B> &quot;Utilisation des techniques de contr&ocirc;le
de congestion de TCP pour une interconnexion de r&eacute;seaux par satellite
et microstations&quot;, 1994<BR>
<BR>
<B>A. Da Silva - C. Le Guen,</B> &quot;Etude synth&eacute;tique des syst&egrave;mes
multisatellites pour communications mobiles&quot;, 1994<BR>
<BR>
<B>S. Blondeau,</B> &quot;Syst&egrave;me d'acc&egrave;s et efficacit&eacute;
spectrale pour une constellation de satellites de t&eacute;l&eacute;communications
&agrave; d&eacute;filement&quot;, 1993<BR>
<BR>
<B>XY. Guo, T. Zein</B>, &quot;Probabilit&eacute; de rejet d'une cellule
ATM&quot;, 1993<BR>
<BR>
<B>G. Crevon,</B> &quot;La mise en oeuvre des stations terriennes : Aspects
op&eacute;rationnels&quot;, 1993<BR>
<BR>
<B>JP Cances,</B> &quot;Adaptativit&eacute; d'une charge utile de t&eacute;l&eacute;communication
multifaisceaux par reconfiguration de couverture&quot;, 1993<BR>
<BR>
<B>F. Dosiere,</B> &quot;R&eacute;seau t&eacute;l&eacute;phonique par constellations
de satellites en orbites basses&quot;, 1993<BR>
<BR>
<B>G. Maral</B>, &quot;Theoretical minimum number of satellites for worldwide
coverage &amp; minimum coverage overlap&quot;, 1993<BR>
<BR>
<B>G. Maral</B>,&quot;Low earth orbit (LEO) satellite communications systems&quot;,
1993<BR>
<BR>
<B>L. Julia,</B> &quot;Comparison of multiple access protocols&quot;, 1993<BR>
<BR>
<B>X-Y. Guo, </B>&quot;Etude par simulation d'une boucle num&eacute;rique
&agrave; verrouillage de phase&quot;, 1993<BR>
<BR>
<B>M-L. Boucheret,</B> &quot;Antennes pour satellites de t&eacute;l&eacute;communications
gouvernementales&quot;, 1993<BR>
<BR>
<B>G. Maral</B>, &quot;VSAT NETWORKS - Lectures notes&quot;, 1993<BR>
<BR>
<B>T. Otsu,</B> &quot;Protocol verification for satellite communication
systems&quot;, 1993<BR>
<BR>
<B>F. Dosiere,</B> &quot;MEO reduced coverage visibility analysis with
spacecraft body steering&quot;, 1993<BR>
<BR>
<B>G. Maral,</B> &quot;Etat de l'art et perspectives en t&eacute;l&eacute;communications
par satellite&quot;, 1993<BR>
<BR>
<B>F. Dosiere,</B> &quot;Commutation et signalisation dans les r&eacute;seaux
de t&eacute;l&eacute;communications par constellation de satellites &agrave;
d&eacute;filement&quot;, 1992<BR>
<BR>
<B>F. Dosiere,</B> &quot;Analyse du trafic dans les constellations de satellites
en orbites basses - volume 2, dimensionnement des constellations&quot;,
1992<BR>
<BR>
<B>F. Dosiere</B>, &quot;Analyse du trafic dans les constellations de satellites
en orbites basses - volume 1, mod&egrave;le de hand-over&quot;, 1992<BR>
<BR>
<B>F. Dosiere</B>, &quot;Structure des r&eacute;seaux de t&eacute;l&eacute;phonie
en orbite basse : approche th&eacute;orique&quot;, 1992<BR>
<BR>
<B>F. Dosiere</B>, &quot;Synth&egrave;se des probl&egrave;mes d'acheminement
de donn&eacute;es dans les constellations de satellites&quot;, 1991<BR>
<BR>
<B>J. Radzik</B>, &quot;Aide &agrave; la conception de constellations de
satellites en orbite basse&quot;, 1991<BR>
<I>Diffusion personnalis&eacute;e.<BR>
<BR>
</I><B>J. Radzik,</B> &quot;Communications militaires par microsatellites
&agrave; d&eacute;filement&quot;, 1991<BR>
<I>Diffusion personnalis&eacute;e.<BR>
<BR>
</I><B>J. Radzik</B>, &quot;Communications par satellites pour petits terminaux
fixes ou mobiles&quot;, 1991<BR>
<I>Diffusion personnalis&eacute;e.<BR>
<BR>
</I><B>G. Maral, J.J. de Ridder,</B> &quot;Basic concepts of low earth
orbit satellite systems for communications&quot;, 1991<BR>
<BR>
<IMG SRC="barre.bleu.bleu.gif" HEIGHT=4 WIDTH="100%"> <BR>


<H3><B>Rapports de stages</B>
</H3>

<P><B>A Bak &amp; Z Kopertowski, </B>&quot;ATM via satellite&quot; 95-12<BR>
<BR>
<B>T Bringel, </B>&quot;Etude de l'Effet Doppler dans les t&eacute;l&eacute;communications
spatiales&quot; 95-11<BR>
<BR>
<B>J Lundberg, </B>&quot;Cosine -Modulated filters&quot; 95-10<BR>
<BR>
<B>L Wood, </B>&quot;Network performance of non-geostationary constellations
equipped with intersatellite links&quot; 95-9<BR>
<BR>
<B>C Cardenas,</B> &quot;Mod&eacute;lisation de Trafic LAN&quot; 95-8<BR>
<BR>
<B>A Ezzahraoui, </B>&quot;Interconnection de r&eacute;seaux locaux&quot;
95-7<BR>
<BR>
<B>V Soum, </B>&quot;Mod&eacute;lisation de trafic sur les r&eacute;seaux
locaux&quot; 95-6<BR>
<BR>
<B>O Hannioui, </B>&quot;Antenna generation and analysis tools version
1.1 - Architecture fonctionnelle et logiciel&quot; 95-5<BR>
<BR>
<B>C Delucchi,</B> &quot;Routing strategies in LEO/MEO satellite networks
with intersatellite links&quot; 95-4<BR>
<BR>
<B>C Simms, </B>&quot;Study and development of link and interference analysis
software tools for communication satellite constellations&quot; 95-3<BR>
<BR>
<B>R Harend, </B>&quot;Algorithmes de synchronisation appliqu&eacute;s
&agrave; la r&eacute;ception des signaux modul&eacute;s et cod&eacute;s
en treillis&quot; 95-2<BR>
<BR>
<B>A Magnier, </B>&quot;Etude d'algorithmes de d&eacute;multiplexage pour
un modem multicanaux SCPC&quot; 95-1<BR>
<BR>
<B>A Pirovano, </B>&quot;Interconnexion de r&eacute;seaux locaux par liaisons
satellite et microstations; adaptation des protocoles TCPIP&quot; 94-11<BR>
<BR>
<B>M-A Moineuse, </B>&quot;Etude des liaisons inter-satellites dans les
constellations de satellites pour les t&eacute;l&eacute;communications&quot;
94-10<BR>
<BR>
<B>CP Lee,</B> &quot;Formateurs de pinceaux num&eacute;riques pour satellites
de communications avec les mobiles&quot; 94-9<BR>
<BR>
<B>T Hognon,</B> &quot;Etude de d&eacute;veloppement d'outils logiciels
de liaisons et d'interf&eacute;rence dans les constellations de satellites
pour les t&eacute;l&eacute;communications&quot; 94-8<BR>
<BR>
<B>M Hegeman,</B>&quot;Fade analysis in dynamic satellite constellations
(extension of the LEONART software tool)&quot; 94-7<BR>
<BR>
<B>JE Hakegard,</B> &quot;Localisation des usagers dans un syst&egrave;me
satellite multifaisceaux&quot; 94-6<BR>
<BR>
<B>R Frikha,</B> &quot;Etude des bancs de filtre&quot; 94-5<BR>
<BR>
<B>J Restrepo, </B>&quot;Conception d'outils de g&eacute;n&eacute;ration
de diagrammes d'antennes&quot; 94-4<BR>
<BR>
<B>P Olsen, </B>&quot;Development of a mobile channel fading model and
an orthogonal frequency division multiplex system with SPW&quot; 94-3<BR>
<BR>
<B>V Amundgaard, </B>&quot;Modelling a VSAT network with OPNET using the
slotted ALOHA channel access protocol&quot; 94-2<BR>
<BR>
<B>F Forte,</B> &quot;Adaptive digital beamforming network for mobile communication
payloads&quot; 94-1<BR>
<BR>
<B>M-C Martel-Marchi, </B>&quot;Projet d'&eacute;tude d'algorithmes de
r&eacute;cup&eacute;ration de rythme pour implantation en num&eacute;rique&quot;
93-3<BR>
<BR>
<B>S Blondeau,</B> &quot;Algorithmes de synchronisation de phase porteuse
pour implantation en num&eacute;rique&quot; 93-2<BR>
<BR>
<B>M Durstewitz, </B>&quot;Expert system for configuration and design of satellite
communication systems&quot; 93-1<BR>
<BR>
<B>G. Mohler,</B> &quot;Etude de d&eacute;multiplexage dans le domaine
fr&eacute;quentiel&quot; 92-11<BR>
<BR>
<B>T. Wolf</B>, &quot;Etude de pannes dans les constellations de satellites
en orbites basses&quot; 92-10<BR>
<BR>
<B>K. Weber</B>, &quot;Etudes de modulation cod&eacute;es&quot; 92-9<BR>
<BR>
<B>B. Warin,</B> &quot;M&eacute;thode de synth&egrave;se de r&eacute;seaux
lin&eacute;aires et plans rayonnant un diagramme &agrave; contour form&eacute;&quot;
92-8<BR>
<BR>
<B>A. Warich</B>, &quot;Aide &agrave; la conception de constellations de
satellites en orbites basses&quot; 92-7<BR>
<BR>
<B>I. Mortensen</B>, &quot;Performance of clock timing recovery algorithms&quot;
92-6<BR>
<BR>
<B>G. Mohler</B>, &quot;Etudes de d&eacute;multiplexage dans le domaine
fr&eacute;quenciel&quot; 92-5<BR>
<BR>
<B>P. Lalanne</B>, &quot;Conception et r&eacute;alisation d'un commutateur
de paquet ATM adapt&eacute; &agrave; une implantation &agrave; bord d'un
satellite&quot; 92-4<BR>
<BR>
<B>S. Bedrich,</B> &quot;Aspects communication et station-sol du petit
satellite scientifique Bridge&quot; 92-2<BR>
<BR>
<B>T. Arcel</B>, &quot;Gestion r&eacute;partie de l'acc&egrave;s &agrave;
un canal satellite&quot; 92-1<BR>
<BR>
<B>E. Danche</B>, &quot;Etude des algorithmes de d&eacute;modulation multiporteuse
pour satellites r&eacute;g&eacute;n&eacute;rateurs : &eacute;tage de d&eacute;multiplexage
num&eacute;rique&quot; 91-6<BR>
<BR>
<B>I. J. Fannelop, A. Rafkaoui,</B> &quot;Etude de l'emplacement optimal
de l'embrouilleur par rapport au codeur&quot; 91-5<BR>
<BR>
<B>C. Clevenot,</B> &quot;Etude des performances de visibilit&eacute; des
constellations de satellites sans contr&ocirc;le d'orbite&quot; <BR>
91-4<BR>
<BR>
<B>A. Bouhia</B>, &quot;Dimensionnement d'antennes de t&eacute;l&eacute;communications&quot;
91-3<BR>
<BR>
<B>N. Castignolles</B>, &quot;Acheminement de donn&eacute;es dans un syt&egrave;me
de microsatellites &agrave; d&eacute;filement&quot; 91-2<BR>
<BR>
<B>J.M. Fernandez</B>, &quot;Conception d'un processeur num&eacute;rique
pour le calcul rapide de produits de corr&eacute;lation binaire&quot; 91-1<BR>


<BR>
<IMG SRC="barre.bleu.bleu.gif" HEIGHT=4 WIDTH="100%"> <BR>
<I>Derni&egrave;re modification 10/10/97</I><BR>
Pour plus d'informations contactez: <BR>
<A HREF="mailto:soule@tlse.enst.fr">soule@tlse.enst.fr</A>
</BODY>
</HTML>