<HTML>

<HEAD>

<TITLE>Tandemideen - Ideias Tandem</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Word 2.0z Beta">
</HEAD>

<BODY BGCOLOR="#FFFBF0" TEXT="#000000">
<P Align="Center">
<A HREF="../infpo.html">Rede Internacional de Tandem por Correio Electr&oacute;nico</A>
</P>
<P>

<CENTER>
<STRONG>Subrede - Teilnetz <A HREF="deupor.html">DEU-POR</A></P></STRONG>
</CENTER>

<HR>

<P>
[<A HREF="#auf_deutsch">auf deutsch</A>] [<A NAME="em_portugues">em
portugu&ecirc;s</A>] [<A HREF="hints.html">&Iacute;ndice</A>]
(1.6.96)</P> 
<H1 Align="Center">Ideias Tandem</H1>

<P>
Sabias que atrav&eacute;s do <STRONG>Servi&ccedil;o de Encontro
de Pares Tandem</STRONG> </P>
<P Align="Center">
<TT>tandem@slf.ruhr-uni-bochum.de</P></TT>
<P>
podes arranjar um/a colega falante nativo do alem&atilde;o ou
do portugu&ecirc;s para te ajudar a aprender a sua l&iacute;ngua
materna? Em troca, tamb&eacute;m tu /o/a ajudar&aacute;s a melhorar
os seus conhecimentos na tua l&iacute;ngua materna.</P> 
<P>
A <STRONG>aprendizagem em tandem</STRONG> n&atilde;o &eacute;
apenas uma amizade por carta; &eacute; uma colabora&ccedil;&atilde;o
com o <STRONG>objectivo de aprender </STRONG>. </P>
<P>
E seguramente que conversar&aacute;s com o teu / a tua colega
sobre temas que interessam a ambos: vais descobri-los num instante!
</P>
<P>
Mas aqui tanb&eacute;m devemos falar, de vez em quando, sobre
o que fazer para se conseguir aprender o m&aacute;ximo. Devemos
tirar proveito das experi&ecirc;ncias at&eacute; &agrave; data
por n&oacute;s realizadas.</P> 
<H2>Como se aprende uma l&iacute;ngua com a ajuda de um/uma colega
tandem? </H2>

<P>
Podem distinguir-se tr&ecirc;s modalidades: </P>
<H3>a) Aprender seguindo o modelo do/a colega.</H3>

<P>
Podes aprender a partir do que o teu/a tua colega escreve, a forma
de express&atilde;o correcta na sua l&iacute;ngua materna.</P>

<H3>b) Aprender atrav&eacute;s da ajuda que o/a colega pode dar
na formula&ccedil;&atilde;o.</H3>

<P>
O teu/a tua colega pode ajudar-te a dizer o que querias na l&iacute;ngua
estrangeira, a sua l&iacute;ngua materna. S&oacute; tens que lhe
pedir! </P>
<H3>c) Aprender atrav&eacute;s das correc&ccedil;&otilde;es feitas
pelo/a colega:</H3>

<P>
O teu/a tua colega pode corrigir aquilo que escreveste na l&iacute;ngua
estrangeira, a sua l&iacute;ngua materna. Contudo, deves decidir
com ele/ela que correc&ccedil;&otilde;es se devem fazer e de que
forma.</P> 
<H2>Exemplos concretos</H2>

<P>
Tudo isto &eacute; um pouco abstrato. Por esta raz&atilde;o, propomos
recolher exemplos concretos de como aprender com este m&eacute;todo.
N&oacute;s mesmos vamos dar id&eacute;ias tandem concretas uma
vez por semana. Hoje come&ccedil;amos assim.</P> 
<P>
Esperamos que contribuas com algumas id&eacute;ias tiradas da
tua pr&oacute;pria experi&ecirc;ncia tandem,</P>
<P>
Helmut</P> 
<P>
[<A HREF="#auf_deutsch">zum Anfang</A>] [<A HREF="#em_portugues">Para o in&iacute;cio</A>]
[<A HREF="hints.html">&Iacute;ndice</A>]</P>
<HR>

<P>
[<A NAME="auf_deutsch">auf deutsch</A>] [<A HREF="#em_portugues">em portugu&ecirc;s</A>]
[<A HREF="hints.html">&Iacute;ndice</A>]</P> 
<H1 Align="Center">Tandemideen</H1>

<P>
Ihr wi&szlig;t, da&szlig; Ihr &uuml;ber die <STRONG>Tandempartnervermittlung</P></STRONG>
<P Align="Center">
<TT>tandem@slf.ruhr-uni-bochum.de</P></TT>
<P>
einen deutschsprachigen bzw. englischsprachigen Partner bekommen
k&ouml;nnt, der Euch dabei hilft, seine Muttersprache zu lernen,
und dem Ihr helft, seine Kenntnisse in Eurer Muttersprache zu
verbessern. </P>
<P>
<STRONG>Tandemlernen</STRONG> ist also mehr als eine reine Brieffreundschaft:
es ist eine <STRONG>Lernpartnerschaft</STRONG>. </P>
<P>
Ihr werdet Euch miteinander nat&uuml;rlich &uuml;ber die Themen
unterhalten, die Euch beide interessieren - die werdet Ihr schnell
allein herausfinden.</P>
<P>
Aber wie Ihr das so tun k&ouml;nnt, da&szlig; Ihr m&ouml;glichst
viel dabei lernt, dar&uuml;ber sollten wir hier ab und zu sprechen.
Und wir sollten dabei von den Erfahrungen profitieren, die wir
und Ihr inzwischen gesammelt habt. </P>
<H2>Wie verbessert man mit Hilfe seines Tandempartners seine Sprachkenntnisse?
</H2>

<P>
Man kann 3 Bereiche unterscheiden: </P>
<H3>a) Lernen aus dem Modell des Partners</H3>

<P>
Ihr k&ouml;nnt aus dem, was Euer Partner schreibt lernen, wie
man sich in seiner Sprache richtig ausdr&uuml;ckt. (Aus diesem
Grund solltet Ihr beide mindestens die H&auml;lfte Eurer Briefe
in Eurer Muttersprache schreiben.)</P>
<H3>b) Lernen durch Formulierungshilfen des Partners</H3>

<P>
Euer Partner kann Euch immer helfen, das in der Fremdsprache (seiner
Muttersprache) zu sagen, was Ihr sagen wollt. Ihr m&uuml;&szlig;t
ihn nur darum bitten. </P>
<H3>c) Lernen durch Korrekturen des Partners</H3>

<P>
Euer Partner kann das, was Ihr in der Fremdsprache (seiner Muttersprache)
geschrieben habt, korrigieren. Ihr m&uuml;&szlig;t jedoch miteinander
ausmachen, was und wie solche Korrekturen aussehen sollen. </P>
<H2>Konkrete Beispiele</H2>

<P>
Das alles ist etwas abstrakt. Deshalb schlage ich vor, da&szlig;
wir konkrete Beispiele daf&uuml;r sammeln, wie man auf diese Weise
lernt. Ich selbst werde mindestens einmal pro Woche konkrete &quot;Tandemideen&quot;
vorstellen. Ich fange heute damit an. </P>
<P>
Und ich hoffe, dass auch viele von Euch aufgrund ihrer Erfahrungen
eigene &quot;Tandemideen&quot; beitragen k&ouml;nnen. </P>
<P>
Weiterhin viel Spa&szlig; und Erfolg im Forum und mit Eurem Tandempartner
</P>
<P>
Helmut</P>
<P>
[<A HREF="#auf_deutsch">zum Anfang</A>] [<A HREF="#em_portugues">para o in&iacute;cio</A>]
[<A HREF="hints.html">Index</A>]</P>
<HR>

<P>
&copy; 1996 Brammerts, D'Atri 
</BODY>

</HTML>
