<HTML>

<HEAD>

<TITLE>Primeira Carta - Erste Briefe</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Word 2.0z Beta">
</HEAD>

<BODY BGCOLOR="#FFFBF0" TEXT="#000000">
<P Align="Center">
<A HREF="../infpo.html">International E-Mail Tandem Network</A>
</P>
<P Align="Center">
<STRONG>Subrede -Teilnetz <A HREF="deupor.html">DEU-POR</A></P></STRONG>
<HR>

<P>
[<A HREF="#auf_deutsch">auf deutsch</A>] [<A NAME="em_portugues">em
portugu&ecirc;s</A>] [<A HREF="hints.html">&Iacute;ndice</A>]</P>

<H1 Align="Center">As Primeiras Cartas</H1>

<H2>Conselhos do Servi&ccedil;o de Encontro de Pares Tandem</H2>

<P>
... depois de te arranjarmos um/a colega tandem.</P>
<P>
Ol&aacute;,</P> 
<P>
Acima podes ver o endere&ccedil;o do teu/tua colega do Tandem.
Escreve-lhe uma mensagem breve como, por exemplo: &quot;Ol&aacute;!
Tenho o teu endere&ccedil;o e a partir de agora vamos ser colegas
tandem. At&eacute; segunda-feira. Manel&quot;. </P>
<P>
Assim fica estabelecido o primeiro contacto. N&atilde;o percas
tempo. O melhor &eacute; faz&ecirc;-lo de imediato, antes mesmo
de continuares a ler o resto desta mensagem.</P> 
<H3>Se ele/ela n&atilde;o responde...</H3>

<P>
No caso de durante uma semana n&atilde;o receberes nenhuma resposta
do teu/da tua colega, comunica-nos imediatamente. Vamos dar-te
um outro endere&ccedil;o.</P> 
<H3>Trocar de par...</H3>

<P>
... &eacute; coisa que n&atilde;o tem nada de errado na aprendizagem
em tandem, muito pelo contr&aacute;rio: com novos colegas aprendem-se
coisas novas. Sempre que queiras um novo endere&ccedil;o, entra
em contacto connosco. </P>
<P>
O nosso endere&ccedil;o &eacute;: <TT>tandem@slf.ruhr-uni-bochum.de</P>
</TT>
<H3>Qual o melhor modo de aprender em Tandem?</H3>

<P>
Sobre isto, os teus coordenadores da subrede alem&atilde;o-portugu&ecirc;s
- Adelaide, Karl Heinz Delille e Markus Stumm querem dar-te alguns
conselhos. Continua, pois, a ler. </P>
<P>
Despedimo-nos de ti e esperamos que te divirtas.</P> 
<P>
Servi&ccedil;o de Encontro de Pares Tandem (Isa, Heike &amp; Dawn)</P>

<HR>

<H2>Conselhos dos Coordenadores desta Sub-rede</H2>

<P Align="Center">
<I><B>International E-Mail Tandem Network</P></B></I>
<P Align="Center">
<STRONG>Sub-rede Germano-portuguesa: DEU-POR</P></STRONG>
<P>
Queridos colegas tandem,</P>
<P>
Somos Adelaide Chichorro, Karl Heinz Delille e Markus Stumm, os
coordenadores de DEU-POR e estamos satisfeitos por poderem come&ccedil;ar
a trabalhar em conjunto na rede de e-mail tandem.</P> 
<P>
Talvez j&aacute; tenham alguma experi&ecirc;ncia de aprendizagem
em tandem usando correio electr&oacute;nico. Se &eacute; este
o caso, esperamos simplesmente que se divirtam e que tenham muito
&ecirc;xito no vosso trabalho em conjunto. </P>
<P>
Se n&atilde;o, aqui ficam alguns conselhos:</P> 
<H3>Como come&ccedil;ar?</H3>

<P>
J&aacute; cumprimentaste de forma breve o teu/a tua colega para
que ele/ela saiba que a comunica&ccedil;&atilde;o j&aacute; foi
estabelecida? Ent&atilde;o, podem escrever a vossa primeira carta
tandem.</P> 
<H3>Esta &eacute; a nossa proposta:</H3>

<P>
Em primeiro lugar apresentem-se. Contem alguma coisa sobre os
vossos estudos ou trabalho. Digam o que fazem nos tempos livres.
Podem tamb&eacute;m contar alguma coisa sobre a vossa fam&iacute;lia
e o meio em que vivem. </P>
<P>
&Eacute; importante que sensivelmente 75% da primeira carta seja
escrita na vossa l&iacute;ngua materna. V&aacute;rias s&atilde;o
as raz&otilde;es para que assim seja: </P>
<UL>
<LI>Por um lado, o vosso par quer aprender a vossa l&iacute;ngua
materna e a melhor forma de o fazer &eacute; seguindo bons modelos.
(E como ele/ela tamb&eacute;m te escreve na sua l&iacute;ngua
materna, ter&aacute;s a mesma oportunidade de aprender).
<LI>Por outro lado, quem est&aacute; a aprender uma nova l&iacute;ngua
t&ecirc;m tend&ecirc;ncia para falar ou escrever apenas sobre
aquilo que est&aacute; seguro de poder expressar correctamente
na outra l&iacute;ngua e para evitar as informa&ccedil;&otilde;es
que n&atilde;o sabe dar sem problemas. Por outras palavras, se
querem conseguir comunicar tamb&eacute;m coisas mais complicadas
utilizando um vocabul&aacute;rio correcto, devem dar as primeiras
informa&ccedil;&otilde;es na vossa l&iacute;ngua materna. 
</UL>

<H3>A segunda carta</H3>

<P>
As restantes cartas diferenciam-se da primeira sobretudo porque
v&ecirc;m na sequ&ecirc;ncia do que escreverem os vossos colegas:
</P>
<UL>
<LI>podem fazer as perguntas que quiserem para esclarecer alguma
d&uacute;vida - quer referentes ao conte&uacute;do, quer &agrave;
forma lingu&iacute;stica e, claro est&aacute;, v&atilde;o ter
que responder &agrave;s perguntas dos vossos colegas. 
<LI>Podem corrigi-los quando cometerem erros porque com os erros
tamb&eacute;m se aprende. Mas cuidado: n&atilde;o queiram corrigir
tudo. Isto seria demais tanto para os vossos colegas como para
v&oacute;s.
</UL>

<P>
De qualquer modo, &eacute; sempre bom continuar a discuss&atilde;o
de um tema na mesma l&iacute;ngua em que se come&ccedil;ou a discuti-lo.</P>

<H3>Mais ajuda para o trabalho em Tandem</H3>

<P>
Estamos aqui para vos fazer mais sugest&otilde;es e esclarecimentos
sobre o trabalho em Tandem. Podem encontr&aacute;-los nas nossas
p&aacute;ginas WWW:</P> http://www.slf.ruhr-uni-bochum.de/email/deupor/deupor.html
<P>
Se n&atilde;o t&ecirc;m nenhuma forma de acesso &agrave; World
Wide Web, os colaboradores do programa Tandem da vossa Universidade
podem ajudar-vos.
<P>
Sempre que queiram, podem pedir conselhos aos outros participantes
de uma subrede. Para isto, basta enviar uma mensagem para o nosso
f&oacute;rum:
<P Align="Center">
<TT>deu-por@tandem.uni-trier.de</P></TT>
<P>
Ou ent&atilde;o podem dirigir-se a n&oacute;s, os coordenadores
do DEU-POR.
<P Align="Center">
Adelaide Chichorro, Universidade de Coimbra (PO)</P>
<P Align="Center">
<TT>adelaide@cygnus.ci.uc.pt</P></TT>
<P Align="Center">
Karl Heinz Delille, Universidade de Coimbra (PO)</P>
<P Align="Center">
<TT>delille@cygnus.ci.uc.pt</P> Divirtam-se e tenham muito &ecirc;xito
na vossa aprendizagem em tandem por e-mail.</TT>
<P>
[<A HREF="#auf_deutsch">zum Anfang</A>] [<A HREF="#em_portugues">para o in&iacute;cio</A>]
[<A HREF="hints.html">&Iacute;ndice</A>]</P>
<HR>

<P>
[<A NAME="auf_deutsch">auf deutsch</A>] [<A HREF="#em_portugues">em portugu&ecirc;s</A>]
[<A HREF="hints.html">&Iacute;ndice</A>]
<H1 Align="Center">Die ersten Briefe</H1>

<H2>Hinweise der Tandempartnervermittlung </H2>

<P>
... wenn sie f&uuml;r Euch einen Partner bzw. eine Partnerin gefunden
hat.</P>
<P>
Hallo,</P>
<P>
oben findet Ihr die Adresse Eures Tandempartners bzw. Eurer Tandempartnerin.
Schreibt Euch gegenseitig schnell eine kurze Nachricht (z.B. &quot;Hallo,
ich habe Deine Adresse. Mehr am Montag. Gru&szlig; Ferdi&quot;),
damit die Verbindung schon mal hergestellt ist. Am besten, Ihr
macht das sofort, bevor Ihr weiterlest ... </P>
<H3>Wenn er oder sie nicht antwortet ...</H3>

<P>
Solltet Ihr in den n&auml;chsten 8 Tagen nichts von Eurem Partner
h&ouml;ren, dann schreibt uns sofort. Wir suchen Euch dann eine
neue Adresse. </P>
<H3>Partnerwechsel ...</H3>

<P>
... ist beim Lernen im Tandem nichts Schlimmes, im Gegenteil:
von neuen Partnern k&ouml;nnt Ihr auch Neues lernen. Wann immer
Ihr eine neue Partneradresse haben wollt, schreibt uns einfach.
</P>
<P>
Unsere Adresse: <TT>tandem@slf.ruhr-uni-bochum.de</P></TT>
<H3>Wie lernt man eigentlich im Tandem?</H3>

<P>
Dazu wollen Euch Adelaide, Karl Heinz Delille und Markus Stumm,
die Koordinatoren des deutsch-portugiesischen Teilnetzes, noch
einige Tips geben. Lest einfach weiter. </P>
<P>
Wir verabschieden uns von Euch und w&uuml;nschen Euch viel Spa&szlig;</P>
<P>
Euer Tandempartnervermittlungsteam (Isa, Heike &amp; Dawn)</P>
<HR>

<H2>Hinweise der Teilnetzkoordinatoren</H2>

<P>
Die Koordinatoren des Teilnetzes werden Euch folgenden Brief schreiben:</P>
<P Align="Center">
<I><B>International E-Mail Tandem Network</P></B></I>
<P Align="Center">
<STRONG>Deutsch-portugiesisches Teilnetz: DEU-POR </P></STRONG>
<P>
Liebe Tandempartner,</P>
<P>
wir sind Adelaide, Karl-Heinz Delille und Markus, die Koordinatoren
von DEU-POR, und wir freuen uns, da&szlig; Ihr beiden jetzt damit
beginnen k&ouml;nnt, per E-Mail im Tandem zusammenzuarbeiten.
</P>
<P>
Vielleicht seid Ihr ja schon erfahrene E-Mail-Tandem-Lerner -
dann w&uuml;nschen wir Euch einfach nur viel Spa&szlig; und viel
Erfolg bei Eurer Zusammenarbeit. </P>
<P>
Wenn nicht, dann haben wir hier ein paar Tips f&uuml;r Euch:</P>
<H3>Wie sollen wir anfangen?</H3>

<P>
Habt Ihr schon den ersten ganz kurzen Gru&szlig; an Euren Partner
geschickt, damit er oder sie wei&szlig;, da&szlig; Ihr mitmachen
wollt? Dann k&ouml;nnt Ihr jetzt Euren ersten richtigen Tandembrief
schreiben. </P>
<H3>Unser Vorschlag: </H3>

<P>
Stellt Euch erst einmal vor: Erz&auml;hlt von Eurem Studium oder
Eurer Arbeit; sagt, was Ihr in Eurer Freizeit tut; vielleicht
berichtet Ihr auch ein wenig &uuml;ber Eure Umgebung und Familie.
</P>
<P>
Wichtig ist, da&szlig; Ihr <STRONG>etwa 75% Eures ersten Briefes
in Eurer Muttersprache</STRONG> schreibt. Warum? Es gibt daf&uuml;r
gewichtige Gr&uuml;nde: </P>
<UL>
<LI>Zum einen will Eure Partnerin bzw. Euer Partner ja von Euch
Eure Muttersprache lernen, und man lernt am besten durch gute
Vorbilder. (Und da sie/er auch in ihrer/seiner Muttersprache schreibt,
lernt Ihr selbst genau so viel von ihr/ihm.)
<LI>Der zweite Grund h&auml;ngt damit zusammen, da&szlig; man
als Lerner immer die Tendenz hat, nur das zu sagen/schreiben,
was man sicher in der Fremdsprache ausdr&uuml;cken kann, und <EM>die</EM>
Informationen nicht zu geben, die man nicht problemlos ausdr&uuml;cken
kann. Wenn Ihr also erreichen wollt, da&szlig; Ihr auch &uuml;ber
kompliziertere Sachverhalte mit dem richtigen Vokabular kommunizieren
k&ouml;nnt, dann sollten die ersten Informationen in der Muttersprache
gegeben werden. 
</UL>

<H3>Der zweite Brief</H3>

<P>
Alle weiteren Briefe unterscheiden sich vom ersten vor allem dadurch,
da&szlig; Ihr jetzt auf das eingehen k&ouml;nnt, was Eure Partner
geschrieben haben. </P>
<UL>
<LI>Ihr k&ouml;nnt dazu Fragen stellen, wenn Ihr nicht alles verstanden
habt - sprachlich und inhaltlich. Und Ihr solltet nat&uuml;rlich
auf ihre Fragen antworten. 
<LI>Ihr k&ouml;nnt sie korrigieren, wenn sie Fehler gemacht haben
- auch durch Korrekturen lernt man. Aber Vorsicht: versucht nicht,
<EM>alles</EM> zu korrigieren, damit &uuml;berfordert Ihr Euch
und Eure Partner. 
</UL>

<P>
In jedem Fall ist es immer eine gute Idee, ein Thema in <EM>der
</EM>Sprache weiterzubehandeln, in der es begonnen wurde. </P>
<H3>Weitere Hilfen zur Tandemarbeit</H3>

<P>
Ihr k&ouml;nnt auch jederzeit die anderen Teilnehmer in unserem
Teilnetz um Rat fragen, indem Ihr eine Nachricht an unser Forum
schickt: </P>
<P Align="Center">
<TT>DEU-POR@tandem.uni-trier.de</P></TT>
<P>
Oder wendet Euch an uns, die Koordinatoren von DEU-POR.</P>
<P>
Viel Spa&szlig; und Erfolg beim Lernen im E-Mail-Tandem w&uuml;nschen
Euch</P>
<P Align="Center">
Adelaide Chichorro, Universidade de Coimbra (PO)</P>
<P Align="Center">
<TT>adelaide@cygnus.ci.uc.pt</P></TT>
<P Align="Center">
Karl Heinz Delille, Universidade de Coimbra (PO)</P>
<P Align="Center">
<TT>delille@cygnus.ci.uc.pt</P></TT>
<P>
[<A HREF="#auf_deutsch">zum Anfang</A>] [<A HREF="#em_portugues">para o in&iacute;cio</A>]
[<A HREF="hints.html">&Iacute;ndice</A>]</P>
<HR>

<P>
&copy; 1996 Brammerts, D'Atri 
</BODY>

</HTML>
