<HTML><HEAD>
<TITLE>ESP-FRA
</TITLE>
</HEAD>
<BODY>
<H3 Align="Center"><em><A HREF="../infes.html">International E-Mail Tandem Network</A></em></H3>
<H2 Align="Center"><A HREF="espfra.html">ESP-FRA</A></H2>
<H1 Align="Center">Forum - Foro</H1>
<P>[<A HREF="espfra-w.doc">Winword</A>] [<A HREF="espfra-w.rtf">RTF</A>] (16.05.96)</P>
<HR>
<P><B><I>Los primeros pasos</I></B><br>
Para poder participar en el foro espa&ntilde;ol-franc&eacute;s de la Red T&aacute;ndem por Correo Electr&oacute;nico tienes que mandar</P>
<P>el mensaje <strong>subscribe esp-fra</strong><br>
a la direcci&oacute;n <strong>majordomo@tandem.uni-trier.de</strong></P>
<P>Recibir&aacute;s el siguiente mensaje biling&uuml;e de bienvenida.</P>
<P><B><I>Les premiers pas<br>
</I></B>Pour pouvoir participer au Forum franco-espagnol du R&eacute;seau Tandem par Courrier Informatique tu dois envoyer</P>
<P>le message <strong>subscribe esp-fra</strong><br>
&agrave; l'adresse <strong>majordomo@tandem.uni-trier.de</strong></P>
<P>Tu recevras alors le texte bilingue de bienvenue suivant.</P>
<HR>
<H1 Align="Center">Bienvenido/a en ESP-FRA<br>
Bienvenu/e au ESP-FRA</H1>
<P><strong>ESP-FRA</strong> es un <strong>foro de discusi&oacute;n espa&ntilde;ol-franc&eacute;s</strong> donde se encuentran personas que dominan una de las dos lenguas espa&ntilde;ol y franc&eacute;s, est&aacute;n aprendiendo la otra y desean conocer m&aacute;s detalles sobre los/las participantes de los otros pa&iacute;ses.</P>
<P><strong>ESP-FRA</strong> est un <strong>forum de discussion franco-espagnol</strong>, ou se rencontrent ceux qui ma&icirc;trisent l'une des deux langues, l'espagnol ou le fran&ccedil;ais, et souhaitent apprendre l'autre langue et en outre faire la connaissance des participant(e)s des autres pays.</P>
<H2>1.	El foro   - Le Forum</H2>
<P>Para poder participar en la discusi&oacute;n de este foro, lo &uacute;nico que tienes que hacer es enviar tus mensajes a <strong>la direcci&oacute;n del foro</strong>, y los ordenadores se encargar&aacute;n de distribuirlas autom&aacute;ticamente a los/las otros/as participantes.</P>
<P>Pour pouvoir participer &agrave; la discussion au sein de ce forum, il suffit que tu envoies tes messages &agrave; <strong>l'adresse du Forum</strong>; les ordinateurs se chargent alors de les transmettre aux autres participant(e)s.</P>
<table border>
<td>La <strong>dirección del foro</strong> es:<br>
Voici <strong>l'adresse du Forum</strong>:<td><strong><br>
esp-fra@tandem.uni-trier.de</strong><tr>
</table>
<P>Para empezar, te sugerimos que, como novato/a, <strong>te presentes</strong> a los otros participantes escribiendo s&oacute;lo una lineas en tu lengua materna o, mejor a&uacute;n, en ambos idiomas. Es posible que as&iacute; ya se pongan en contacto contigo otros participantes que por tener intereses comunes a los tuyos deseen saber algo m&aacute;s de ti.</P>
<P>Il est souhaitable que tu <strong>te pr&eacute;sentes</strong> comme nouveau participant/nouvelle participante au Forum: quelques lignes dans ta langue maternelle ou - mieux encore - dans les deux langues suffisent. Il se peut alors que d'autres participant(e)s ayant les m&ecirc;mes centres d'int&eacute;r&ecirc;t que toi et d&eacute;sirant mieux faire ta connaissance, se mettent imm&eacute;diatement en contact avec toi.</P>
<P>En este foro podr&aacute;s escribir sobre lo que quieras: podr&aacute;s pedir y dar informaciones, contribuir con opiniones propias, relatar experiencias personales etc. Cada uno/a podr&aacute; escribir en su lengua materna, en el otro idioma o en los dos. Lo importante es que el n&uacute;mero de contribuciones sea aproximado en ambos idiomas para que todos/as tengan m&aacute;s o menos las mismas oportunidades de leer y escribir en la lengua extranjera.</P>
<P>Dans ce forum tu peux absolument aborder tous les sujets qui te pr&eacute;occupent. Tu peux demander des informations, apporter toi-m&ecirc;me des informations, exprimer tes id&eacute;es sur un sujet, tu peux apporter le t&eacute;moignage d'exp&eacute;riences personnelles etc. Chacun peut s'exprimer dans sa langue maternelle, dans la langue qui lui est &eacute;trang&egrave;re ou dans les deux. L'important est toutefois que les nombres des contributions s'&eacute;quilibrent dans les deux langues, afin que de fa&ccedil;on &eacute;gale la possibilit&eacute; soit donn&eacute;e &agrave; tous de lire et d'&eacute;crire dans la langue &eacute;trang&egrave;re.</P>
<H2>2.	Compa&ntilde;eros/as t&aacute;ndem  –  Les partenaires de Tandem</H2>
<P>Aprovechar&aacute;s a&uacute;n m&aacute;s si estableces correspondencia con un/a compa&ntilde;ero/a t&aacute;ndem. (Se habla de <strong>t&aacute;ndem</strong> cuando 2 personas de culturas distintas colaboran en el aprendizaje del idioma del compa&ntilde;ero o de la compa&ntilde;era.) Entre dos no solamente podr&eacute;is tratar temas que no quer&aacute;is compartir con todo el mundo, sino - lo que es m&aacute;s importante - tendr&eacute;is la oportunidad de ayudaros mutuamente a trav&eacute;s de correcciones, consejos, preguntas etc.</P>
<P>Tu as la possibilit&eacute; d'approfondir encore plus tes connaissances si tu entres en correspondance avec un ou une partenaire de Tandem. (On parle de <strong>Tandem</strong> lorsque deux personnes de cultures diff&eacute;rentes travaillent ensemble pour apprendre r&eacute;ciproquement la langue du ou de la partenaire.) A deux il vous est possible d'aborder entre vous des sujets, dont vous ne d&eacute;sirez pas parler avec les autres; l'important est que vous vous aidiez mutuellement en vous corrigeant, en vous donnant des conseils, en vous posant des questions etc.</P>
<P>Para que te podamos facilitar una pareja t&aacute;ndem, puedes escribir un mensaje breve al <strong>servicio de facilitaci&oacute;n de parejas t&aacute;ndem</strong>: <em>"Foro ESP-FRA. Lengua primera: espa&ntilde;ol. Aprendo franc&eacute;s. Busco compa&ntilde;ero/a t&aacute;ndem."</em> </P>
<P>Pour obtenir un/e partenaire de Tandem tu peux envoyer un message tout court au <strong>service de r&eacute;partition de partenaires de Tandem</strong>:<em> "Forum ESP-FRA. Langue primaire: fran&ccedil;ais. J'apprends l'espagnol. Je cherche un/e partenaire de Tandem."</em></P>
<table border>
<td>La dirección del <strong>servicio de facilitación de parejas</strong> es:<br>
L'adresse <strong>pour obtenir un/e partenaire</strong> est:<td><strong><br>
tandem@slf.ruhr-uni-bochum.de</strong><tr>
</table>
<P><strong>Profesores</strong> que quieren incluir t&aacute;ndem por corrreo electr&oacute;nico en sus clases de ingl&eacute;s o espa&ntilde;ol, deber&iacute;an ponerse en contacto con los coordinadores de ESP-FRA (direcciones al final de este texto).</P>
<P>Les <strong>professeurs</strong> qui veulent incluir tandem par courrier &eacute;lectronique dans leurs classes de fran&ccedil;ais ou d'anglais sont pri&eacute;s de se mettre en contact avec les coordinateurs de ESP-FRA (les addresses se trouvent &agrave; la fin de ce texte).</P>
<H2>3.	Otros servicios de la red  - Les autres services du r&eacute;seau</H2>
<P>En esta red tenemos como responsable de los asuntos administrativos un programa al que pod&eacute;is mandar &oacute;rdenes de diverso tipo. Pero estas &oacute;rdenes deber&aacute;n estar bien formuladas (una orden por linea) para no confundir al programa. Por el momento el programa s&oacute;lo entiende y "habla" ingl&eacute;s.</P>
<P>Dans ce r&eacute;seau vous disposez tout comme nous d'un programme destin&eacute; aux t&acirc;ches administratives auquel vous pouvez envoyer les ordres les plus vari&eacute;s. Afin que le programme ne soit pas perturb&eacute;, ces ordres doivent &ecirc;tre formul&eacute;s clairement (un ordre par ligne). Actuellement les services programm&eacute;s ne comprennent et ne "parlent" qu'anglais.</P>
<table border>
<td>La dirección del <strong>programa de servicio</strong> es:<br>
<strong>L'adresse de ce programme</strong> est:<td><strong><br>
majordomo@tandem.uni-trier.de</strong><tr>
</table>
<P>Por ejemplo, si no deseas recibir m&aacute;s correo de ESP-FRA, le mandas una de estas dos &oacute;rdenes:<br>
Si, par exemple, tu ne d&eacute;sires plus recevoir de courrier de ESP-FRA, tu lui adresses l'un des deux ordres suivants:</P>
<P><strong>unsubscribe esp-fra</strong><br>
<em>para salir del foro para siempre<br>
pour quitter d&eacute;finitivement le Forum</em></P>
<P>Otras &oacute;rdenes importantes son:<br>
D'autres ordres importants &agrave; conna&icirc;tre sont:</P>
<P><strong>who esp-fra</strong><br>
<em>para saber qui&eacute;nes son los dem&aacute;s participantes de ESP-FRA<br>
pour savoir qui sont les autres participants de ESP-FRA</em></P>
<P><strong>help</strong><br>
<em>para saber m&aacute;s sobre las &oacute;rdenes de que el programa de servicio dispone<br>
pour savoir quels sont les autres ordres dont disposent les services programm&eacute;s</em></P>
<P></P>
<P>Para m&aacute;s informaci&oacute;n puedes dirigirte al foro ESP-FRA o a nosotros, los coordinadores de esta red parcial.</P>
<P>Si tu as des questions &agrave; poser, adresse-toi au Forum ESP-FRA ou bien directement &agrave; nous, les coordinateurs de ce r&eacute;seau.</P>
<P>¡Que te diviertas!  - Amuse-toi bien!</P>
<table border>
<td align="Center"><strong>Miguel Jiménez</strong><br>
jimenez@cal.enst.fr<br>
Département des Langues Vivantes<br>
ENST <br>
Paris (F)<td align="Center"><strong>Antonio Niembro Prieto</strong><br>
niembro@pinon.ccu.uniovi.es<br>
Dpto. de Filología Anglogermánica y Francesa<br>
Universidad de Oviedo (E) <br>
<tr>
</table>
<P>
</P>
</BODY></HTML>
