<html>
<head>
<title>TP Gdb</title>
</head>

<body bgcolor="#ffffff">

<center>
<img src="//www.enst.fr/gif/lignes/rouj.gif">
<h1>TP Gdb</h1>
<h3>
<a href="http://www.enst.fr">ENST</a>
 - 
<a href="http://www.enst.fr/~pautet/dominante.html">Dominante Informatique</a>
 -
<a href="http://www.enst.fr/~domeo">Module EO</a>
</h3>
<h3><i><a href="http://www.enst.fr/~elc">Eric Lecolinet</a></i></h3>
</h1>
<p>
</center>

<img src="//www.enst.fr/gif/lignes/rouj.gif">
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<h2>Sommaire</h2>
<ol>
<li><a href="#section1">Introduction</a>
<menu>
<li><a href="#section11">Pr&eacute;liminaires</a>
<li><a href="#section12">Compilation des programmes</a>
<li><a href="#section13">Lancement de xxgdb</a>
</menu>
<li><a href="#section2">Utilisation de xxgdb</a>
<menu>
<li><a href="#section21">Lancer l'ex&eacute;cution</a>
<li><a href="#section22">Points d'arr&ecirc;t</a>
<li><a href="#section23">Contr&ocirc;le de l'ex&eacute;cution</a>
<li><a href="#section24">Compl&eacute;ments sur les points d'arr&ecirc;t</a>
<li><a href="#section25">Visualisation des variables</a>
<li><a href="#section26">Visualiser (et se d&eacute;placer dans) la pile</a>
</menu>
<li><a href="#section3">Interruptions</a>
<li><a href="#section4">Compl&eacute;ments</a>
<menu>
<li><a href="#section41">Aide en ligne</a>
<li><a href="#section42">Abr&eacute;viations</a>
<li><a href="#section43">Recompilation</a>
<li><a href="#section44">Appel de gdb depuis emacs</a>
<li><a href="#section45">Appel de fonctions</a>
<li><a href="#section46">Autres commandes utiles</a>
</menu>
<li><a href="#section5>Exercices</a>
<menu>
<li><a href="#section51">Tri d&eacute;croissant et alphab&eacute;tique</a>
<li><a href="#section52">V&eacute;rification des entr&eacute;es</a>
<li><a href="#section53">M&eacute;moire dynamique</a>
<li><a href="#section54">Sauvegarde et relecture</a>
</menu>
</ol>

<img src="//www.enst.fr/gif/lignes/rouj.gif">

<a name="section1">
<h2>1. Introduction</h2>
<b>gdb</b> est un <b>debugger symbolique</b>, c'est-&agrave;-dire un utilitaire
<b>Unix</b> permettant de contr&ocirc;ler le d&eacute;roulement de programmes C, C++,
Pascal ou Fortran. Gdb permet (entre autres) de mettre des
points d'arr&ecirc;t dans un programme, de visualiser l'&eacute;tat de sa
pile d'ex&eacute;cution ou de ses variables, de calculer des
expressions, d'appeler interactivement des fonctions, etc.
<p>
<b>xxgdb</b> est une interface graphique qui facilite l'utilisation
de gdb sous X-Window. C'est l'utilitaire que nous allons utiliser dans ce TP.
L'interface <b>mxgdb</b> est &eacute;galement parfois disponible SGDG.
<p>
D'autres debuggers sont &eacute;galement disponibles &agrave; l'Ecole,
suivant les salles et les machines. Leur syntaxe est
l&eacute;g&egrave;rement diff&eacute;rente, mais le principe g&eacute;n&eacute;ral reste le
m&ecirc;me. Le plus courrant est <b>dbx</b> qui peut &eacute;galement &ecirc;tre
appel&eacute; via une interface graphique sous X-Window &agrave; l'aide des
commandes <b>debugger</b> ou <b>dbxtool</b> (suivant la version
du syst&egrave;me d'exploitation).
<p>
<b>Attention:</b> le debugger n'est pas toujours independant du compilateur.
Ainsi, seules les combinations suivantes sont toujours valides sur toutes
les stations Sun :
<ul>
<li>
compilateur <b>gcc</b> + debugger <b>gdb</b> (ou <b>xxgdb</b> ou <b>mxgdb</b>)
<li>
compilateur <b>cc</b> + debugger <b>dbx</b> (ou <b>debugger</b> ou <b>dbxtool</b>)
</ul>
<p>
Enfin, certains debuggers (et en particulier gdb) peuvent &ecirc;tre directement 
appel&eacute; depuis les &eacute;diteurs de texte <b>emacs</b> et <b>xemacs</b>.
Ceci permet de b&eacute;n&eacute;ficier d'un environnement de d&eacute;veloppement int&eacute;gr&eacute;
(plus ou moins) similaire &agrave; ce que l'on peut aujourd'hui trouver dans le
"monde PC". Cette possibit&eacute; sera expliqu&eacute;e &agrave; la fin du TP.
<p>

<a name="section11">
<h3>1.1 Pr&eacute;liminaires</h3>
Cr&eacute;er un nouveau r&eacute;pertoire (sous votre compte) et y copier
les <b>fichiers sources</b> (sans oublier les "<b>.h</b>" et le
"<b>Makefile</b>" !) qui se trouvent dans :
<pre>
	<b><tt>~domeo/TP-gdb</tt></b>
</pre>
Votre r&eacute;pertoire devra alors contenir :
<ul>
<li>
deux fichiers contenant du code source en C : 
<a href="http://www.enst.fr/~domeo/TP-gdb/tri.c">tri.c</a>
et <a href="http://www.enst.fr/~domeo/TP-gdb/donnees.c">donnees.c</a>
<li>
deux fichiers en-t&ecirc;tes (ou "headers") contenant les d&eacute;clarations 
correspondantes :
<a href="http://www.enst.fr/~domeo/TP-gdb/tri.h">tri.h</a>
et <a href="http://www.enst.fr/~domeo/TP-gdb/donnees.h">donnees.h</a>
<li>
un fichier 
<a href="http://www.enst.fr/~domeo/TP-gdb/Makefile">Makefile</a> 
contenant les r&egrave;gles n&eacute;cessaires &agrave; la compilation 
des deux fichiers C et &agrave; la production de l'ex&eacute;cutable.
</ul>
Tous ces fichiers sont n&eacute;cessaires pour compiler correctement
le programme.
<p>

<a name="section12">
<h3>1.2 Compilation des programmes</h3>
Les programmes C doivent &ecirc;tre compil&eacute;s avec le compilateur <b>gcc</b>
avec <b>l'option -g</b> pour pouvoir &ecirc;tre d&eacute;bugg&eacute;s par <b>gdb</b>.
<p>
Si l'on utilise un <b>Makefile</b> (comme c'est le cas ici), 
il faut que la variable <b><tt>CFLAGS</tt></b>
contienne l'option <b><tt>-g</tt></b>.
<br>
Ainsi la ligne :
<pre>
	<b><tt>CFLAGS   =  -g</tt></b>
</pre>
du Makefile indique que les fichiers C seront compil&eacute;es 
avec l'option -g afin de pouvoir &ecirc;tre d&eacute;bugg&eacute;s.
<p>
D'autre part, la ligne:
<pre>
	<b><tt>.KEEP_STATE:</tt></b>
</pre>
plac&eacute;e en d&eacute;but de Makefile provoque &agrave; chaque appel de la
commande <b>make</b> :
<ul>
<li>la d&eacute;termination automatique des d&eacute;pendances
<li>la recompilation automatique des fichiers concern&eacute;s
chaque fois qu'une option de compilation ou qu'une
d&eacute;pendance a &eacute;t&eacute; modifi&eacute;e.
</ul>
<p>
Compiler les fichiers et cr&eacute;er l'ex&eacute;cutable en tapant la
commande : <b><tt>	make</tt></b>
<p>

<a name="section13">
<h3>1.3. Lancement de xxgdb</h3>
pour lancer le d&eacute;bugger, tapez :
<p>
<pre>
	<tt><b>xxgdb  <i>nom-du-programme-&agrave;-debugger</i></b></tt>
</pre>
<p>
dans une fen&ecirc;tre shell (par exemple une fen&ecirc;tre <tt>"xterm"</tt>).
<p>
Apr&egrave;s quelques secondes n&eacute;cessaires &agrave; l'initialisation et &agrave;
la lecture des fichiers &agrave; d&eacute;bugger, <b>gdb</b> entre en mode commande
et attend les instructions de l'utilisateur.
<p>
On doit alors voir appara&icirc;tre sur l'&eacute;cran une 
<a href="http://www.enst.fr/~domeo/TP-gdb/xxgdb.gif">fen&ecirc;tre xxgdb</a>
qui comprend deux ou trois zones de texte:
<ul>
<li>celle du haut (la fen&ecirc;tre source) sert &agrave; afficher le
fichier courant
<li>celle du milieu (la fen&ecirc;tre de commande) sert &agrave; taper
des commandes gdb.
<li>celle du bas (la fen&ecirc;tre de visualisation) sert &agrave;
afficher le contenu de certaines variables. (Cette
fen&ecirc;tre n'est normalement pas visible au lancement de xxgdb).
</ul>
<p>
On peut alors utiliser xxgdb de deux mani&egrave;res:
<ul>
<li>soit en tapant des commandes dans la deuxi&egrave;me fen&ecirc;tre.
<li>soit en cliquant sur les boutons situ&eacute;s entre la
fen&ecirc;tre source et la fen&ecirc;tre de commande. Ces boutons
ont le m&ecirc;me effet que si les commandes &eacute;taient tap&eacute;es en toutes lettres.
</ul>

<img src="//www.enst.fr/gif/lignes/rouj.gif">

<a name="section2">
<h2>2. Utilisation de xxgdb</h2>

<a name="section21">
<h3>2.1. Lancer l'ex&eacute;cution</h3>
Pour lancer l'ex&eacute;cution du programme taper:
<pre>
	<tt><b>run  <i>arguments-du-programme</i></b></tt>
</pre>
ou cliquer sur le bouton <b>run</b> (si le programme n'a pas
d'argument)
<p>
<b>gdb</b> ex&eacute;cute alors le programme comme s'il avait &eacute;t&eacute; lanc&eacute;
normalement. L'ex&eacute;cution se poursuit jusqu'&agrave; la fin du programme sauf:
<ul>
<li>si l'on a mis des points d'arr&ecirc;t (voir paragraphe suivant)
<li>s'il y a une erreur (un "bug") et que le programme plante
<li>si l'utilisateur tape <b>^C</b> (touches CONTROL et C appuy&eacute;es simultan&eacute;ment)
</ul>
<p>
Tant que le programme "tourne", il n'est pas possible
d'entrer de nouvelles commandes gdb (celles-ci ne seront
effectu&eacute;es que lorsque le programme s'arr&ecirc;tera). gdb est
alors en mode <i>ex&eacute;cution</i>. La seule fa&ccedil;on de revenir en mode
<i>commande</i> pendant l'ex&eacute;cution d'un programme est de taper ^C.

<h4>Exemple:</h4>
Apr&egrave;s avoir compil&eacute; le programme <i>tri</i>, lancer <b>xxgdb</b> 
et ex&eacute;cuter le programme. Entrer les donn&eacute;es demand&eacute;es (2 ou 3
noms suffisent) et terminer la saisie en entrant un point
suivi d'un "retour-chariot". Attention: le programme n'est
pas complet (ce sera a vous de le compl&eacute;ter), seule la
premi&egrave;re option de <i>tri</i> (par age croissant) est impl&eacute;ment&eacute;e.

<a name="section22">
<h3>2.2. Points d'arr&ecirc;t</h3>
Les points d'arr&ecirc;t servent &agrave; interrompre l'ex&eacute;cution et &agrave;
revenir au mode commande &agrave; un endroit donn&eacute; du programme.
<p>
Pour s'arr&ecirc;ter au debut d'une fonction, faire :
<pre>
         <tt><b>break  <i>nom-de-la-fonction</i></b></tt>
</pre>
<p>
Pour s'arr&ecirc;ter dans le corps d'une fonction faire:
<pre>
         <tt><b>break  <i>num&eacute;ro-de-ligne</i></b></tt>
</pre>
<p>
L'ex&eacute;cution sera alors interrompue <i>juste avant</i> cette ligne.
<p>
On peut :
<ul>
<li>
soit taper la commande en toutes lettres dans la fen&ecirc;tre de commande,
<li>
soit selectionner le nom de la fonction ou la ligne ou l'on veut s'arr&ecirc;ter
dans la fen&ecirc;tre source &agrave; l'aide de la souris, puis cliquer sur le bouton 
<b>break</b>.
</ul>
<p>
Dans les deux cas un marqueur s'affiche alors dans la
fen&ecirc;tre source pour signaler la pr&eacute;sence d'un point d'arr&ecirc;t.

<h4>Exemple:</h4>
Mettre un point d'arr&ecirc;t au d&eacute;but de la fonction <i>Choix</i> puis
relancer l'ex&eacute;cution du programme depuis le debut en cliquant sur 
le bouton <b>run</b>. Entrer de nouveau les donn&eacute;es.
Lorsque l'ex&eacute;cution s'interrompt, le fichier contenant le point d'arr&ecirc;t 
correspondant s'affiche dans la fen&ecirc;tre source et une fl&egrave;che horizontale 
indique la ligne courante (le programme s'arr&ecirc;te juste avant cette ligne).

<a name="section23">
<h3>2.3. Contr&ocirc;le de l'ex&eacute;cution</h3>
La commande:
<ul>
<li><b>step</b> ex&eacute;cute une ligne de code (i.e. la ligne point&eacute;e
par la fl&egrave;che)
<li><b>next</b> fait de m&ecirc;me mais en sautant les proc&eacute;dures ou fonctions
<li><b>cont</b> continue jusqu'au prochain point d'arr&ecirc;t
</ul>
<p>
La diff&eacute;rence entre <b>step</b> et <b>next</b> est que step permet
d'"entrer" dans les fonctions pour les ex&eacute;cuter pas &agrave; pas
alors que next les ex&eacute;cute sans s'arr&ecirc;ter.

<h4>Exemple:</h4>
Le programme &eacute;tant toujours arr&eacute;t&eacute; dans la fonction <i>Choix</i>,
continuer l'ex&eacute;cution pas pas au moyen de la commande <b>next</b>
(ne pas oublier d'entrer une valeur quand vous arriverez au
"scanf").
<p>
Relancer le programme en cliquant sur <b>run</b> et re-entrer les
donn&eacute;es. Le programme s'arr&ecirc;tera &agrave; la m&ecirc;me ligne que
pr&eacute;c&eacute;demment. Continuer l'ex&eacute;cution en utilisant cette fois
la commande <b>step</b>. Que constate-t'on ?
<p>
Rajouter un point d'arr&ecirc;t au debut de la fonction <i>Trier</i> et
juste avant la deuxi&egrave;me boucle <i>for</i> de cette m&ecirc;me fonction.
Relancer l'ex&eacute;cution et faire de m&ecirc;me que p&eacute;c&eacute;demment mais
en utilisant cette fois la commande <b>cont</b>.
<p>
Conclusions ?
<p>

<a name="section24">
<h3>2.4. Compl&eacute;ments sur les points d'arr&ecirc;t</h3>

<img src=//www.enst.fr/gif/blueball.gif>
Pour afficher la liste des points d'arr&ecirc;t faire:
<pre>
      <tt><b>info  <i>breakpoints</i></b></tt>
</pre>
ou plus simplement:
<pre>
      <tt><b>info  <i>b</i></b></tt>
</pre>

<p><img src=//www.enst.fr/gif/blueball.gif>
Pour effacer un point d'arr&ecirc;t faire:
<pre>
      <tt><b>clear  <i>num&eacute;ro-de-ligne</i></b></tt>
</pre>
&agrave; l'aide du bouton <b>clear</b> (apres avoir s&eacute;lectionn&eacute; cette ligne
&agrave; la souris) ou en tapant directement la commande.

<p><img src=//www.enst.fr/gif/blueball.gif>
Pour mettre un point d'arr&ecirc;t dans une fonction qui est dans
un autre fichier que celui qui est affich&eacute; l'&eacute;cran:

<ul>
<li>1&egrave;re solution :
<br>
- s&eacute;lectionner et visualiser ce fichier en cliquant sur le bouton <b>file</b>
et en choisissant dans une liste.
<br>
- puis faire comme pr&eacute;c&eacute;demment
<p>

<li>2eme solution : 
<br>
taper la commande :
<pre>
      <tt><b>break  <i>nom-du-fichier.c:nom-de-la-fonction</i></b></tt>
</pre>
(ne pas oublier le ".c" et le ":")
</ul>
<b>Exemple:</b>
<p>
Mettre un point d'arr&ecirc;t dans les fonctions <i>Lire</i> et <i>Afficher</i>.

<a name="section25">
<h3>2.5. Visualisation des variables</h3>
Lorsque le programme est <b>arr&ecirc;t&eacute;</b> dans une fonction, on peut visualiser 
ses variables au moyen de la commande ou du bouton <b>print</b>.
<p>
On peut soit taper en toutes lettres :
<pre>
	<tt><b>print  <i>nom-de-la-variable</i></b></tt>
</pre>
ou bien cliquer sur le bouton <b>print</b> apr&egrave;s avoir s&eacute;lectionn&eacute; la variable
avec la souris dans la fen&ecirc;tre contenant le texte source.

<h4>Exemple:</h4>
<p>
Relancer le programme avec les m&ecirc;mes points d'arr&ecirc;t que pr&eacute;c&eacute;demment 
et afficher le contenu des variables &agrave; chaque point d'arr&ecirc;t.
<p>
De mani&egrave;re plus g&eacute;n&eacute;rale, on peut afficher la valeur de
<b>n'importe quelle expression</b> valide en C

<h4>Exemples:</h4>
<p>
Dans la fonction <i>Trier</i>, afficher la valeur de:
<pre>
     <tt>swap, items[1], i + j, items[i].nom, items[i].age, etc...</tt>
</pre>
<p>
<b>Attention :</b> ces expressions n'ont de sens que si elles sont
<b>d&eacute;finies</b> (par exemple la variable <i>i</i> n'est correctement
initialis&eacute;e <b>qu'apr&egrave;s</b> la premi&egrave;re boucle <i>for</i>).

<h4>Compl&eacute;ments:</h4>
<p>
Pour afficher la valeur point&eacute;e par un pointeur faire :
<pre>
      <tt><b>print*  <i>nom-de-la-variable</i></b></tt>
</pre>
Pour afficher de mani&egrave;re permanente le contenu d'une variable
ou d'une expression, faire:
<pre>
      <tt><b>display  <i>expression</i></b></tt>
</pre>
Le contenu de cette variable est alors affich&eacute; dans la
fen&ecirc;tre "de visualisation" . Cet affichage sera r&eacute;actualis&eacute;
jusqu'&agrave; ce que l'on fasse:
<p>
<pre>
      <tt><b>undisplay  <i>expression</i></b></tt>
</pre>
<p>
Enfin, le bouton <b>locals</b> permet d'afficher toutes les variables
locales d'une fonction et le bouton <b>args</b>, ses arguments.
<p>

<a name="section26">
<h3>2.6. Visualiser (et se d&eacute;placer dans) la pile</h3>
La commande:
<ul>
<li><b>where</b> (ou le bouton <b>stack</b>) visualise la pile
d'ex&eacute;cution, c'est-&agrave;-dire la liste des fonctions ou
proc&eacute;dures empil&eacute;es jusqu'&agrave; celle o&ugrave; l'on est
momentan&eacute;ment arr&ecirc;t&eacute;. <b>where</b> affiche &eacute;galement les
num&eacute;ros de lignes correspondants.
<li><b>up</b> permet de remonter dans la liste
<li><b>down</b> permet de redescendre dans la liste
</ul>
<h4>Exemple:</h4>
On doit th&eacute;oriquement se trouver dans la fonction <i>Trier</i>.
Si ce n'est pas le cas, relancer l'ex&eacute;cution jusqu'a cette fonction.
<p>
Cliquer sur le bouton <b>where</b> pour afficher la pile, puis
utiliser les commandes <b>up</b> et <b>down</b> pour se d&eacute;placer dans la pile.
<p>
Afficher les variables de la fonction <i>Trier</i>, puis celles de
la fonction <i>Choix</i>, et enfin celles de la fonction <i>main</i>.
<p>
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<a name="section3">
<h2>3. Interruptions</h2>
De m&ecirc;me que les points d'arr&ecirc;ts, les interruptions arr&ecirc;tent
le d&eacute;roulement du programme. Dans le cas qui nous interesse,
celles-ci sont principalement de deux types :
<ul>
<li>interruption utilisateur, provoqu&eacute;e lorsque l'on tape <b>^C</b>
<li>interruptions syst&egrave;me dues &agrave; une erreur dans le programme 
(Segmentation Fault, Bus Error, etc...)
</ul>
<p>
Dans les deux cas, il est possible de voir o&ugrave; le programme
s'est arr&ecirc;t&eacute; et de visualiser l'&eacute;tat de ses variables.
Ce qui est &eacute;videmment tr&egrave;s pratique pour trouver les "bugs".

<h4>Exemple:</h4>
Relancer le programme et faire ^C au moment o&ugrave; le programme
demande le premier nom. Afficher o&ugrave; l'on se trouve dans la
pile &agrave; l'aide de la commande <b>where</b> ou du bouton <b>stack</b>.
<p>
<b>Remarque</b>: la commande <b>cont</b> permet alors de poursuivre
l'ex&eacute;cution normalement.
<p>
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<a name="section4">
<h2>4. Divers</h2>

<a name="section41">
<h3><img src=//www.enst.fr/gif/redball.gif> Aide en ligne</h3>
Faire :
<pre>
	<tt><b>help  <i>nom-de-commande</i></b></tt>
</pre>
pour obtenir de l'aide sur cette commande.
<p>

<a name="section42">
<h3><img src=//www.enst.fr/gif/redball.gif> Abr&eacute;viations</h3>
De nombreuses commandes peuvent &ecirc;tre abr&eacute;g&eacute;es. Par exemple:
<pre>
        <b>r</b>  pour <b>run</b>
        <b>b</b>  pour <b>break</b>
        <b>s</b>  pour <b>step</b>
        <b>n</b>  pour <b>next</b>
        <b>c</b>  pour <b>cont</b>
        <b>p</b>  pour <b>print</b>
	etc ....
</pre>
<p>
De plus, "retour-chariot" (sans rien taper d'autre) <b>r&eacute;ex&eacute;cute</b>
la derni&egrave;re commande entr&eacute;e.
<p>

<a name="section43">
<h3><img src=//www.enst.fr/gif/redball.gif> Recompilation</h3>
On peut recompiler le programme <b>sans sortir de gdb</b> en tapant 
directement sous gdb la commande:
<pre>
	<tt><b>make</b></tt>
</pre>
(<b>make</b> est une commande propre &agrave; gdb qui active la commande 
<b>make</b> habituelle d'Unix).

<a name="section44">
<h3><img src=//www.enst.fr/gif/redball.gif> Appel de gdb depuis emacs ou xemacs</h3>
Il est possible d'appeler <b>gdb</b> depuis l'&eacute;diteur de texte <b>emacs</b>
en tapant sous emacs la commande suivante:
<pre>
	<tt><b>ESC-X gdb</b></tt>
</pre>
<b>xemacs</b> poss&egrave;de &eacute;galement un bouton qui permet de lancer direcment gdb.
<p>
Noter que l'On peut &eacute;galement lancer la <b>compilation</b> depuis emacs au
moyen de la commande :
<pre>
	<tt><b>ESC-X compile</b></tt>
</pre>
<p>

<a name="section45">
<h3><img src=//www.enst.fr/gif/redball.gif> Appel interactif des fonctions</h3>
Les commandes :
<pre>
	<tt><b>print  <i>expression</i></b></tt>
	<tt><b>call  <i>fonction(arguments)</i></b></tt>
</pre>
<p>
permettent d'appeler <b>interactivement</b> les fonctions contenues 
dans le programme ainsi que la plupart des fonctions C des biblioth&egrave;ques 
standard (comme par exemple "printf" etc...). 
<p>
Ceci peut-&ecirc;tre tr&egrave;s utile pour tester rapidement le comportement d'une 
fonction dans la mesure o&ugrave; l'on peut changer interactivement les arguments
pass&eacute;s &agrave; cette fonction <b>sans avoir &agrave; recompiler</b> 
(surtout si l'on rajoute des points d'arrets dans cette fonction avant de 
l'appeler)

<h4>Exemple:</h4>
Relancer le programme en tapant la commande :
<pre>
	<tt><b>call  <i>main()</i></b></tt>
</pre>
<p>

<a name="section46">
<h3><img src=//www.enst.fr/gif/redball.gif> Autres commandes utiles</h3>
<ul>
<li><b>quit</b> : sort de gdb
<li><b>list fonction</b> : affiche cette fonction
<li><b>whatis</b> : informations sur une variable ou une fonction
<li><b>tbreak</b> : point d'arr&ecirc;t temporaire
<li><b>delete no</b> : enl&egrave;ve le point d'arr&ecirc;t num&eacute;ro <i>no</i>
<li><b>condition no condition</b> : stop conditionnel: s'arr&ecirc;te
quand la condition devient vraie
<li><b>ignore</b> : "attrappe" (ignore) les signaux donn&eacute;s en argument
<li><b>set var = expression</b> : affectation de variable
<li><b>cd, pwd</b> : comme sous Unix
</ul>
<p>
Pour plus d'informations faire : <tt><b>help commande</b></tt>
<p>
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<a name="section5">
<h2>5. Exercices</h2>
Le but des exercices est de compl&eacute;ter le programme tri.

<a name="section51">
<h3>5.1. Tri d&eacute;croissant et alphab&eacute;tique</h3>
compl&eacute;ter le programme afin de permettre un tri alphab&eacute;tique
ou d&eacute;croissant. (plusieurs solutions possibles) Comment
faire pour n'avoir &agrave; d&eacute;finir qu'une seule fonction de tri ?
(on pourra par exemple s'inspirer de la technique utilis&eacute;e
par la fonction standard qsort en regardant le manuel
interactif de cette fonction).

<a name="section52">
<h3>5.2. V&eacute;rification des entr&eacute;es</h3>
<ul>
<li>v&eacute;rifier la taille du nom et du prenom entr&eacute;s (tronquer si
trop de caract&egrave;res)
<li>v&eacute;rifier que l'age est bien num&eacute;rique
(lire l'age sous forme alphab&eacute;tique puis le tranformer en
entier en utilisant la fonction `atoi')
</ul>

<a name="section53">
<h3>5.3. M&eacute;moire dynamique</h3>
G&eacute;n&eacute;raliser le programme pour un nombre quelconque d'items :
utiliser des pointeurs et les fonctions `malloc' et `realloc'.

<a name="section54">
<h3>5.4. Sauvegarde et relecture</h3>
permettre de sauvergarder les donn&eacute;es et de les relire dans
un fichier.
<p>

<img src="//www.enst.fr/gif/lignes/rouj.gif">
<address>
<img align=middle src="/cgi-bin/Count.cgi?ft=2|md=5|dd=C|sh=1|df=domeo_TP-gdb.cnt">
Page maintenue par <a href="http://www.enst.fr/~elc">Eric Lecolinet</a>
 <i><a href="mailto:elc@enst.fr">(elc@enst.fr)</a></i>. Sept 95 / Jan 97. 

</body>
</html>
