<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html>
<head>
<html>
<head>
<title>TP XWindow/Motif 3</title>
<base href="http://www.enst.fr/~domeo/TP-Motif3/TP-Motif3.html">
</head>

<body bgcolor="#ffffff">

<center>
<img src="//www.enst.fr/gif/lignes/rouj.gif">
<h1>TP XWindow / Motif 3</h1>
<h3>
<a href="http://www.enst.fr">ENST</a>
 - 
<a href="http://www.enst.fr/~icc/">Option ICC</a>
 -
Module ICHM
</h3>
<h3><i>
<a href="http://www.enst.fr/~elc">Eric Lecolinet</a> - B. Dupouy
</i></h3>
</h1>
<p>
</center>

<p>
<strong>
<img src=//www.enst.fr/gif/blueball.gif>
<a href="http://www.enst.fr/~domeo/TP-Motif1.html">TP1</a>
<a href="http://www.enst.fr/~domeo/TP-Motif2.html">TP2</a>
TP3
<a href="http://www.enst.fr/~domeo/Exemples-Motif">Exemples</a>
<a href="http://www.enst.fr/~domeo">EO</a>
<a href="http://www.enst.fr/~elc">ELC</a>
</strong>

<img src="//www.enst.fr/gif/lignes/rouj.gif">
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<h2>Sommaire</h2>
<ul>
<li>Premi&egrave;re partie: Dessin et Interactions non standard
<li>Deuxi&egrave;me partie: R&eacute;activit&eacute; des interfaces
<li>Troisi&egrave;me partie: Couplage entre Interface et Noyau fonctionnel
</ul>
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<h1>Premi&egrave;re partie: Dessin et Interactions non standard</h1>
<p>
<p>

<h3>Interactions non standard: exemple du dessin &agrave; main lev&eacute;e</h3>
<p>
Les fonctions de callback "classiques" ne peuvent &ecirc;tre attach&eacute;es
qu'&agrave; des ressources pr&eacute;d&eacute;finies des widgets qui correspondent aux
conditions les plus courantes d'interaction. Motif pr&eacute;voit
ainsi par exemple que l'on puisse appeler une fonction de callback
quand on clique sur un PushButton (ressource <tt>XmNactivateCallback</tt>),
quand on appuie dessus (<tt>XmNarmCallback</tt>) ou quand on relache
ce bouton (<tt>XmNdisarmCallback</tt>). Mais rien n'est pr&eacute;vu pour 
appeler une telle fonction quand la souris entre sur le PushButton,
bouge &agrave; l'int&eacute;rieur du bouton, etc. Il est alors n&eacute;cessaire de faire
appel &agrave; d'autres techniques d'interactions qui sont illustr&eacute;es
dans les exemples suivants.
<p>
Le programme <a href="ima1.c">ima1.c</a> 
montre comment utiliser le mecanisme des <b>Actions / Translations</b>
pour afficher la position de la souris quand on la bouge interactivement
sur une zone d'&eacute;cran. Le programme <a href="ima2.c">ima2.c</a> fait
la m&ecirc;me chose mais permet de plus de faire du dessin &agrave; main lev&eacute;e
quand on maintient le bouton 2 de la souris enfonc&eacute;.
Enfin le programme <a href="ima3.c">ima3.c</a> est similaire au
programme ima2.c mais utilise le m&eacute;canisme des <b>Event Handlers</b>.
<p>
Ces exemples montrent &eacute;galement comment faire appel aux fonctions
de la <b>Xlib</b> depuis une application Motif pour afficher du "dessin"
ou des graphiques. L'affichage se fait sur un <b>DrawingArea</b>
contenu dans une <b>ScrolledWindow</b> (i.e. une fen&ecirc;tre avec des ascenseurs).
On montre d'ailleurs au passage comment programmer une <tt>ScrolledWindow</tt>
pour qu'elle g&egrave;re automatiquement son contenu (c'est-&agrave;-dire une fen&ecirc;tre
de plus grande taille: le <tt>DrawingArea</tt> dans le cas qui nous interesse)
lorsque l'on interagit sur les ascenseurs.
<p>
<b>Precisions:</b>
<p>
Cette exemple montre:
<ul>
<li>
comment &eacute;crire de nouvelles <b>Actions</b> dans le code C
<p><li>
comment les d&eacute;clarer au Toolkit de telle sorte
qu'elles soient "visibles" depuis les tables de translation
(fonction <tt>XtAppAddActions</tt>)
<p><li>
comment les lier &agrave; des &eacute;v&eacute;nements symboliques en modifiant les
<b>tables de translation</b> dans une liste de fallbacks 
(de facon equivalente, on aurait pu faire la meme chose en utilisant 
un fichier de ressources ou les d&eacute;finissant "en dur" dans le code C)
<p><li>
comment utiliser les Event Handlers (exemple ima3.c)
<p><li>
comment r&eacute;cuperer les <b>XEvents</b>, les <b>Windows</b> associ&eacute;es
aux Widgets et comment afficher des <b>primitives graphiques</b> telles que
des traits en utilisant les fonctions de la <b>Xlib</b>
</ul>

<p><img src="//www.enst.fr/gif/lignes/rouj.gif">

<h3>Application: Dessin et Aide sensitive</h3>
<p>
Ecrire un nouveau programme (que l'on appelera "imaexo.c") qui s'inspire
des exemples pr&eacute;c&eacute;dents en y rajoutant les fonctionnalit&eacute;s suivantes:
<ol>
<li>
permettre l'affichage d'un trait, d'un rectangle ou d'un cercle 
&agrave; une position donn&eacute;e. Les coordon&eacute;es de la primitive graphique
pourront &ecirc;tre sp&eacute;cifi&eacute;es:
<ul>
<li>
soit interactivement &agrave; l'aide de la souris
<li>
soit textuellement &agrave; l'aide de champs de saisie et de boutons
</ul>
(choisir <b>une</b> des deux possibilit&eacute;s)

<p>
<li>
rajouter une <b>aide contextuelle</b> qui fasse en sorte qu'un message ad&eacute;quat
s'affiche automatiquement sur une zone pr&eacute;d&eacute;termin&eacute;e
chaque fois que l'on fait entrer la souris sur un des widgets de l'interface
(il s'agit de faire une aide contextuelle similaire &agrave; ce que l'on
peut trouver sur Word, Netscape, etc.). 
<p>
Indication: on pourra soit utiliser le mecanisme des Actions / Translations 
soit employer des Events Handlers pour impl&eacute;menter cette fonctionnalit&eacute;.
</ul>

<p><img src="//www.enst.fr/gif/lignes/rouj.gif">

<h3>Gestion des rafra&icirc;chissements</h3>
<p>
Les exemples pr&eacute;c&eacute;dents sont en fait incomplets car ils ne rafra&icirc;chissent
pas la zone d'affichage graphique lorsque cela est n&eacute;cessaire.
Pour s'en convaincre : faites passer une autre fen&ecirc;tre au dessus du 
DrawingArea qui sert &agrave; l'affichage graphique puis enlevez cette fen&ecirc;tre.
Le probl&egrave;me est du au fait que les primitives graphiques (traits,
rectangles, etc.) ne sont jamais r&eacute;affich&eacute;es implicitement contrairement
aux widgets qui int&egrave;grent des m&eacute;thodes sp&eacute;cifiques pour effectuer
leur r&eacute;affichage de mani&egrave;re automatique.
<p>
Comment pourrait-on r&eacute;soudre ce probl&egrave;me de r&eacute;affichage des
primitives graphiques (plusieurs solutions sont possibles) ?

<p>
<img src="//www.enst.fr/gif/lignes/rouj.gif">
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<h1>Deuxi&egrave;me partie: R&eacute;activit&eacute; des interfaces</h1>
<p>

<h3><a name="CA1">R1. Rafra&icirc;chissement</a></h3>
<p>
Le programme "gc1" (compos&eacute; des fichiers 
<a href="gc.c">gc.c</a>, <a href="disp.h">disp.h</a>
et <a href="disp1.c">disp1.c</a> - 
voir le fichier <a href="Makefile">Makefile</a>)
montre un exemple d'interface qui lance un "gros calcul".
Le probl&egrave;me pos&eacute; concerne le rafra&icirc;chisement (c'est-&agrave;-dire)
la mise a jour de la pr&eacute;sentation graphique) 
et la r&eacute;activit&eacute; (le fait que les &eacute;v&eacute;nements soient imm&eacute;diatement pris
en compte) de l'interface. 
<p>
Compiler, ex&eacute;cuter et regarder le code de gc1.
Le bouton <tt>GO</tt> lance le calcul et le bouton <tt>Exit</tt> 
permet de sortir.
Tester le rafra&icirc;chissement lorsque le calcul est lanc&eacute; (typiquement en 
faisant passer une autre fen&ecirc;tre par dessus l'interface). Tester la
r&eacute;activit&eacute; en appuyant sur <tt>Exit</tt>. Que se passe-t'il ? Pourquoi ?
<p>
<b>Remarque:</b>
<br>
le code de cette interface comporte une bizarrerie. Laquelle
et pourquoi ? (indication: que se passe-t'il quand on essaie de fermer
l'application non pas avec "Exit" mais avec le bouton "Close" du menu
du Window Manager).

<p>
<h3><a name="CA2">R2. Rafra&icirc;chissement (bis)</a></h3>
<p>
Le programme "gc2" (compos&eacute; des fichiers 
<a href="gc.c">gc.c</a> et <a href="disp2.c">disp2.c</a>)
comporte une l&eacute;g&egrave;re am&eacute;lioration par rapport &agrave; la version pr&eacute;c&eacute;dente. 
Pour s'en convaincre, tester de nouveau le rafra&icirc;chissement de l'interface
et regarder plus particuli&egrave;rement le code de la fonction 
<b><tt>AfficheMessage</tt></b>.
<p>
Conclusions ?

<p>
<h3><a name="CA3">R3. Retours visuels</a></h3>
<p>
Le programme "gc3" (compos&eacute; des fichiers 
<a href="gc.c">gc.c</a> et <a href="disp3.c">disp3.c</a>)
montre comment programmer un <b>retour visuel</b> appropri&eacute; destin&eacute; 
&agrave; indiquer &agrave; l'utilisateur que l'interface est bloqu&eacute;e car en train 
d'effectuer un calcul de longue dur&eacute;e. De nombreuses solutions peuvent 
&ecirc;tre envisag&eacute;es (par exemple un voyant qui passe du vert au rouge, 
un curseur qui progresse en fonction de l'&eacute;tat des calculs, des boutons 
qui changent d'aspect ou de sensitivit&eacute; ...). 
Dans l'exemple propos&eacute;, la fonction <b><tt>BusyCursor</tt></b>
permet de changer l'apparence du pointeur qui mat&eacute;rialise la souris &agrave; l'&eacute;cran
et d'afficher une montre &agrave; la place de la fl&egrave;che usuelle.
<p>

<p>
<h3><a name="CA4">R4. Reactivite</a></h3>
<p>
Nous allons maintenant essayer de r&eacute;soudre le probl&egrave;me 
de la <b>r&eacute;activit&eacute;</b> de l'interface. Pour se faire, on rajoute un bouton 
<tt>Stop</tt> qui est cens&eacute; permettre d'interrompre le calcul une fois lanc&eacute;. 
Ce type de probl&egrave;me peut &eacute;ventuellement &ecirc;tre r&eacute;gl&eacute; en utilisant 
en ex&eacute;cutant l'interface et le noyau fonctionnel de l'application
au moyen de <b>threads</b> ou de <b>processus</b> s&eacute;par&eacute;s.
Nous allons essayer ici de le r&eacute;soudre avec une solution "purement X". 
L'id&eacute;e est de faire en sorte
que la fonction de calcul teste &agrave; intervalle r&eacute;gulier (par exemple chaque
fois qu'elle affiche un message) si l'on a appuy&eacute; sur le bouton <tt>stop</tt>.
<p>
Il vous faut donc &agrave; partir du code de l'exercice pr&eacute;c&eacute;dent :
<ul>
<li>
rajouter un bouton "Stop" &agrave; l'interface qui ait une action appropri&eacute;e
<li>
cr&eacute;er une fonction "StopTest" qui soit appel&eacute;e &agrave; intervalle r&eacute;gulier dans
"gros_calcul" et qui teste si l'on a pr&eacute;c&eacute;demment cliqu&eacute; sur "Stop"
</ul>
Indications: bien r&eacute;fl&eacute;chir et regarder le manuel de la fonction 
<b><tt>XtAppMainLoop</tt></b>.
<br>
Fichiers: regardez <a href="gcstop.c">gcstop.c</a> 
et compl&eacute;tez <a href="disp4.c">disp4.c</a>.
<p>
<b>Remarque: </b>passez &agrave; l'exemple suivant si vous n'arrivez pas &agrave;
faire cet exercice.
<p>

<p>
<h3><a name="CA5">R5. Synth&egrave;se</a></h3>
<p>
Cet exemple constitue une synth&egrave;se des pr&eacute;c&eacute;dents et montre &agrave; la fois
comment g&eacute;rer de mani&egrave;re ad&eacute;quate les rafra&icirc;chissements, la r&eacute;activit&eacute;
et la mise en &eacute;vidence de retours visuels appropri&eacute;s. 
<p>
Compilez et ex&eacute;cutez le programme <tt>gc5</tt>.
Consultez les fichiers <a href="gcstop.c">gcstop.c</a> 
et <a href="disp5.c">disp5.c</a>.
<p>

<p>
<img src="//www.enst.fr/gif/lignes/rouj.gif">
<img src="//www.enst.fr/gif/lignes/rouj.gif">

<h1>Troisi&egrave;me partie:
<br>
Couplage entre Interface et Noyau fonctionnel</h1>
<p>
<h3>C1. Boucle d'&eacute;v&eacute;nements et sockets</h3>
<p>
Cet exemple montre comment coupler un programme qui comporte une
interface graphique avec un autre programme (non graphique)
qui peut &eacute;ventuellement tourner sur une machine distante.
Ces deux programmes communiquent au moyen de <b>sockets</b> Unix.
<p>
Plus pr&eacute;cis&eacute;ment:
<ul>
<li>
Le programme <a href="client.c">client.c</a> lit des donn&eacute;es sur le
terminal au moyen d'un classique <tt>scanf</tt> et les envoie
&agrave; l'interface graphique.
<p>
<li>
le programme "interx" re&ccedil;oit ces messages et les affiche sur son
interface graphique. Ce programme se compose de 2 fichiers:
<ul>
<li>
<a href="dispx.c">dispx.c</a> contient la partie interface utilisateur.
Ce fichier est similaire aux exemples <tt>disp*.c</tt> vus pr&eacute;c&eacute;demment.
<li>
<a href="servx.c">servx.c</a> contient la partie serveur r&eacute;alisant
la gestion des sockets. Ce fichier initialise la lecture des sockets,
lance la <tt>XtMainLoop</tt> et contient les fonctions n&eacute;cessaires
pour traiter l'arriv&eacute;e de donn&eacute;es sur les sockets et remettre &agrave;
jour l'interface.
</ul>
</ul>
<p>
Regarder, comprendre et compiler les programmes <tt>client</tt>
et <tt>interx</tt>. Lancer ces deux programmes (dans le bon ordre!)
avec les arguments ad&eacute;quats.
<p>
<b>Remarque:</b>
<br>
le fichier <tt>servx.c</tt> d&eacute;finit <tt>gere_reseau</tt>
une fonction de call-back d'un genre particulier (son prototype 
diff&egrave;re des fonctions de call-back usuelles) qui sera automatiquement
appel&eacute;e par la <tt>XtMainLoop</tt> chaque fois qu'un nouveau message
sera envoy&eacute; par le programme <tt>client</tt> sur la socket d'&eacute;coute.
Cette fonction est d&eacute;clar&eacute;e &agrave; la <tt>XtMainLoop</tt> lors de
l'initialisation par appel de la fonction <b><tt>XtAppAddInput</tt></b>.
<p>

<h3><a name="RTFToC7">C2. Application </a></h3>
<p>
Reprendre l'exemple <tt>imaexo</tt> r&eacute;alis&eacute; dans la premi&egrave;re section
et faire en sorte que l'affichage graphique puisse &ecirc;tre "command&eacute;
&agrave; distance" par le programme <tt>client</tt> de l'exemple pr&eacute;c&eacute;dent
(on donnera au "client" le type de primitive &agrave; afficher et ses
coordonn&eacute;es, la figure correspondante s'affichera automatiquement
dans l'interface de "imaexo").
<p>

<h3><a name="RTFToC7">C3. Utilisation des threads </a></h3>
<p>
(*Optionnel) Voir la partie B du  TP: 
<a href="http://www.enst.fr/~domas/TPIHM.html">
http://www.enst.fr/~domas/TPIHM.html</a>

<img src="//www.enst.fr/gif/lignes/rouj.gif">
<p>
<strong>
<img src=//www.enst.fr/gif/blueball.gif>
<a href="http://www.enst.fr/~domeo/TP-Motif1.html">TP1</a>
<a href="http://www.enst.fr/~domeo/TP-Motif2.html">TP2</a>
<a href="http://www.enst.fr/~domeo/TP-Motif3.html">TP3</a>
<a href="http://www.enst.fr/~domeo/Exemples-Motif">Exemples</a>
<a href="http://www.enst.fr/~domeo">EO</a>
<a href="http://www.enst.fr/~elc">ELC</a>
</strong>
<p>
<address>
<img align=top src="/cgi-bin/Count.cgi?ft=2|md=5|dd=C|sh=1|df=domeo_TP-Motif3.cnt">
Page maintenue par <a href="http://www.enst.fr/~elc">Eric Lecolinet</a>
 <i><a href="mailto:elc@enst.fr">(elc@enst.fr)</a></i>. Sept 95 / Fev 97. 

</body>
</html>
