<HTML> <HEAD> <TITLE>BH Homepage</TITLE> </HEAD>
<BODY BGCOLOR=#75A5C5 TEXT=#000000 LINK=#4040A0 VLINK=#FFFF00>
<CENTER>
<H3><HR>
Giesbert au ras des navets <P>
Avec "La Souille", Franz-Olivier Giesbert aborde un nouveau style : celui de la mauvaise litt&eacute;rature.<P>
Consternant
<HR></CENTER><I>(titres originaux)</I>
<BR>
<BR>
<BR>
</B> <H4>
<FONT SIZE=5> O</FONT>n imagine volontiers que M. Giesbert, persuad&eacute; qu'un bon journaliste sait n&eacute;cessairement &eacute;crire, fait partie de ces "gens de plume" qui ont souri en lisant le petit roman de Val&eacute;ry Giscard d'Estaing paru l'an dernier. Nous voila pourtant au d&eacute;sespoir corporatiste de le constater: si <I>La Souille</I>, roman de Franz-Olivier Giesbert, devait servir de norme litt&eacute;raire, nous serions contraints de d&eacute;cerner d'&eacute;tincelantes palmes &agrave; VGE. 
<P>
Eh quoi ! On aimerait, on voudrait, mais comment soutenir un coll&egrave;gue, si brillant soit-il, qui affirme des la premi&egrave;re page son igorance du pass&eacute; simple et de son usage ? "Un jour que je laissai ma carte d'identit&eacute; sur la table, mon patron la prit pour regarder la photo": doit-on rester logique et penser que J&eacute;sus, le personnage qui parle, l'avait laiss&eacute;e, ou doit-on s'en tenir a la lettre et penser qu'il &eacute;tait en train de la laisser au moment dont il parle ? Tournez la page, le massacre continue. "Aujourd'hui, je suis m&ecirc;me devenu assez fier de ce second pr&eacute;nom, qui ne me convient pas si mal": est-ce pr&eacute;cis&eacute;ment le jour ou il &eacute;crit que la fiert&eacute; a gagn&eacute; Jesus, ou bien est-ce que le "devenu" est d&eacute;cidement de trop ? Allez savoir. 
<P>
Ce ne sont que deux extraits des trois premiers paragraphes. C'est &agrave; d&eacute;sesp&eacute;rer du journalisme. D'autant que, par ailleurs, le sujet pr&eacute;sente un int&eacute;r&ecirc;t pour le moins limit&eacute;. Au fin fond d'une Normandie de pacotille, un valet de ferme (le d&eacute;nomm&eacute; J&eacute;sus) raconte une histoire de mariage qui tourne au cauchemar. Point ? Point. 
<P>
Autant dire que l'on cherche en vain pourquoi M. Giesbert s'est senti oblig&eacute; d'&eacute;crire ce roman. 

<P>
<I>
Bertrand Leclair
</I>
<P>
Le Nouvel Economiste - 5/10/95
<P>
</H3>

<BR>
<H6>
<CENTER>
<HR>
<ADRESS>
Bruno HAVET -
<A HREF="mailto:BH@chef.net">&lt;BH@chef.net&gt;
</A>
<HR>
</ADRESS>
</BODY>
</HTML>
