<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Mac">
  <TITLE>pr&eacute;sentation prism&eacute;o</TITLE>
</HEAD>
<BODY BGCOLOR="#f9fad2">

<P><IMG SRC="images/hum.gif" WIDTH="62" HEIGHT="62" ALIGN="BOTTOM" NATURALSIZEFLAG=
"3"></P>

<P ALIGN=CENTER>PR&Eacute;SENTATION PRISM&Eacute;O<IMG SRC="images/cdrom.gif"
WIDTH="33" HEIGHT="34" ALIGN="BOTTOM" NATURALSIZEFLAG="3"></P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<P>Les &eacute;coles des T&eacute;l&eacute;communications ont cr&eacute;&eacute;
en 1996 un CD rom p&eacute;dagogique pr&eacute;sentant et expliquant le
fonctionnement du lecteur de CD rom. Un tel choix permet d'explorer l'ensemble
des domaines et des concepts affairant aux technologies de l'information
et de la communication et recouvre assez largement les disciplines enseign&eacute;es
dans les &eacute;coles, y compris les sciences humaines. Aujourd'hui l'utilisation
de ce CD rom est dans une phase exp&eacute;rimentale : plusieurs enseignants
l'int&eacute;grent &agrave; leur projet p&eacute;dagogique tandis qu'une
&eacute;quipe de quatre personnes (Hugues Choplin, Annie Gent&egrave;s,
Yves Jeanneret, Emmanu&euml;l Souchier) sous la direction du chef de projet
Arnaud Galisson analysent ce nouveau produit de communication. L'&eacute;quipe
de recherche &eacute;tudie tout particuli&egrave;rement :</P>

<P>- la rh&eacute;torique particuli&egrave;re du CD rom (&quot;rh&eacute;torique
n&eacute;goci&eacute;e&quot;) de fa&ccedil;on &agrave; &eacute;tablir un
bilan du produit communicationnel global et &agrave; d&eacute;finir et explorer
les limites et les potentiels d'un tel support dans le cadre d'un objectif
p&eacute;dagogique ;</P>

<P>- le jeu des contraintes propres &agrave; l'interaction des acteurs :
graphistes, informaticiens, ergonomes, psychologues, juristes, enseignants
- r&eacute;dacteurs des diff&eacute;rents articles, et les cons&eacute;quences
pour le produit final : sujets, outils et rh&eacute;toriques de l'&eacute;criture
multim&eacute;dia. L'objectif est de r&eacute;fl&eacute;chir &agrave; ce
mode de production &eacute;crite &agrave; plusieurs et de d&eacute;finir
&eacute;ventuellement une meilleure gestion du projet.
</BODY>
</HTML>
