<!-----------------------------------------------------------------------
-									-
-									-
-			     Andrej Sobkowski				-
-									-
-			    Java et JavaScript				-
-									-
-									-
------------------------------------------------------------------------>
<HTML>
<TITLE>Les Applications Java</TITLE>

<BODY>
<BR>
<CENTER><FONT COLOR = "red"><H1>Les Applications Java</H1>
by Andrej Sobkowski
</FONT>
</CENTER>

<HR>

<P>Cette partie est consacr&eacute;e &agrave; l'&eacute;tude des bases du langage Java. Vous y trouverez des exemples sur <A HREF = "applications.html#syntaxe">la syntaxe</A>, <A HREF = "applications.html#lignecommande>le passage de param&egrave;tres de la ligne de commande</A>, <A HREF = "applications.html#proprietes">les propri&eacutet&eacute;s</A>, <A HREF = "applications.html#threads">les Threads</A>, <A HREF = "applications.html#exceptions">les Exceptions</A> et le traitement des <A HREF = "applications.html#fichiers">Fichiers</A>.

<P>Cette section n'est pas particuli&egrave;rement amusante... mais c'est une partie n&eacute;cessaire pour pouvoir passer &agrave; des caract&eacute;ristiques plus passionnantes.

<HR>

<A NAME = "syntaxe"><H2>La syntaxe</H2><BR>
<P>L'exemple <A HREF = "./SOURCE/ExString.java" TARGET = _blank>ExString.java</A> montre les bases du langage, la d&eacute;claration de classes, l'h&eacute;ritage, l'overriding et l'overloading.

<HR>

<A NAME = "lignecommande"><H2>Passage de param&egrave;tres de la ligne de commande</H2><BR>
<P>Le fichier <A HREF = "./SOURCE/ParLigneCommande.java" TARGET = _blank>ParLigneCommande.java</A> contient le code pour configurer l'ex&eacute;cution d'un programme &agrave; partir de la ligne de commande.
<P>La syntaxe accept&eacute;e est la suivante:<BR>
<CODE>ParLigneCommande -verbose -cvx -file filename</CODE>

<HR>

<A NAME = "proprietes"><H2>Les Propri&eacute;t&eacute;s</H2><BR>
<P>Dans <A HREF = "./SOURCE/ExProprietes.java" TARGET = _blank>ExProprietes.java</A> on peut trouver un exemple de comment r&eacute;cup&eacute;rer les propri&eacute;t&eacute;s du syst&egrave;me et comment en ajouter &agrave; partir du fichier <A HREF = "./SOURCE/Proprietes.txt" TARGET = _blank>Proprietes.txt</A>.

<HR>

<A NAME = "threads"><H2>Les Threads</H2><BR>
<P>Pour v&eacute;rifier si le syst&egrave;me est fourni de time-slicing, on  peut utiliser l'exemple <A HREF = "./SOURCE/ExThreads.java" TARGET = _blank>ExThreads.java</A> dans lequel on lance en m&ecirc;me temps deux threads: sur des stations Unix, le temps CPU est partag&eacute; entre les deux threads.

<HR>

<A NAME = "exceptions"><H2>Les Exceptions</H2><BR>
<P>L'exemple <A HREF = "./SOURCE/ExExceptions.java TARGET = _blank">ExExceptions.java</A> montre comment traiter les erreurs gr&acirc;ce aux exceptions. En fait, on essait d'ouvrir un fichier qui n'existe pas (v&eacute;rifier de ne pas avoir dans le r&eacute;pertoire un fichier "abcdef.txt") et d'acc&eacute;der &agrave; un &eacute;l&eacute;ment d'un tableau avec un index trop &eacute;lev&eacute;.
<P>Dans <A HREF = "./SOURCE/ExException2.java TARGET = _blank">ExException2.java</A> on cr&eacute;e une nouvelle exception gr&acirc;ce &agrave; l'h&eacute;ritage de la classe Exception.

<HR>

<A NAME = "fichiers"><H2>Les Fichiers</H2><BR>
<P>Finalement, le fichier <A HREF = "./SOURCE/ExIOFiles.java" TARGET = _blank>ExIOFiles.java</A> contient des informations sur comment lire et &eacute;crire un fichier.

<HR>

<BR>
<CENTER>
 - ENST T&eacute;l&eacute;com Paris -<BR>
M&eacute;moire de fin d'&eacute;tudes - Andrej Sobkowski
</CENTER>
</BODY>
</HTML>

