<HTML>

<HEAD>
<LINK HREF="http://www.enst.fr/~hautesse/" NAME="Les Chieurs Homepage" TITLE="Les Chieurs Homepage"></A>
<TITLE>San Francisco : Intro</TITLE>
</HEAD>
<BODY BGCOLOR="#92DA85">
<CENTER>
   <IMG ALIGN=absmiddle SRC="./image_sf/titre.jpg" ALT="Titre">
</CENTER>
<BR>

<P>Profitant du Labor Day week-end, je m'en suis all&eacute; visiter mes amis de la 
c&ocirc;te Ouest, plus pr&eacute;cisemment ceux de San Francisco.
</P>

<P>Enfin bon, je dis "mes amis", c'est
surtout parce que &ccedil;a co&ucirc;te cher de se loger dans ce coin-l&agrave;, voyez. Mais de
&ccedil;a vous vous en foutez s&ucirc;rement, alors je me suis dit que pour attirer le
client et tirer le maximum de recette publicitaire de cette page, j'allais vous
y proposer mes photos. On sait jamais, ca peut m&ecirc;me vous plaire, on voit de 
tout aujourd'hui ma pauv' dame.
</P>

<P>Dans la tradition des Grands Reportages Photo, j'ai essay&eacute; de classer &ccedil;a 
proprement, 
histoire que vous puissiez sauter les parties qui vous lassent. Mais ne r&ecirc;vez
pas trop, elles vont toutes vous faire gonfler, c'est pas la page des Chieurs
pour rien.
</P>

<OL COMPACT TYPE=i>
<LI>Les Collines de banlieue : SF tellement 
  <A HREF="./sf_01.htm">bidonville</A> 
  <FONT SIZE=1>(apr&eacute;s &ccedil;a s'am&eacute;liore)</FONT>
<LI>Dans les rues du centre : SF tellement 
  <A HREF="./sf_02.htm">form&eacute;e</A>
<LI>Les vieilles baraques : SF tellement 
  <A HREF="./sf_03.htm">victorienne</A>
<LI>Downtown & Skyscrapers : SF tellement 
  <A HREF="./sf_04.htm">centr&eacute;e</A>
<LI>Les vieux quartiers : SF tellement 
  <A HREF="./sf_05.htm">typique</A>
<LI>Les ponts et le port : SF tellement 
  <A HREF="./sf_06.htm">humide</A>
<LI>Vues globales : SF tellement 
  <A HREF="./sf_07.htm">a&eacute;rienne</A>
<LI>Ce qu'il reste : SF tellement 
  <A HREF="./sf_08.htm">surprenante</A>
</OL>

<HR>

<H5>Note Technique : Laissez tomber, vous n'allez pas comprendre. Bon OK,
alors les pages ne contiennent que des previews pour ne pas p&eacute;naliser les 
possesseurs de modems &agrave; faible capacit&eacute;. Les images finales, au format JPEG
compression elev&eacute;e, sont li&eacute;es dynamiquement aux previews.</H5>
<H5><B>Note Technique (simplifi&eacute;e) : L&agrave; vous allez comprendre. Dans les pages,
c'est petit et &ccedil;a va vite, mais si on clique dans les petites images, on a les
grosses, mais &ccedil;a va vite quand m&ecirc;me. On a compris ?</H5> 

</BODY>
</HTML>